[
    {
        "title": "Aeromechanics I",
        "subjectCode": "AAE",
        "courseCode": "20300",
        "instructor": [
            "Danilo De Camargo Branco",
            "Hashim Hassan",
            "Ronald F Agyei"
        ],
        "description": "Fundamental concepts and principles of bodies in motion, with applications to aeronautical and astronautical problems. Subjects covered include rectilinear motion, curvilinear motion, rotation, and plane motion. The static equilibrium and quasistatic equilibrium situations are treated as a part of motion in which the acceleration is zero. Problems involving impact, separation, work, and energy are considered.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Aeromechanics II",
        "subjectCode": "AAE",
        "courseCode": "20400",
        "instructor": [
            "Tyler N Tallman"
        ],
        "description": "Loads on aircraft. Strain, stress, and equations of equilibrium. Description of aircraft structures and materials. Torsion of shafts. Fuselage and wing structures. Symmetrical bending and stiffness analysis of solid and stringer-panel box beams. Structural failures.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Aerospace Design",
        "subjectCode": "AAE",
        "courseCode": "25100",
        "instructor": [
            "Danilo De Camargo Branco",
            "Thomas Fletcher Cunningham"
        ],
        "description": "The role of design in aerospace engineering. Introduction to aerodynamics, performance, propulsion, structures, stability and control, and weights. Layout and general arrangement of aerospace vehicles. Design concept generation and selection. Computational methods for design. Trade studies and graphical optimization. Conceptual design exercise involving aircraft, spacecraft, or both. Technical presentations and communication for aerospace engineering.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Signal Analysis For Aerospace Engineering",
        "subjectCode": "AAE",
        "courseCode": "30100",
        "instructor": [
            "Dengfeng Sun",
            "Husheng Li",
            "James Michael Goppert"
        ],
        "description": "Signal processing and spectral analysis for aerospace engineering. Fourier and fast Fourier transforms. Vibration analysis; estimation of natural frequencies, wing vibrations. Introduction to linear circuits, operational amplifiers and filtering. Noise suppression.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Fluid Mechanics",
        "subjectCode": "AAE",
        "courseCode": "33300",
        "instructor": [
            "Kazuki Maeda",
            "James Vincent Canino",
            "Joseph S Jewell"
        ],
        "description": "Kinematics of fluids and conservation equations for mass, momentum, and energy. Viscous and inviscid incompressible flow. Lift and drag in subsonic flow. Introduction to compressibility and boundary layers. Potential flow.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Aerodynamics",
        "subjectCode": "AAE",
        "courseCode": "33400",
        "instructor": [
            "James Vincent Canino"
        ],
        "description": "Incompressible airfoil and lifting line theory. Steady and unsteady, one-dimensional, linear and nonlinear flows. Normal shock waves. Steady, supersonic, two-dimensional linear and nonlinear flows. Oblique shock waves. Perturbation theory for wings and bodies. Design applications.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Thermal Sciences",
        "subjectCode": "AAE",
        "courseCode": "33800",
        "instructor": [
            "Haifeng Wang"
        ],
        "description": "A fundamental course covering a range of topics selected from the disciplines of engineering thermodynamics, fluid mechanics, heat transfer and combustion, with an emphasis on their application to propulsion. This is an entry level course to prepare students for advanced analysis of propulsion and energy systems. Upon completion of this course, students are expected to be able to apply fundamental principles to perform thermodynamic analysis for thermophysical problems involving fluid flow, heat transfer and combustion.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Aerospace Propulsion",
        "subjectCode": "AAE",
        "courseCode": "33900",
        "instructor": [
            "Stephen D Heister"
        ],
        "description": "Survey of air-breathing and rocket propulsion systems for AAE students not in the propulsion option. Thermodynamic cycles, analysis of air-breathing systems and components. Rocket Equation, rocket cycles, liquid and solid propellants, chemical equilibrium.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Dynamics And Vibrations",
        "subjectCode": "AAE",
        "courseCode": "34000",
        "instructor": [
            "David Arnas Martinez",
            "Carolin E Frueh"
        ],
        "description": "Kinematics and kinetics of particles and rigid bodies. Topics include a particle in orbit, systems of particles, vibrations, Euler's equations of motion, Eulerian angles, and aerospace vehicle dynamics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Aerospace Systems Design",
        "subjectCode": "AAE",
        "courseCode": "35103",
        "instructor": [
            "Leifur Thor Leifsson"
        ],
        "description": "Aerospace system lifecycle and design process. Stakeholder needs elicitation and requirements generation. Quality function deployment and hierarchical objective trees. Concept generation and creativity techniques. Introduction to safety, risk, cost and value analysis. Critical evaluation of the applicability of systems engineering techniques in specific contexts. Application of these techniques to a team semester design project.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Structural Analysis I",
        "subjectCode": "AAE",
        "courseCode": "35200",
        "instructor": [
            "Hashim Hassan",
            "Ronald F Agyei",
            "Wenbin Yu"
        ],
        "description": "Properties of wing and fuselage sections. Beam-column moments. Torsion of thin-walled and skin-stringer multiple-cell sections. Nonsymmetrical bending of skin-stringer wing sections. Flexural shear in open and closed thin-walled and skin-stringer sections. Loads and stresses in the rib system. Cutouts and shear lag. Modified beam theory for wing and fuselage design. Deflection by energy method. Introduction to composite structures.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Control System Analysis",
        "subjectCode": "AAE",
        "courseCode": "36400",
        "instructor": [
            "Inseok Hwang"
        ],
        "description": "Modeling and analysis of dynamical systems with aerospace applications. Laplace transforms, transfer functions, block diagrams.  Transient and steady-state response of dynamical systems. Root Locus, Bode, Nyquist methods for control systems analysis. Introduction to controller design.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Undergraduate Senior Seminar",
        "subjectCode": "AAE",
        "courseCode": "40000",
        "instructor": [
            "William A Crossley"
        ],
        "description": "A lecture-demonstration series emphasizing evaluation of career options, identification and development of professional skills. Example of career-related topics include choosing a job, and post graduate education in engineering or other disciplines. Examples of professional skills topics covered include interviewing, writing, and ethics. Assessment of student achievement of AAE program learning outcomes.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Computational Fluid Dynamics",
        "subjectCode": "AAE",
        "courseCode": "41200",
        "instructor": [
            "Gregory A Blaisdell"
        ],
        "description": "Introductory course in the formulation and application of finite difference methods for solving fluid flow problems. Classification of partial differential equations and formulation of well-posed problems. Discrete approximation of partial differential equations: stability, consistency, and convergence. Finite-volume formulations. Survey of methods for solving hyperbolic, elliptic, and parabolic problems. Formulation of discrete boundary conditions. Application of methods to one- and two-dimensional flow problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Viscous Flows",
        "subjectCode": "AAE",
        "courseCode": "41600",
        "instructor": [
            "Tom I-P Shih"
        ],
        "description": "Navier-Stokes equations, boundary layer theory, frictional drag and heating, separation and transition. Turbulent flows. Computational methods for laminar and turbulent flows.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Zero-Gravity Flight Experiment",
        "subjectCode": "AAE",
        "courseCode": "41800",
        "instructor": [
            "Steven H Collicott"
        ],
        "description": "Team-based design-build-test engineering experience to maximize the benefits of student participation in the NASA Reduced Gravity Student Flight Opportunity Program (or similar). Gravity, orbits, and weightlessness.  Low-gravity capillary fluid physics, scaling laws, and components. Experiment design for multiple short zero gravity test times. Technical proposal writing, design for manufacturability, experiment fabrication, planning, testing, and execution.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Flight Dynamics And Control",
        "subjectCode": "AAE",
        "courseCode": "42100",
        "instructor": [
            "Martin Corless",
            "Ran Dai"
        ],
        "description": "Flight vehicle rigid-body equations of motion; linearization via small perturbation techniques. Trim analysis, static and dynamic stability, aerodynamic stability derivatives and control effectiveness. Vehicle transfer functions, stability augmentation, aircraft handling qualities. Introduction to flexible vehicle effects.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Rocket Propulsion",
        "subjectCode": "AAE",
        "courseCode": "43900",
        "instructor": [
            "Stephen D Heister"
        ],
        "description": "Flight mechanics and the propulsion system requirements for terrestrial and interplanetary flight. Converging-diverging nozzle analysis and design. Thermochemistry of propellants and performance calculations. Solid rocket motor interior ballistics and design. Thrust chamber and turbo machinery analysis and design. Liquid rocket engine cycle analysis and design. Elements of nuclear and electric propulsion systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Spacecraft Attitude Dynamics",
        "subjectCode": "AAE",
        "courseCode": "44000",
        "instructor": [
            "Kenshiro Oguri"
        ],
        "description": "Description of orientation, angular velocity, and angular acceleration in terms of direction cosines, Euler parameters, and angles. Forces and moments acting on space vehicles. Attitude stability of various types of satellites in circular and elliptic orbits. Spin stabilization and gravity gradient torques. Gyroscopic devices and energy dissipation. Introduction to attitude control.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Spacecraft Design",
        "subjectCode": "AAE",
        "courseCode": "45000",
        "instructor": [
            "James L Garrison"
        ],
        "description": "Senior students perform a team-based spacecraft design, requiring application of the education and skills developed in the aerospace curriculum. Components include analysis methods for preliminary design, development of an initial vehicle concept, and development of a complete numerical model of the mission, culminating in oral and written reports by the teams.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Aircraft Design",
        "subjectCode": "AAE",
        "courseCode": "45100",
        "instructor": [
            "Leifur Thor Leifsson",
            "Li Qiao"
        ],
        "description": "Senior students perform a team-based aircraft design, requiring application of the education and skills developed in the aerospace curriculum. Aircraft mission requirements include engine cycle selection and airframe/engine integration, performance, stability and control, structures, human factors, avionics, sensors, and manufacturing processes. The teams present oral and written reports on their designs.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "TracSat DBT",
        "subjectCode": "AAE",
        "courseCode": "49000",
        "instructor": [
            "Alexey Shashurin"
        ],
        "description": "Hours and credit to be arranged. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            18
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Fluid Mechanics",
        "subjectCode": "AAE",
        "courseCode": "51100",
        "instructor": [
            "Jonathan Poggie"
        ],
        "description": "The basic conservation equations are derived for a compressible viscous fluid, and then are specialized for applications in potential flow, viscous flow, and gas dynamics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Orbit Mechanics",
        "subjectCode": "AAE",
        "courseCode": "53200",
        "instructor": [
            "Kathleen Howell"
        ],
        "description": "Orbit determination of near-earth satellites and various perturbations; libration and attitude control; orbit transfer and interception; lunar theory and interplanetary orbits; ascending mechanics and re-entry.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Spacecraft Electric Propulsion",
        "subjectCode": "AAE",
        "courseCode": "53400",
        "instructor": [
            "Alexey Shashurin"
        ],
        "description": "Spacecraft electric propulsion systems are intended to provide thrust for propelling spacecrafts in interplanetary missions, orbital maneuvers, and attitude control. The course will start with reviewing material on the mechanics and thermodynamics of propulsion, and identifying the niche occupied by the electric propulsion systems. The course will cover elements of plasma physics and electromagnetic theory essential for studying the electric propulsion systems. The core of the course will focus on studying various electric propulsion concepts which utilize electric power produced on-board to generate thrust. Mechanisms of the utilization of the electric power to accelerate gas or plasma and produce thrust will be considered, including electrothermal, electrostatic, electromagnetic, and gasdynamic acceleration mechanisms.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Propulsion Design, Build, Test",
        "subjectCode": "AAE",
        "courseCode": "53500",
        "instructor": [
            "Li Qiao"
        ],
        "description": "Intensive one-semester treatment of the aerospace propulsion component development process. Derivation of design requirements from mission objective to detailed components; the design process. Standard methods for thermostructural, life, performance, and combustion stability design analysis; combustor design. Experimental procedures; fabrication; test. Special topics according to student interest.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Hypersonic Propulsion",
        "subjectCode": "AAE",
        "courseCode": "53700",
        "instructor": [
            "Carson D Slabaugh"
        ],
        "description": "Analysis of advanced high speed air breathing propulsion concepts for hypersonic flight. Missions and trajectories. Engine/airframe integration. Aerothermodynamic analysis of ramjets, scramjets, and oblique detonation wave engines. On- and off-design of compression inlets and minimum length nozzles. Cryogenic fuels and skin cooling. Ram accelerator ballistic launch concepts.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Air Breathing Propulsion",
        "subjectCode": "AAE",
        "courseCode": "53800",
        "instructor": [
            "Guillermo Paniagua Perez"
        ],
        "description": "(ME 53800) Analysis of operating characteristics of turbojet, turbofan, turboshaft, afterburning, and ramjet propulsion systems. Analysis and design of inlet, diffuser, combustor, compressor, turbine, nozzle. Component matching and off-design performance. Inlet distortion, nozzle-afterbody, and installation losses. Mission analysis.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Aerospace Structural Dynamics And Stability",
        "subjectCode": "AAE",
        "courseCode": "54600",
        "instructor": [
            "James Francis Doyle"
        ],
        "description": "Dynamics of continuous systems: rod, beam, frame, and plate structures. General structural principles: virtual work, Hamilton's principle, Lagrange's equation, and Ritz method for discrete approximations. Modal analysis: eigenanalysis, mode shapes, mode superposition, and complex modes. Nonlinear vibrations: phase plane, Poincare, bifurcation plots, and chaos. Stability of the motion: classification of problems, follower loads, aerodynamic loads, divergence, flutter, pulsating compression, and gyroscopic systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Elasticity In Aerospace Engineering",
        "subjectCode": "AAE",
        "courseCode": "55300",
        "instructor": [
            "Tyler N Tallman"
        ],
        "description": "A basic course in the theory of elasticity with emphasis on understanding the fundamental principles and solution techniques used in the stress analysis of structures. Cartesian tensors. Governing equations for linear elasticity. Rigorous derivation of beam and plate equations from the three-dimensional elasticity equations. Torsion. Thermoelasticity. The stress functions and complex functions approaches to two-dimensional problems. Energy methods and approximate solutions. Three-dimensional problems. Knowledge of differential equations assumed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Aeroelasticity",
        "subjectCode": "AAE",
        "courseCode": "55600",
        "instructor": [
            "Andres Arrieta Diaz"
        ],
        "description": "The study of the effect of aerodynamic forces of flexible aircraft. Static aeroelastic problems; control effectiveness; lift effectiveness; divergence. Dynamic aeroelasticity; classical flutter; an introduction to stability augmentation with controls. A review of standard and modern numerical solution techniques; the k-method, the British or p-k method.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Finite Element Methods In Aerospace Structures",
        "subjectCode": "AAE",
        "courseCode": "55800",
        "instructor": [
            "Vikas Tomar"
        ],
        "description": "Introduction to the use of advanced finite element methods in the calculation of deformation, strain, and stress in aerospace structures. Topics include: 1-D, 2-D, 3-D, and axisymmetric elements, isoparametric element formulation, convergence, treatment of boundary conditions and constraints. Special topics include stability, dynamic analysis, and nonlinear material behavior. Emphasis is on the theoretical knowledge of the finite element method. Applied experience is gained by solution of aerospace structural analysis problems through use of professional software.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Convex Optimization",
        "subjectCode": "AAE",
        "courseCode": "56100",
        "instructor": [
            "Gesualdo Scutari"
        ],
        "description": "(IE 56100) Introduction to convex analysis, convex optimization problems, algorithms of convex optimization and measures of their complexity, and application of convex optimization in aerospace engineering. Recognition of convex optimization problems that arise in scientific and engineering applications. Introduction to software tools to solve convex optimization problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Systems Analysis And Synthesis",
        "subjectCode": "AAE",
        "courseCode": "56400",
        "instructor": [
            "Martin Corless"
        ],
        "description": "State space methods of analysis and design of continuous and discrete-time linear systems. Coordinate transformations, Jordan canonical forms, digital control, controllability and observability of continuous and discrete systems. Liapunov stability analysis. The linear regulator problem of optimal control via Hamilton Jacobi theory. Pole assignment, stabilizability, detectability. State estimation for deterministic models. Minimal order observers. MA 51100 recommended concurrently.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Satellite Navigation And Positioning",
        "subjectCode": "AAE",
        "courseCode": "57500",
        "instructor": [
            "James L Garrison"
        ],
        "description": "Introduction to radio-navigation techniques, using the Global Navigation Satellite System (GNSS); GNSS signal structures; satellite search and acquisition; satellite tracking; coordinate systems and time; observations; atmospheric effects; and position-velocity-time (PVT) solutions.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Aerospce Eng Probability & Est",
        "subjectCode": "AAE",
        "courseCode": "59000",
        "instructor": [
            "Arthur E Frazho",
            "Keith Allen LeGrand",
            "Karen Marais",
            "Tyler N Tallman",
            "Carolin E Frueh",
            "Dianyun Zhang",
            "Thomas Fletcher Cunningham"
        ],
        "description": "Topics vary - projects in Aeronautical Engineering. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Advanced Orbital Dynamics",
        "subjectCode": "AAE",
        "courseCode": "63200",
        "instructor": [
            "Kathleen Howell"
        ],
        "description": "Discussion of more advanced concepts in astrodynamics. Includes fundamental theories from celestial mechanics, as well as trajectory determination and perturbation analysis with application to the motion of Earth-orbiting and interplanetary spacecraft. Assumes experience with the two-body problem. Offered in alternate years. Prerequisite: AAE 50700, 53200.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Liquid Propell Chem & App",
        "subjectCode": "AAE",
        "courseCode": "69000",
        "instructor": [
            "Timothee L Pourpoint"
        ],
        "description": "Topics vary. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Fall 2023"
    }
]