[
    {
        "title": "Introduction To Data Analytics For Agricultural Business",
        "subjectCode": "AGEC",
        "courseCode": "20201",
        "instructor": [
            "Yizhou Hua"
        ],
        "description": "Overview of data analytics in agricultural business. Students are exposed to an overview of software tools with a primary focus on Excel, introduction to relational databases, and data visualization. Focus is in using financial, accounting, and economic data to make management decisions. Laptop required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introductory Microeconomics For Food And Agribusiness",
        "subjectCode": "AGEC",
        "courseCode": "20300",
        "instructor": [
            "John G Lee",
            "Chad M Fiechter"
        ],
        "description": "This course introduces the application of microeconomics as used by farms and agribusiness firms. The behavior of individual firms is evaluated as price and output are determined in various market structures (pure competition, pure monopoly, monopolistic competition, and oligopoly). Other topics include pricing and employment of resources, market failure and the social control of industry (government, economics policy, and regulation), cost and production theory.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Economics",
        "subjectCode": "AGEC",
        "courseCode": "21700",
        "instructor": [
            "Leeann Elizabeth Moss"
        ],
        "description": "National economic problems such as unemployment, recessions, inflation, taxation, bank interest rates, the growth of government, monetary systems, and a rising national debt are discussed along with the principles, policies, and institutions for solving these macroeconomic problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Economics Of Agricultural Markets",
        "subjectCode": "AGEC",
        "courseCode": "22000",
        "instructor": [
            "Joseph V Balagtas"
        ],
        "description": "This class provides an overview of U.S. and international agricultural markets, and develops a framework for analyzing those markets. Concepts include determination of agricultural prices, spatial dimensions of agricultural markets, and trade; temporal dimensions of agricultural markets, and futures and options markets; and public policy in agricultural markets.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Economic Geography Of World Food And Resources",
        "subjectCode": "AGEC",
        "courseCode": "25000",
        "instructor": [
            "Kajal Gulati"
        ],
        "description": "A study of the important issues and economic decisions about worldwide resource use for food and fiber production as influenced by geography, climate, history, social institutions, national self-interest, and the environment.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Mentoring Leadership",
        "subjectCode": "AGEC",
        "courseCode": "26000",
        "instructor": [
            "Andrew E Oppy"
        ],
        "description": "This course is designed to teach upperclassmen how to mentor freshman to thrive and survive as entering freshmen in Agricultural Economics. The main focus is on the transition to college life, as well as practical information on time management, taking and rewriting classroom notes, preparing for examinations and quizzes, dealing with stress and interpersonal relationships, and health. Additional topics include opportunities for student involvement in campus life and organizations, career paths for the various programs of study in Agricultural Economics, and how to successfully work in groups. Mentors are restricted to AGBS, AGEC, AGFN, AGMG, FARM, FIMM, QAEC, and SLMK students. Permission of department required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Foundational Internship",
        "subjectCode": "AGEC",
        "courseCode": "28900",
        "instructor": [
            "Andrew E Oppy"
        ],
        "description": "Foundational internship that is preplanned and conducted under the direction of a faculty or staff member working in cooperation with an employer representative. A learning plan must be developed and approved by the student, faculty or staff coordinator, and employer representative prior to beginning the internship. A comprehensive report describing the management strategies used by the company or organization when he/she spent their internship is required. Permission of department required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Freshmen Community",
        "subjectCode": "AGEC",
        "courseCode": "29600",
        "instructor": [
            "Jodie L Thomas",
            "Jay T Akridge"
        ],
        "description": "Special topics in agricultural economics aimed at sophomore-level students. May be repeated for credit under a different topic title.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Sophomore Seminar",
        "subjectCode": "AGEC",
        "courseCode": "29800",
        "instructor": [
            "Jennifer Leeann Williams"
        ],
        "description": "Current agricultural economics issues will be analyzed and discussed. Issue areas will be related to individual career planning and program development.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Agricultural Prices",
        "subjectCode": "AGEC",
        "courseCode": "30500",
        "instructor": [
            "Anna Kay Aarstad"
        ],
        "description": "Analysis of prices and the movement of farm product prices; relations of farm product prices to farm input and other prices; conceptual and statistical analysis of agricultural supply and demand relationships; application of price analysis, price forecasting, agricultural outlook, agricultural policy; adjustment of farming to new price conditions.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Principles Of Commodity Marketing",
        "subjectCode": "AGEC",
        "courseCode": "32100",
        "instructor": [
            "James R Mintert"
        ],
        "description": "An in-depth background on the origin, operation, and application of futures and options in risk management for agriculture. Covers grain, livestock, and yield futures and options. Applications of futures and options to price and yield risk management is provided. Comparison of expected results from various risk management alternatives and decision-making processes to use in selecting a risk management strategy.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Management Methods For Agricultural Business",
        "subjectCode": "AGEC",
        "courseCode": "33000",
        "instructor": [
            "Brady E Brewer"
        ],
        "description": "Management of nonfarm, agriculturally related businesses. Topics include tools for management decision making, legal forms of business organization, basics of accounting, and important financial management techniques. Case studies and computer simulation game.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Principles Of Industrial Selling",
        "subjectCode": "AGEC",
        "courseCode": "33100",
        "instructor": [
            "W Scott Downey"
        ],
        "description": "The principles of selling and their application to the industrial businesses. Topics include attitudes and value systems, basic behavioral patterns, the purchase decision process, relationship of sales to marketing, selling strategies, preparing for sales calls, making sales presentations, handling objections, and closing sales. Emphasis is placed on application of principles to real-world situations and on building selling skills through class projects. Requires class trips. Students will pay individual lodging or meal expenses when necessary.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "International Economic Development",
        "subjectCode": "AGEC",
        "courseCode": "34000",
        "instructor": [
            "Kajal Gulati"
        ],
        "description": "This course is designed to introduce students to issues and problems related to international economic development. Topics covered include a description of the current situation in developing countries and the history of growth and development. The course is grounded in the body of theory associated with economic development, but concentrates on the many practical problems such as poverty, population growth, urbanization, education and the environment. The three areas with the greatest attention are agricultural development, international trade, and policy analysis for developing countries.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Quantitative Techniques For Firm Decision Making",
        "subjectCode": "AGEC",
        "courseCode": "35200",
        "instructor": [
            "Roman M Keeney"
        ],
        "description": "Introduction to mathematical programming and computing as an aid to agricultural decision making by firms, linear programming, game theory and strategy, simulation, the waiting-line problem, the equipment replacement decision, and multiproduct scheduling methods.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Natural Resource And Environmental Economics",
        "subjectCode": "AGEC",
        "courseCode": "40600",
        "instructor": [
            "Carson J Reeling"
        ],
        "description": "(FNR 40600) Introduction to economic models of renewable and nonrenewable natural resources and the use of these models in the analysis of current resource use and environmental issues.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Farm Management",
        "subjectCode": "AGEC",
        "courseCode": "41100",
        "instructor": [
            "Nathanael M Thompson"
        ],
        "description": "Principles of farm organization and management, farmer interviews, and the application of computerized farm decision-making methods.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Financial Management Of Agricultural Business",
        "subjectCode": "AGEC",
        "courseCode": "42400",
        "instructor": [
            "Tor Nicholas Tolhurst"
        ],
        "description": "A study of the major types of financial decisions made by agriculturally related firms, including investment in inventory, receivables and cash, property, plant, and equipment; sources and types of short-term, intermediate, and long-term capital; legal patterns of the business organization, emphasis on implementation involving agribusiness case problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Estate Planning And Property Transfer",
        "subjectCode": "AGEC",
        "courseCode": "42500",
        "instructor": [
            "Jeanna M Pitstick"
        ],
        "description": "The ownership and transfer of farm business property. Includes tax and other implications of life estates, trust arrangements, sale of property, and charitable contributions.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Advanced Agribusiness Marketing",
        "subjectCode": "AGEC",
        "courseCode": "42700",
        "instructor": [
            "Brenna Daun Ellison"
        ],
        "description": "Application of marketing principles to market planning, research, and analysis. Development of strategic marketing plans for agribusiness.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Agricultural And Food Business Strategy",
        "subjectCode": "AGEC",
        "courseCode": "43000",
        "instructor": [
            "Leeann Elizabeth Moss"
        ],
        "description": "An advanced course in business planning and strategy for potential agribusiness and food firm managers. Focuses on development of viable business strategy in the context of the firm's market and its internal condition. Makes extensive use of case studies that document management dilemmas of agribusiness firms, ranging from those providing inputs to agricultural producers to firms involved in the retail distribution of food.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Advanced Industrial Sales And Marketing",
        "subjectCode": "AGEC",
        "courseCode": "43100",
        "instructor": [
            "Amy L Cochran"
        ],
        "description": "Advanced presentation techniques, sales management and analysis, improving communication skills, study of industrial marketing strategies, interaction with industry executives, and strategies for career development. Requires class trips. Students will pay individual lodging or meal expenses when necessary. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Agricultural Law",
        "subjectCode": "AGEC",
        "courseCode": "45500",
        "instructor": [
            "Jeanna M Pitstick"
        ],
        "description": "Selected general legal topics (courts, contracts, torts, property and commercial law) with emphasis on farming problems (e.g., landowner-tenant, grain contracts, fences, and animal liability) and cases.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Federal Income Tax Law",
        "subjectCode": "AGEC",
        "courseCode": "45600",
        "instructor": [
            "Michael R Langemeier"
        ],
        "description": "Introduction to the federal income tax laws applicable to individuals and small business with emphasis on the farming business. The course includes management implications and the policy basis for the tax law system. Techniques and practice for the preparation of selected forms will be included. There will be limited exposure to taxation of partnerships, corporations, estates, and to federal gift and estate tax law.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Mathematical Tools For Agricultural And Applied Economics",
        "subjectCode": "AGEC",
        "courseCode": "51600",
        "instructor": [
            "Meilin Ma"
        ],
        "description": "This course provides first year graduate students and advanced undergraduate students with the specific set of applied mathematical tools needed to support graduate coursework in microeconomics, macroeconomics, economic programming, and econometrics. The course reviews skills and concepts from a number of fields of mathematics including matrix algebra, calculus, optimization theory, and mathematical statistics. The course emphasizes specific applications to economic theory and applied problems in agricultural economics and related areas. Students should be comfortable with introductory-level calculus before entering the course. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Environmental Policy Analysis",
        "subjectCode": "AGEC",
        "courseCode": "52500",
        "instructor": [
            "Juan P Sesmero"
        ],
        "description": "Designed to assist in understanding how environmental information and knowledge are produced, disseminated, and utilized in a variety of institutional contexts. Readings are selected to promote discussion and interaction concerning alternative mechanisms for protecting environmental resources. Prerequisite: introductory microeconomics course suggested.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Strategic Agribusiness Management",
        "subjectCode": "AGEC",
        "courseCode": "53000",
        "instructor": [
            "Jay T Akridge"
        ],
        "description": "Addresses issues in the strategic management of agricultural and food businesses. Emphasis is on developing a framework for formulating strategy, making strategic choices in a variety of business environments, and implementing strategy. Extensive use of management case studies and a major term project with an agribusiness firm focus on developing managerial problem-solving skills.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Mathematical Programming",
        "subjectCode": "AGEC",
        "courseCode": "55200",
        "instructor": [
            "Roman M Keeney"
        ],
        "description": "Introduction to constrained and optimization problems and their solution using mathematical programming techniques. Theory and implementation of linear, quadratic, and integer programming methods are examined. Applications to farm management, diet and feed rations, spatial market equilibrium, agricultural sector analysis, and other problems from agricultural economics. Use of computer software packages for practical problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Applied General Equilibrium Analysis",
        "subjectCode": "AGEC",
        "courseCode": "61800",
        "instructor": [
            "Thomas W Hertel"
        ],
        "description": "Theory and empirical techniques behind numerical general equilibrium analysis. The course is divided into two parts: 1) development of the basic analytical framework and model properties, and 2) in-depth study of selected applications in international trade, price analysis, and resource and environmental economics. Homework assignments involve a mix of qualitative analysis and microcomputer-based computational exercises. Prerequisite: AGEC 60400; Prerequisite: ECON 51100 or 60700.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Agricultural Policy",
        "subjectCode": "AGEC",
        "courseCode": "64000",
        "instructor": [
            "Tor Nicholas Tolhurst"
        ],
        "description": "Policy analysis for agriculture in the world economy. Emphasis on application of economic theory to analyze commodity programs, international trade, environmental concerns, and investment in human capital and agricultural research. Prerequisite: AGEC 41000, 60400.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Economic Dynamics",
        "subjectCode": "AGEC",
        "courseCode": "65400",
        "instructor": [
            "Juan P Sesmero"
        ],
        "description": "Focuses on the application of the tools of dynamic optimization to problems in economics. Covers continuous-time and discrete-time dynamic optimization techniques, including the calculus of variations, optimal control theory, and dynamic programming. Applications are drawn from a range of problems in microeconomics and macroeconomics, including current topics in agricultural economics, natural resource economics, and investment theory. Course meets weeks 1 - 10. Prerequisite: AGEC 65200, ECON 60700.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Applied Economic Time Series Analysis",
        "subjectCode": "AGEC",
        "courseCode": "65500",
        "instructor": [
            "Kenneth A Foster"
        ],
        "description": "This course is designed to improve students' abilities to estimate and interpret time series models. The course begins with univariate models and progresses to multivariate analysis. Alternative methods for identifying, estimating, and forecasting with time series models will be discussed. In addition, analysis of non-stationary time series and co-integration modeling will be covered in this course. Prerequisite: AGEC 65100 or consent of instructor. Mastery of applied statistics, calculus, and microeconomic theory at the Masters level or higher is desirable.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    }
]