[
    {
        "title": "Descriptive Astronomy: The Solar System",
        "subjectCode": "ASTR",
        "courseCode": "26300",
        "instructor": [
            "Robert Andreas Austin"
        ],
        "description": "A descriptive course in astronomy intended for non-physics majors. Topics include properties of stars, stellar birth and death; the Hertzsprung-Russel diagram; binary systems; red giants and white dwarfs; supernova; neutron stars and black holes; galaxies; cosmology and the big bang; and dark matter. Includes required night-sky observing sessions.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "The Solar System",
        "subjectCode": "ASTR",
        "courseCode": "36300",
        "instructor": [
            "Kyoung-Soo Lee"
        ],
        "description": "This course is intended for students in science or engineering. The components of the course consist of an overview of solar system objects and an overview of the physical processes that control the evolution of solar system objects since formation. The overview of solar system includes observations of the Sun, planets, asteroids and Kuiper-belt objects, comets, and interplanetary dust. Specific processes that are discussed include hydrostatic equilibrium, orbital dynamics, radioactive decay, and heat flow. The role of these processes in shaping planetary surfaces and atmosphere is explored.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Cosmology",
        "subjectCode": "ASTR",
        "courseCode": "37000",
        "instructor": [
            "John R Peterson"
        ],
        "description": "Intended for science and engineering majors. Basic physics and math knowledge will be assumed. The picture of how the Universe came to be and how it has evolved has recently come into sharp focus. This progress is the result of improved observational techniques that have resulted in high resolution images of very distant galaxies, a more accurate mapping of the Large Scale Structure of the Universe or the high resolution picture of the young universe provided by Cosmic Microwave Background observations. We will present a historical perspective of how ideas and data have shaped Cosmology through the centuries. In addition, we will review the theoretical models that are in agreement with the current observations. Our goal will be to provide the students with a broad overview of the current research in Cosmology with an eye toward stimulating the students curiosity about the many questions still awaiting answers in this field.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Observational Techniques In Astronomy",
        "subjectCode": "ASTR",
        "courseCode": "56700",
        "instructor": [
            "Danny Milisavljevic"
        ],
        "description": "(PHYS 56700) Fundamental concepts in observational astronomy, including coordinate and time systems, telescopes and detectors, radiation and optics, and methods of statistical data analysis.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    }
]