[
    {
        "title": "Anatomy-VN",
        "subjectCode": "BMS",
        "courseCode": "23100",
        "instructor": [
            "Kevin M Hannon"
        ],
        "description": "Gross and microscopic study of body systems and topographic relationships in major animal species. Laboratory consists of dissection as well as study of living animals.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Physiology-VN",
        "subjectCode": "BMS",
        "courseCode": "23200",
        "instructor": [
            "Elikplimi K Asem"
        ],
        "description": "Basic mammalian physiology, which covers general physiological processes with emphasis on domestic animals. Laboratory experiences and demonstrations form a major part of the laboratory instruction.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Pharmacology-VN",
        "subjectCode": "BMS",
        "courseCode": "33100",
        "instructor": [
            "Melinda J Anderson"
        ],
        "description": "Credit Hours: 1.50.  This course introduces the concepts of drugs used in the different body systems. Mechanisms of action, side effects, and therapeutic applications are presented.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Systemic Mammalian Physiology",
        "subjectCode": "BMS",
        "courseCode": "53400",
        "instructor": [
            "Riyi Shi"
        ],
        "description": "This course provides fundamental concepts of mammalian physiology in nervous, muscular, blood and cardiovascular, respiratory, renal, digestive, endocrine, and reproductive systems. The major physiological functions of these systems will be explained at the organ as well as the cellular level. The structure and function relationships will be studied in detail. At the end of the course, the students are expected to have a solid understanding of basic functions of the human body. In addition, the student will be exposed to the current topics and key concepts of experimental research. This course offers an excellent opportunity for those students who are looking to either learn or refresh their physiological knowledge that can benefit a variety academic and professional career goals.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Seminar In Basic Medical Sciences",
        "subjectCode": "BMS",
        "courseCode": "69200",
        "instructor": [
            "Susan M Mendrysa"
        ],
        "description": "Oral presentation of assigned or selected topics pertaining to physiology and pharmacology.",
        "capacity": 0,
        "credits": [
            0,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Gross Anatomy Of The Dog And Cat",
        "subjectCode": "BMS",
        "courseCode": "80100",
        "instructor": [
            "Kevin M Hannon"
        ],
        "description": "Credit Hours: 3.50.  Study of the anatomy of the body systems and the topographic relationships of the dog and cat.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Applied Anatomy Of The Horse",
        "subjectCode": "BMS",
        "courseCode": "80400",
        "instructor": [
            "Laurie A Jaeger"
        ],
        "description": "Consists of seven 50-minute lectures and/or discussion periods and seven 120-to-150-minute laboratory sessions, plus a comprehensive final exam. Course material is based upon clinical conditions of the horse that have an anatomical basis or emphasis. Laboratory sessions include topographical anatomy; joint and nerve injections and performance of other clinical procedures; use of multimedia learning aids; and dissection of the head, neck, viscera, and legs.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Veterinary Cell And Tissue Biology Design I",
        "subjectCode": "BMS",
        "courseCode": "80700",
        "instructor": [
            "John J Turek"
        ],
        "description": "Credit Hours: 2.50.  The first of a two-semester sequence of courses, emphasizing developmental and microstructural foundations of structural differentiation of cell, tissue, and organ systems. Emphasis is placed upon principles, fundamental concepts, and applicable details as well as comparative aspects of general importance for veterinary medicine and biomedical research. That you have some background in biochemistry and cell biology is assumed.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Foundations In Basic Medical Sciences",
        "subjectCode": "BMS",
        "courseCode": "81000",
        "instructor": [
            "Ourania M Andrisani"
        ],
        "description": "Credit Hours: 1.50.  The overall objective of this course is to provide the incoming first year DVM students the basic, foundational science principles upon which they will base study of the DVM curriculum. Emphasis is upon basic principles and fundamental concepts of: animal body organization and terminology; cellular and whole body metabolism; macromolecules, membranes, transport, biosynthetic processes, cellular communication/signal transduction, cell cycle and growth regulation, gene expression and embryonic development.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Physiology Of Domestic Animals I",
        "subjectCode": "BMS",
        "courseCode": "81100",
        "instructor": [
            "Susan M Mendrysa"
        ],
        "description": "General physiological process of mammals with special emphasis on domestic animals; normal interactions between large populations of cells, organs, organ systems and integrated functions of an entire animal; homeostatic mechanisms, physiology of body fluids and blood formed elements, muscle and cardiovascular systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Pharmacology Principles And Applications",
        "subjectCode": "BMS",
        "courseCode": "81401",
        "instructor": [
            "Melinda J Anderson"
        ],
        "description": "This is the first of two pharmacology courses in the DVM curriculum. The first part of this course encompasses an introduction to basic concepts necessary to understand and optimally administer and deliver therapeutic drugs, such as pharmacokinetics, pharmacodynamics, dose forms, dosing regimen and prescriptions. In the second part of the course, drugs are studied not only based on their pharmacological class, but also based on the organs and systems on which they act (e.g., heart and vascular system, lungs, autonomous neuronal pathways, respiratory system, endocrine system, etc.). This course also covers the pharmacology of cancer therapy and drugs used to fight pathogens (antifungals, antibiotics, antivirals, antiparasitics). Journal club sessions are included to directly relate pharmacology instruction to topics currently debated in the field.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2023"
    }
]