[
    {
        "title": "Life Cycle Engineering And Management Of Constructed Facilities",
        "subjectCode": "CEM",
        "courseCode": "20100",
        "instructor": [
            "Geoffrey H Graff"
        ],
        "description": "This course introduces concepts relating to the engineering and construction of facilities throughout their life cycle. Topics that will be explored include the nature of the construction industry, construction contracts, legal and management organization of construction companies, basics of the design and construction process, as well as an introduction to the role of estimating and project scheduling. Cost, time, safety and quality concepts of construction management relationships will also be discussed. Prerequisite: First Year Engineering Curriculum must be completed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Project Control And Life Cycle Execution Of Constructed Facilities",
        "subjectCode": "CEM",
        "courseCode": "30100",
        "instructor": [
            "Sogand Mohammadhasanzadeh"
        ],
        "description": "This course continues an introduction to construction management and engineering concepts for future engineers, contractors and owner representatives involved at different stages in the life-cycle of constructed facilities. Specifically, this course focuses on the principles, tools, and procedures used in the construction industry for project selection and financing, advanced planning and scheduling techniques, resource management, and project monitoring.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Human Resource Management In Construction",
        "subjectCode": "CEM",
        "courseCode": "32400",
        "instructor": [
            "Phillip S Dunston"
        ],
        "description": "Introduce a broad set of fundamental topics regarding management of people in engineering and construction organizations in the U.S. Subjects include labor-management relations (laws, regulations and practices affecting construction workers and organizations); worker motivation, productivity, and training; roles and practices of managers; construction safety; management of quality.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Construction Engineering Capstone I",
        "subjectCode": "CEM",
        "courseCode": "42501",
        "instructor": [
            "Brandon M Fulk"
        ],
        "description": "The capstone senior design course for construction engineering and management majors. Working in teams in a realistic engineering practice environment, students use an actual construction project to accomplish open-ended project planning and systems design. Course covers construction project strategy, cost estimating and bidding, constructability analysis, project scheduling, contract conditions, project organization, site analysis and development, safety and quality management, and information systems design. Comprehensive written submittals and oral presentations require integration of knowledge gained in previous courses and in construction internships.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Integrative Building Design",
        "subjectCode": "CEM",
        "courseCode": "45100",
        "instructor": [
            "Geoffrey H Graff"
        ],
        "description": "This course introduces the architectural and constructive challenges of comprehensive, integrated building design. In lectures, the range of constituent systems (active and passive) that combine to produce contemporary buildings will be presented with particular attention to the specific parameters and metrics that drive their functionality and performance. The central project is an extended exercise in design modeling: applying iterative refinements to introduce additional layers of systemic complexity and  to respond to specific analytical measures of building performance. Success in this course will support the ability to productively contribute to building and construction projects from a variety of specific roles.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Temporary Structures In Construction",
        "subjectCode": "CEM",
        "courseCode": "45500",
        "instructor": [
            "Bobby G Mccullouch"
        ],
        "description": "This course will cover the design and construction of various temporary structures and systems used in building and transportation construction. The course describes not only design issues of temporary structures such as formwork, falsework, bracing, earth retention systems, scaffolding, cofferdams, and so forth by providing lectures and design examples, but it also covers business aspects associated with the design and construction of temporary structures in the real world such as business practice, legal aspects, and design philosophy.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Ldrshp & Adv Proj Mgmt",
        "subjectCode": "CEM",
        "courseCode": "49700",
        "instructor": [
            "Theodore J Weidner",
            "Robert L Bowen"
        ],
        "description": "Topics vary. Permission of department required.",
        "capacity": 0,
        "credits": [
            0,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Facilities Engineering And Management",
        "subjectCode": "CEM",
        "courseCode": "53100",
        "instructor": [
            "Theodore J Weidner"
        ],
        "description": "This course provides the student with an understanding of the issues related to facilities management for owner organizations. The course is oriented toward upper class and graduate students familiar with the delivery of capital construction projects and provides an owner's perspective of capital construction and ongoing operation. The course will focus on the total life-cycle cost of a capital construction project beginning with planning, business rationale, economic analysis, and programmatic specifications. The owner's perspective on annual operating costs will be examined including calculation of daily, weekly, monthly, and annual operating costs. The implications of stewardship and customer service will be reviewed and analyzed including the implications on total life-cycle costs. The human resources implications of operating a facility will be reviewed including determination of staffing requirements to meet various levels of service as well as tools and techniques to determine and manage contracted services. Numerous case studies will be described and discussed  which will demonstrate the importance of careful planning and budgeting of annual and periodic maintenance. Issues of sustainability, regulations, and other legal factors will be discussed and examined.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Infrastructure Planning",
        "subjectCode": "CEM",
        "courseCode": "53200",
        "instructor": [
            "Makarand Hastak"
        ],
        "description": "This course provides the student with an in depth understanding of the issues related to infrastructure planning, engineering, and economics. The focus will be on the prioritization, stewardship, management and decision-making roles within the engineering division of a large public works agency. Various infrastructure planning concepts will be reviewed and discussed. Numerous case studies will be described and discussed, which will demonstrate that in order to plan and implement a successful public works project, many controversial issues must be faced and difficult problems must be solved. Decision-making at agency and other levels of government will be discussed with respect to reports prepared by planners covering engineering feasibility, environmental and social impact assessments, and financial and economic analyses. Evolving modern planning issues will be introduced and discussed, including sustainability; environmental economics; environmental justice; uncertainty and risk-benefit analysis; partnerships with private entities versus total privatization; and the optimum staff-mix utilization in-house versus outsourcing.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Hwy & Bridge Construction",
        "subjectCode": "CEM",
        "courseCode": "59700",
        "instructor": [
            "Bobby G Mccullouch",
            "David Thomas Iseley"
        ],
        "description": "This course will allow CEM to develop and test new courses for graduate level delivery. Possible courses include:  Robotics in Construction; Tunneling; Process Plant Construction; Waterway Engineering; Construction Visualization; Remote Monitoring and Inspection; Cost/Benefits of Planning Details; Heavy Construction Innovation; Site Pollutant Reduction & Control; Statistical Methods in Construction; Infrastructure Decay Mechanisms; Time Buffers and Task Durations; BIM Tools and Applications; Sustainable Construction Methods; Construction Operations & Productivity; Construction Accounting; and Construction Leadership.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2023"
    }
]