[
    {
        "title": "Introduction To Games",
        "subjectCode": "CGT",
        "courseCode": "10501",
        "instructor": [
            "Robert Thomas Howard"
        ],
        "description": "Students learn the history of computer game design. Students engage in learning activities that help them remember basic game design principles. These principles are then applied using simple exercises within game engine technology.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Technical Graphics Communications",
        "subjectCode": "CGT",
        "courseCode": "11000",
        "instructor": [
            "Randale J Glaze"
        ],
        "description": "This course is an introduction to the graphic language used to communicate design ideas using CAD. Topics include sketching, multi-view drawings, auxiliary views, pictorial views, working drawings, dimensioning practices, and section views.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Sketching For Visualization And Communication",
        "subjectCode": "CGT",
        "courseCode": "11200",
        "instructor": [
            "Daniel P Triplett"
        ],
        "description": "This course applies fundamental computer graphics concepts of visualization, communication, and creativity within a sketching metaphor. Exercises and projects in graphic theory, problem solving, and sketching skill development provide students with activities that focus on further development within the discipline. A variety of sketching techniques are used to gather critical information and transform data into effective communication instruments.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Geometric Modeling For Visualization And Communication",
        "subjectCode": "CGT",
        "courseCode": "11600",
        "instructor": [
            "Daniel P Triplett"
        ],
        "description": "A core introductory computer graphics course that provides entry-level experiences in geometric modeling. Students develop geometric analysis and modeling construction techniques and processes to produce accurate computer models for graphic visualization and communication.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Fundamentals Of Imaging Technology",
        "subjectCode": "CGT",
        "courseCode": "11800",
        "instructor": [
            "Esteban Garcia",
            "John C Finnegan"
        ],
        "description": "This course provides a foundation for the development and use of raster and vector images for a variety of industries. Full-color images and illustrations are produced using computer technologies, with a focus on both technical and aesthetic aspects. Topics include color theory and perception, surface and lighting analysis, rendering techniques, and technical characteristics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Animation Foundations",
        "subjectCode": "CGT",
        "courseCode": "12300",
        "instructor": [
            "Derek Gunter Larson"
        ],
        "description": "In this course, students are introduced to the core concepts and principles of animated motion. The course includes an overview of animation history and the evolution of animation technology. Principles of animation production are explored through practical exercises executed in a range of animation software types. These exercises will familiarize students with different approaches to creating animated motion, with a focus on keyframed digital animation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Internet Foundations Technologies And Development",
        "subjectCode": "CGT",
        "courseCode": "14100",
        "instructor": [
            "Carlos R Morales"
        ],
        "description": "(CNIT 14100) The course explores the history, architecture, and development of the World Wide Web. Current tagging and scripting languages are covered in a tool-independent environment. Topics also include authoring tools, design, graphic and multimedia formats, and commerce, implementation, and security issues. PC literacy required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Visual Effects Introduction",
        "subjectCode": "CGT",
        "courseCode": "14700",
        "instructor": [
            "Carlos R Morales"
        ],
        "description": "This course introduces students to the visual effects techniques using common methodologies and tools. Topics include procedural frameworks, 3D pipeline implementation, vector operations, and simulating physical phenomena for entertainment graphics. Special emphasis is placed on achieving aesthetically please entertainment-grade graphics using visual effects techniques.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Computer Graphics Programming I",
        "subjectCode": "CGT",
        "courseCode": "21500",
        "instructor": [
            "Jeffrey Peter Kesselman"
        ],
        "description": "This course focuses on programming fundamentals, logic, and problem solving necessary for advancement into upper level CGT courses. A cross-section of languages and technologies will be introduced and demonstrated.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Computer Animation",
        "subjectCode": "CGT",
        "courseCode": "24100",
        "instructor": [
            "Michele A Walker",
            "Raymond P Hassan"
        ],
        "description": "This course introduces the knowledge base on which digital animation and spatial graphics technology are founded and developed. Emphasis will be placed on developing a working knowledge of the mechanics of 3D geometric formats, spline-based modeling with polygon mesh & NURBS, procedural mapping of raster images, simplified polygon modeling, rendering methods, hierarchical linking, and kinematic fundamentals.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Game Development I: Core Skills And Technologies",
        "subjectCode": "CGT",
        "courseCode": "24500",
        "instructor": [
            "Jeffrey Peter Kesselman"
        ],
        "description": "(CNIT 30600) This course introduces students to the fundamental technologies and skill sets required to develop video games. Students will be taught agile development methodologies in a team-based environment.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Visual Effects",
        "subjectCode": "CGT",
        "courseCode": "24700",
        "instructor": [
            "Daniel P Triplett"
        ],
        "description": "This course focuses on simulating and rendering particles. Special emphasis is placed on volumes, sparks, dust, and smoke effects. Techniques for minimizing render times and meeting production requirements are explored. Emphasis is placed on the use of production tools and techniques to create aesthetically pleasing graphics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Computer Graphics Professional Practices I",
        "subjectCode": "CGT",
        "courseCode": "25001",
        "instructor": [
            "Sarah J George"
        ],
        "description": "CGT 25001 is a course in the CGT professional practices sequence, with a focus on student professional development and communications in the field of computer graphics. Emphasis will be placed on industry engagement for the development and refinement of a student's professional resume and portfolio; and professional communications practices necessary for securing professional practical work experience. CGT 25001 will be taught in a seminar format with one meeting per week focused on guest speakers, status checks for portfolio and resume development, and professional networking.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Data Visualization",
        "subjectCode": "CGT",
        "courseCode": "27000",
        "instructor": [
            "Vetria L Byrd"
        ],
        "description": "This course is designed for students with little or no background in Data Visualization. It provides an introductory examination of data visualization through lecture, readings and hands-on experience with current visualization tools. Students will obtain an overview of the various types of data, the fundamentals of the visualization process for information and scientific visualization, and examine detail visualizations workflows that aim to answer \"when\" (temporal data), \"where\" (geospatial data), \"what\" (topical data), and \"with whom\" (trees and networks) questions when visualizing data. After taking the course students will have both the theoretical foundation and practical skills needed to create insightful visualizations for a wide range of data types.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Digital Illustration",
        "subjectCode": "CGT",
        "courseCode": "32101",
        "instructor": [
            "Michele A Walker",
            "Nasheet Zaman"
        ],
        "description": "This course applies fundamental computer graphics concepts of visualization, communication and creativity using a painting metaphor. Exercises and projects in graphic theory, problem solving and painting skill development provides students with projects that focus on further development within the digital illustration discipline. A variety of traditional digital drawing and painting techniques are used to transform concepts into communicative visual artifacts.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Modeling For Entertainment Graphics",
        "subjectCode": "CGT",
        "courseCode": "33300",
        "instructor": [
            "Raymond P Hassan"
        ],
        "description": "This course offers students a chance to comprehensively explore Polygon Modeling, with consideration of how choices made in modeling can affect all other aspects of the animation pipeline.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Digital Lighting And Rendering For Computer Animation",
        "subjectCode": "CGT",
        "courseCode": "34000",
        "instructor": [
            "Siddhant Bal",
            "Nasheet Zaman"
        ],
        "description": "The development of a working knowledge of perspective display of three-dimensional models and the resulting effects of projected light sources on shade, shadow, color, texture, and atmospheric effects in architecture, product illustration, and animation. Emphasis will be placed on lighting design, analysis, and photorealistic simulation for commercial graphic applications.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Motion For Computer Animation",
        "subjectCode": "CGT",
        "courseCode": "34100",
        "instructor": [
            "Michele A Walker",
            "Raymond P Hassan"
        ],
        "description": "An applied course covering three-dimensional computer graphic animation for graphics specialists and professionals involved in the use of technical design, time and motion study, surface texture mapping, digital lighting, color, and the technology required to produce computer animations for commercial applications in manufacturing design, marketing, and training.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Game Development III: Environment Modeling For Games",
        "subjectCode": "CGT",
        "courseCode": "34500",
        "instructor": [
            "Robert Thomas Howard"
        ],
        "description": "(CNIT 33100) This course teaches the techniques and principles needed to create realistic three-dimensional virtual environments in game engines. The course will examine the principles of physics that determine how light propagates through the world and is eventually perceived by a human eye. Global illumination techniques that approximate these principles are described, followed by an in-depth examination of how game engines then approximate these solutions in order to create virtual environments that can run at real-time frame rates.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Principles Of Interactive And Dynamic Media",
        "subjectCode": "CGT",
        "courseCode": "35300",
        "instructor": [
            "John C Finnegan",
            "Ronald J Glotzbach"
        ],
        "description": "This course explores the development of interactive and dynamic media components for web and interactive media products. The course examines the design, creation and integration of 2D animation, 2D games, text, sound, video, programming, and databases for use in web and other interactive media.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Web Programming, Development And Data Integration",
        "subjectCode": "CGT",
        "courseCode": "35600",
        "instructor": [
            "Ronald J Glotzbach"
        ],
        "description": "A course focusing on the development of dynamic content and applications to facilitate information distribution. The course stresses development strategies for managing the rapidly changing information of corporations and organizations for just-in-time distribution, using authoring programs to create interactive multimedia products that utilize database management systems, file systems, and XML to provide a method for visualizing and manipulating that data. Significant time is spent on intermediate to advanced programming and scripting.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Game Development Practicum",
        "subjectCode": "CGT",
        "courseCode": "36500",
        "instructor": [
            "David M Whittinghill"
        ],
        "description": "This course provides an opportunity for teams of game developers to focus on a project without distraction by competing course deliverables. Students propose a game project and spend the entire semester working only on that project. Course instructors will function as facilitators, producers, and supervisors, helping each student team scaffold their work such that all course goals are met.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Game Audio",
        "subjectCode": "CGT",
        "courseCode": "37500",
        "instructor": [
            "Robert Thomas Howard"
        ],
        "description": "Students learn the basics of audio production as it relates to game development. Students edit and create audio effects using off-the-shelf tools and implement these sounds in a game engine. Microphones, digital audio workstations, and sound effect libraries are utilized in a framework that focuses on direct implementation into interactive media.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Scientific Visualization",
        "subjectCode": "CGT",
        "courseCode": "37700",
        "instructor": [
            "Tim E Mcgraw"
        ],
        "description": "This course is an introduction to the use of computer graphics to help user gain insight into scientific datasets. Applications from atmospheric science, medicine and physics will be explored. Topics will include the fundamental approaches to scalar-valued data (volume rendering, iso-surface extraction), vector-valued data (glyphs, streamlines), and tenors-valued data (ellipsoidal, quadric and super quadric glyphs).",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Game Production",
        "subjectCode": "CGT",
        "courseCode": "38500",
        "instructor": [
            "Jeffrey Peter Kesselman"
        ],
        "description": "This course uses intensive project-based, student-led learning in game development to cultivate skills in quality assurance, leadership, communication, time management, contingency planning, technology integration, autonomy and accountability. Students act in an executive role with students in other project-oriented classes and in so doing cultivate supervisory production experience. Each student must engage with instructors and students to hone real-world hard and soft skills through situated experiences and student-led teaching opportunities. Student producers must develop a functioning development pipeline, meet regularly with their teams, and maintain industry-standard documentation and project management processes. Permission of Instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "VR & 3D User Interface",
        "subjectCode": "CGT",
        "courseCode": "39000",
        "instructor": [
            "Christos Mousas"
        ],
        "description": "Course topics will be determined by the CGT faculty. Hours and subject matter will be arranged by the instructor and approved by the CGT curriculum committee.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Contemporary Problems In Applied Computer Graphics I",
        "subjectCode": "CGT",
        "courseCode": "41101",
        "instructor": [
            "Carlos R Morales",
            "Sarah J George",
            "John C Finnegan"
        ],
        "description": "Groups will identify, design, qualify, and plan a final project relative to existing or emerging issues within applied computer graphics. This project will be done in conjunction with industry and faculty engagement. Activities and experiences will explore related topics such as project planning and management, user expectations, interpersonal communications skills, and quality management. This course is followed by CGT 41201 which includes the execution and evaluation of the capstone project planned in CGT 41101.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Production For Computer Animation",
        "subjectCode": "CGT",
        "courseCode": "44200",
        "instructor": [
            "Nasheet Zaman"
        ],
        "description": "An applied course covering advanced spline modeling techniques, lighting techniques, applied shading, motion dynamics and controllers, particle systems, application customization programming, and pre-production development and planning. Study of emerging advancements in computer animation and spatial graphic technologies will be included.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Advanced Web Programming, Development And Data Integration",
        "subjectCode": "CGT",
        "courseCode": "45600",
        "instructor": [
            "John C Finnegan"
        ],
        "description": "This course presents the advanced technologies available for use on the World Wide Web and within corporate intranet environments. Emphasis and discussion is focused on the advantages and disadvantages of these technologies as well as on implementation to create unique solutions for business and industry. Strategies for planning, development, and implementation will be discussed and demonstrated.   Significant time is spent on advanced programming and scripting as well as manipulation and visualization of data from various sources, including robust database management systems. Students are required to plan, design and implement a major project.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Data Visualization Studio",
        "subjectCode": "CGT",
        "courseCode": "47000",
        "instructor": [
            "Yingjie Chen"
        ],
        "description": "This course will teach students design and develop interactive data visualization systems to communicate and analyze complicated datasets. Students will learn interaction and visual design principles, draw from human perception and cognition theories, and focus on hands-on practice of developing interactive data visualization systems that enable users to see, understand, and analyze complex data and relations. At the end of the class, students will apply the design principles and use proper technologies to create a comprehensive interactive visualization system for data analysis.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Seminar In Computer Graphics Technology",
        "subjectCode": "CGT",
        "courseCode": "50100",
        "instructor": [
            "Esteban Garcia"
        ],
        "description": "A variable topics course that addresses contemporary problems and issues related to M.S. students in Computer Graphics Technology. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Foundational Readings Of User Experience Design",
        "subjectCode": "CGT",
        "courseCode": "51200",
        "instructor": [
            "Liang He"
        ],
        "description": "This course provides an overview of the field of human-computer interaction (HCI) and user experience (UX) design. Students will explore the main themes, paradigms, and theories of HCI and UX from its inception to the present. The course takes a broad, chronological approach, examining the history and evolution of HCI and UX, including its major intellectual shifts, successes and failures, and its dynamic relationship to other fields. Students will read seminal works from leading researchers. This course is intended to provide a solid foundation for further research. No specific technical or programming experience is required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Virtual Environments",
        "subjectCode": "CGT",
        "courseCode": "51500",
        "instructor": [
            "Christos Mousas"
        ],
        "description": "This course provides deep exposure to the most prominent and important research within the fields of virtual reality, games, and any application area where virtual environments are constructed or inhabited. Students wlll study experiential, cultural, and phenomenological aspects of habitation within virtual environments as well as become familiar with technical aspects involved in virtual environment creation. Students will generate original research data and analysis, prepare a publishable manuscript, and build their own virtual worlds as applicable.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Computer Graphics Programming",
        "subjectCode": "CGT",
        "courseCode": "52000",
        "instructor": [
            "Tim E Mcgraw"
        ],
        "description": "This course provides a working knowledge of computer graphics programming using OpenGL and C++. OpenGL is the platform independent industrial standard APL and the leading edge technology for computer graphics application design. It has been used in the gaming industry, as well as in research and for scientific visualizations. The course focuses on creating real-time and interactive applications and is structured into several blocks; OpenGL introduction, modeling, texturing, transformations, lighting, and interactive application design. Students will develop various applications through the course focusing different aspects of computer graphics programming.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Current Topics In 3D Animation",
        "subjectCode": "CGT",
        "courseCode": "54000",
        "instructor": [
            "Derek Gunter Larson"
        ],
        "description": "This course addresses recent research and development in 3D animation. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Game Development I",
        "subjectCode": "CGT",
        "courseCode": "54500",
        "instructor": [
            "David M Whittinghill"
        ],
        "description": "In both research and industry game engines are the foundation for nearly all graphics-intensive interactive applications. A thorough understanding of how game engines work is therefore a requisite element of the game development process and lever for research in most domains involving interactive simulations and games. As game engine development, research, and application is a large and complex topic, the course is split into two semesters of study. The two courses are structured similarly but cover different aspects of development on and within game engines. This course introduces students to the fundamental technologies and skills required to develop video games using a modern game engine. Students are taught using a student-led, active-learning pedagogy in which students co-develop and present lectures, demonstrations, and assignments for their peers, with facilitation by the course instructor. The focus of this course is primarily on the technical, functional, and theoretical dimensions of game development, prioritizing technical soundness over design and creativity (which are covered more explicitly in a separate course). As research in this field continues to rapidly iterate, the latest findings are incorporated into each new offering of the course, refreshing its content as the technology evolves in its implementation and theoretical underpinnings. Production of original research focused upon an aspect of game development or game engine design is required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Design Fut Of Ent Graph Prac",
        "subjectCode": "CGT",
        "courseCode": "58100",
        "instructor": [
            "Angus Graeme Forbes",
            "Nandhini Giri"
        ],
        "description": "Advanced study of technical and professional topics. Emphasis is on new developments relating to technical, operational, and training aspects of industry and technology education.",
        "capacity": 0,
        "credits": [
            0,
            8
        ],
        "term": "Fall 2023"
    }
]