[
    {
        "title": "Classical World Civilizations",
        "subjectCode": "CLCS",
        "courseCode": "18100",
        "instructor": [
            "Nicholas Kregotis Rauh"
        ],
        "description": "Course introduces students to \"Classical\" civilizations on three continents (Europe, Africa, and Asia) demonstrably interconnected by an ancient world system. Course focuses on essential themes of past civilization: religion, philosophy, surviving texts, gender relations, urbanism, technology, social and political formations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Medical And Scientific Terminology From Greek And Latin Roots",
        "subjectCode": "CLCS",
        "courseCode": "23400",
        "instructor": [
            "Elizabeth E Mercier"
        ],
        "description": "Ninety to ninety-five percent of scientific technical vocabulary and medical terminology come from Latin and Greek roots and affixes. This course will enable students in scientific and medical disciplines to develop a foundational core of Greek and Latin roots and affixes from which they will be able to decipher and easily commit to memory the core terminology in the various sciences and medicine.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Classical Mythology",
        "subjectCode": "CLCS",
        "courseCode": "23500",
        "instructor": [
            "Charles Steele Campbell"
        ],
        "description": "Study of the myths of western antiquity, as represented in ancient Greek and Latin texts and images.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Ancient Greek Religion",
        "subjectCode": "CLCS",
        "courseCode": "38600",
        "instructor": [
            "Keith M Dickson"
        ],
        "description": "Study of the religious beliefs and practices of ancient Greece, based on written, artistic, and archaeological evidence of their forms and functions.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    }
]