[
    {
        "title": "Introduction To Construction Management",
        "subjectCode": "CM",
        "courseCode": "10000",
        "instructor": [
            "Anthony E Sparkling"
        ],
        "description": "This course is a survey of the construction industry. Topics include the overall construction process, career opportunities in the construction industry, an introduction to construction materials as well as management and technology tools used in the industry. There will be an emphasis on construction specific vocabulary.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Construction Management Fundamentals",
        "subjectCode": "CM",
        "courseCode": "15000",
        "instructor": [
            "Jason Lawrence Merchant"
        ],
        "description": "An introductory course dealing with construction materials and methods, contracts, and layout of basic commercial, residential, heavy/civil, and industrial projects. Students will acquire fundamental skills in quantity estimating, construction plan reading, project layout, and project documentation through hands-on laboratory experiences.",
        "capacity": 0,
        "credits": [
            6,
            6
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Graphics For Civil Engineering And Construction",
        "subjectCode": "CM",
        "courseCode": "16400",
        "instructor": [
            "Clark A Cory"
        ],
        "description": "An introductory course in the area of computer graphics documentation for civil engineering- and construction-related professions. Experiences focus on accepted industry graphic standards and their technical visual applications. The course emphasizes creation and distribution of graphics to enable communication.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Intermediate Pre-Construction Management",
        "subjectCode": "CM",
        "courseCode": "20001",
        "instructor": [
            "Yunfeng Chen"
        ],
        "description": "A project course covering intermediate level commercial, residential, heavy/civil, and industrial construction projects. Students will expand their understanding of construction company management, design, cost, project controls, and safety.",
        "capacity": 0,
        "credits": [
            6,
            6
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Mechanical, Electrical And Piping Systems In The Built Environment",
        "subjectCode": "CM",
        "courseCode": "23301",
        "instructor": [
            "Christopher S Allison"
        ],
        "description": "An introductory course dealing with construction materials and methods related to building systems, focusing on mechanical, electrical, and piping (MEP) systems. Students will acquire fundamental skills in MEP construction plan reading, quantity estimating, basic systems' design and construction execution through lectures, laboratories and integrated project team exercises.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Intermediate Construction Management",
        "subjectCode": "CM",
        "courseCode": "25000",
        "instructor": [
            "Randy R Rapp"
        ],
        "description": "A project course covering intermediate level commercial, residential, heavy/civil, and industrial construction projects. Students will expand their understanding of construction materials and methods, layout, documentation, site planning, site supervision, cost control, and MEP systems.",
        "capacity": 0,
        "credits": [
            9,
            9
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Construction Graphics",
        "subjectCode": "CM",
        "courseCode": "26200",
        "instructor": [
            "Sarah J George"
        ],
        "description": "Study of graphic solutions to problems conditioned by traditional and emerging construction document standards. Construction document creation is based on current architectural engineering and construction (AEC) standards with a focus on residential settings. Introductory 2D documentation will progress into 3D modeling techniques.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Advanced Pre-Construction Management",
        "subjectCode": "CM",
        "courseCode": "30001",
        "instructor": [
            "James L Jenkins"
        ],
        "description": "A project course covering advanced level commercial, residential, heavy/civil, and industrial construction projects. Students will further develop their understanding of construction company management, design, cost, project controls, and safety.",
        "capacity": 0,
        "credits": [
            6,
            6
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Architectural Design, Construction Techniques And Society",
        "subjectCode": "CM",
        "courseCode": "33200",
        "instructor": [
            "Claudio Martani"
        ],
        "description": "A course in which students will be exposed to the evolution of architecture and building techniques that influenced the western built environment. Emphasis will be given to the use of appropriate vocabulary and also how social and cultural factors have influenced the design of the built environment throughout the centuries. The course will survey topics from XVII century to recent times.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Advanced Construction Management",
        "subjectCode": "CM",
        "courseCode": "35000",
        "instructor": [
            "Christopher S Allison"
        ],
        "description": "A project course covering advanced level commercial, residential, heavy/civil, and industrial construction projects. Students will further develop their understanding of construction materials and methods, layout, documentation, site planning, site supervision, cost control, and MEP systems.",
        "capacity": 0,
        "credits": [
            9,
            9
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Industrial Construction Management",
        "subjectCode": "CM",
        "courseCode": "37100",
        "instructor": [
            "Bryan J Hubbard"
        ],
        "description": "  This course will focus on the design and construction of industrial systems and processes including Infrastructure for energy, chemical, and water/wastewater systems. Topics studied include piping, welding, heavy lift cranes, and high voltage systems.  ",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Planning, Design, And Construction Process For The Healthcare Built Environment",
        "subjectCode": "CM",
        "courseCode": "37200",
        "instructor": [
            "Bradley L Benhart"
        ],
        "description": "  This course will focus on the construction of healthcare facilities including hospitals, clinics, nursing homes and laboratories. The course will emphasize the interrelationship of planning, design, and construction. ",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Mechanical And Electrical Construction Management I",
        "subjectCode": "CM",
        "courseCode": "37400",
        "instructor": [
            "Anthony E Sparkling"
        ],
        "description": "  This course will focus on the process of analyzing the elements of mechanical, electrical, and plumbing (MEP) construction inherent in producing a MEP construction estimate. Topics include using work product documentation to present and shape the proposal, establishing a conceptual framework of the estimating process, examining commercial/industrial methods and materials, symbol identification, equipment application, and studying the estimating process sequence from project overview to final pricing. ",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Residential Construction Management-Green Construction And Sustainability",
        "subjectCode": "CM",
        "courseCode": "37600",
        "instructor": [
            "Joseph Ryan Manuel"
        ],
        "description": "  A study of the best building practices in residential construction, based upon the National Green Building Standard and other national green/sustainable building practices. ",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Construction Work Experience I",
        "subjectCode": "CM",
        "courseCode": "39000",
        "instructor": [
            "Steven Glenn Habben"
        ],
        "description": "This course shall be taken when approximately half of a student's required 800 hours of work experience within the construction industry are completed. Students will be required to share their experiences with faculty and other construction management students. Permission of department required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Construction Capstone I",
        "subjectCode": "CM",
        "courseCode": "40000",
        "instructor": [
            "Bradley L Benhart"
        ],
        "description": "A project course covering specialized construction projects related to a student's area of concentration within the construction management program. Students will synthesize their previous knowledge of pre-construction management into a capstone project.",
        "capacity": 0,
        "credits": [
            6,
            6
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Construction Capstone II",
        "subjectCode": "CM",
        "courseCode": "45000",
        "instructor": [
            "Mark D Zimpfer"
        ],
        "description": "A project course covering specialized construction projects related to a student's area of concentration within the construction management program. Students will synthesize their previous knowledge of construction management into a capstone project.",
        "capacity": 0,
        "credits": [
            6,
            6
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Applications Of Construction Documentation II",
        "subjectCode": "CM",
        "courseCode": "46200",
        "instructor": [
            "Clark A Cory"
        ],
        "description": "Creating, archiving, integrating, qualifying and utilizing computer-generated, three-dimensional architectural models in a light commercial construction enterprise. Topics include components of MEP, fire protection, blueprint reading and 4D BIM scheduling. Credit cannot be obtained for both CM 36000 and CM 46200.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Construction Work Experience II",
        "subjectCode": "CM",
        "courseCode": "49000",
        "instructor": [
            "Steven Glenn Habben"
        ],
        "description": "This course completes a student's required 800 hours of work experience within the construction industry. Students will be required to share their experiences with faculty and other construction management students. Permission of department required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Technology In Const Mgmt",
        "subjectCode": "CM",
        "courseCode": "58100",
        "instructor": [
            "Jiansong Zhang",
            "Emad Elwakil",
            "Luciana De Cresce El Debs"
        ],
        "description": "Advanced study of technical and professional topics. Emphasis is on new developments relating to technical, operational, and training aspects of industry and technology education.",
        "capacity": 0,
        "credits": [
            0,
            8
        ],
        "term": "Fall 2023"
    }
]