[
    {
        "title": "Special Populations Seminar: English Language Learners And Students With Gifts And Talents",
        "subjectCode": "EDCI",
        "courseCode": "20002",
        "instructor": [
            "Ali Kushki"
        ],
        "description": "(EDCI 20002) This seminar is focused on special populations of learners for teacher education majors with an emphasis on students who are English learners and students with gifts, talents and creativity. Students will engage in mentoring activities and ongoing support in their development as a professional. The goal of the seminar is to connect theory to practice by engaging in an immersive field experience that connects to content and courses taken concurrently. The seminar provides an environment conductive to fostering rich relationships with schools and communities, pursuing common inquiry, thinking critically about theory, content and practice and advocation for equitable schooling. This seminar is intended to be taken concurrently with EDPS 24000 & EDCI 37001.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Exploring Teaching As A Career",
        "subjectCode": "EDCI",
        "courseCode": "20500",
        "instructor": [
            "Comfort Temitope Aje",
            "Margie Cubillo Araya",
            "Muna Sapkota",
            "Xuwei Luo"
        ],
        "description": "Students will become familiar with the work of teachers and begin to develop their educational philosophies through examining what it means to teach and to learn and the nature and purpose of schools. Students will critically evaluate teaching as their chosen profession.   This course includes a required weekly field-based experience in an elementary, middle, or high school classroom.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Construction And Textile Lab Management",
        "subjectCode": "EDCI",
        "courseCode": "20700",
        "instructor": [
            "Diana Dawn Reif"
        ],
        "description": "A lecture/lab course which provides clothing construction and textile science content to be applied in the secondary family and consumer sciences classroom.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Educ Scholar Program I-Honors",
        "subjectCode": "EDCI",
        "courseCode": "21000",
        "instructor": [
            "Nadine E Dolby"
        ],
        "description": "EDCI 21000 is the first course in a two course, introductory sequence for College of Education students enrolled in the Honors College and/or Devito Program scholarship recipients. In this course, we will examine key concepts and ideas in educational thought and research, understand what research is, and begin to explore individual students' research interests.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Teaching Geography: Standards And Strategies",
        "subjectCode": "EDCI",
        "courseCode": "21710",
        "instructor": [
            "Anatoli Rapoport"
        ],
        "description": "Course prepares students for teaching geography in powerful, exciting and innovative ways through a study of geographic concepts within the framework of inquiry design model (IDM) and an inquiry-based curriculum. Required for all Social Studies Education majors.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Teaching For Economic Literacy: Developing An Economic Way Of Thinking",
        "subjectCode": "EDCI",
        "courseCode": "21910",
        "instructor": [
            "John Patrick Broome"
        ],
        "description": "Course focuses on preparing students in the social studies education licensure program to teach high school economics and to integrate economics into other middle and/or high school social studies courses. Course addresses issues of economic pedagogy. It will address economic content/concepts specifically and only in a way to illustrate/expand on the teaching idea, resources, methods and assessment.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Knowing The World Through Mathematics",
        "subjectCode": "EDCI",
        "courseCode": "22200",
        "instructor": [
            "Hillary Ongoyo Omoze",
            "Patrick Henry Debonis",
            "Abigail Erskine"
        ],
        "description": "In this course, Knowing the World Through mathematics, students will connect their situated experiences to larger trends in equity and social justice around the globe through mathematical investigations embedded in the context of the United Nations 2030 agenda (United Nations, 2015). Students in this course will make use of mathematics and global policy documents to critically interpret, model, and represent world phenomena.  Students will collaboratively analyze quantitative information gathered through trustworthy, globally representative data sets and individual survey and questionnaire items to investigate local experiences in relation to students' area(s) of interest. Students will learn about and utilize the GAISE Framework for Statistical Problem Solving (Franklin et al., 2005) and the Four Dimensions of Equity in Mathematics Education (Gutierrez, 2012) to ground their discussions and deliverables for Knowing the World Through Mathematics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Professional Development In Family And Consumer Sciences Education",
        "subjectCode": "EDCI",
        "courseCode": "25000",
        "instructor": [
            "Janine Marie Duncan"
        ],
        "description": "This course focuses on students' professional development as family and consumer sciences educators.  Characteristics and relationships among middle and high school family and consumer sciences standards, resources, and learning experiences; the Purdue Family and Consumer Sciences Education program; and expectations for Indiana FCS teacher-licensure are emphasized.  Includes participation in professional organizations and meetings.",
        "capacity": 0,
        "credits": [
            1,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Multiculturalism And Education",
        "subjectCode": "EDCI",
        "courseCode": "28500",
        "instructor": [
            "Mahreen Mamoon",
            "Nadine E Dolby",
            "Stephen I Smith",
            "Asenath Aoko Odondi",
            "Jason A Ware",
            "Stephanie M Zywicki"
        ],
        "description": "This course integrates an understanding of multiculturalism with principles of democratic education. Historical, sociological, cultural, political, philosophical, and pedagogical foundations of multiculturalism are explored and related to issues of pedagogy in a pluralistic society.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Inquiry Into Teaching And Learning In K-2",
        "subjectCode": "EDCI",
        "courseCode": "30101",
        "instructor": [
            "Kathleen A Martin"
        ],
        "description": "The goal of the seminar is to connect theory to practice by engaging in an immersive field experience that connects to content and courses taken concurrently through cycles of inquiry. In particular, this seminar is intended to be an inquiry space for questions and topics related to teaching using pedagogies of care in the K-2 classroom. Admission to Teacher Education required. Cannot be taken concurrently with EDCI 30002.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Inquiry Into Teaching And Learning In 3-6",
        "subjectCode": "EDCI",
        "courseCode": "30102",
        "instructor": [
            "Kathleen A Martin"
        ],
        "description": "The goal of the seminar is to connect theory to practice by engaging in an immersive field experience that connects to content and courses taken concurrently through cycles of inquiry. In particular, this seminar is intended to be an inquiry space for questions and topics related to teaching using pedagogies of care in the 3-6 classroom. Admission to Teacher Education is required. Cannon be taken concurrently with EDCI 30001.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Reading In Middle And Secondary Schools: Methods And Problems",
        "subjectCode": "EDCI",
        "courseCode": "30900",
        "instructor": [
            "Stephen I Smith",
            "Alex M Carignan"
        ],
        "description": "For prospective teachers at junior and senior high schools. An overview of reading processes, fundamentals of reading instruction, factors that influence the ability to read text materials, strategies and materials for identifying and reducing reading problems, school resources, and programs for normal and deficient readers. Concurrent enrollment with program-specified methods course.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Integrating Media In The K-2 Classroom",
        "subjectCode": "EDCI",
        "courseCode": "31101",
        "instructor": [
            "Mengying Xue",
            "Nancy A Boes"
        ],
        "description": "The goal of the course is for teacher candidates to understand how to choose and evaluate children's literature and media to use in K-2 classroom, develop ways to integrate literature and understanding of literature and media using a variety of methods, select appropriate materials for individual student's needs, and assess student's learning. Admission to Teacher Education is required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Integrating Media In The 3-6 Classroom",
        "subjectCode": "EDCI",
        "courseCode": "31102",
        "instructor": [
            "Nancy A Boes"
        ],
        "description": "The goal of the course is for teacher candidates to understand how to choose and evaluate children's literature and media to use in the 3-6 classroom, develop ways to integrate literature and media throughout the curriculum, support students' understanding of literature and media using a variety of methods, select appropriate materials for individual student's needs, and assess students' learning.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Physical Education In The Elementary School",
        "subjectCode": "EDCI",
        "courseCode": "32250",
        "instructor": [
            "Danae M Rush",
            "Andrea Kay Bornino"
        ],
        "description": "Current conceptions of elementary school physical education, with a particular emphasis on curriculum implementation.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Teaching Literacy In K-2",
        "subjectCode": "EDCI",
        "courseCode": "32501",
        "instructor": [
            "Whitney Marie Rippy",
            "Breanya Charise Hogue"
        ],
        "description": "Students will study how children's oral language develops, how children learn to read and write in primary grade settings, and the teacher's role in this process. Students will learn how phonemic awareness, phonics, fluency, vocabulary and comprehension influence children's literacy development. Students will learn how to select appropriate instructional materials; employ teaching strategies to meet the cognitive and affective literacy needs of all children, and collect, interpret, and use data from various types of assessments to inform literacy teaching and learning processes.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Teaching Literacy In 3-6",
        "subjectCode": "EDCI",
        "courseCode": "32602",
        "instructor": [
            "Inna Abramova"
        ],
        "description": "Students will build on material learned in EDCI 32501. They will concentrate on increasing student's literacy skills with a focus on fluency, phonics, strategic reading, vocabulary, literary analysis, content area reading, the writing process, and building comprehension skills. They will learn to select appropriate materials, employ strategies to meet the cognitive and affective literacy needs of all children, and create integrate, and use data from various forms of assessment to inform the teaching and learning process.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Reading Instruction For Tier 1 And Tier 2",
        "subjectCode": "EDCI",
        "courseCode": "33500",
        "instructor": [
            "Jennifer Elaine Smith",
            "Inna Abramova"
        ],
        "description": "Given the needs of struggling/striving readers throughout the educational system, this class will focus on effective interventions from the primary grades through high school. Instructors will present a balance of theoretical and practitioner-oriented aspects of reading development and instruction. The course will also examine a number of reading models and instructional approaches designed to ensure all students have access to effective, research-based literacy instruction. The goal is to ensure students complete the semester with a range of essential tools for working with this population.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Community Issues & Applications For Educators",
        "subjectCode": "EDCI",
        "courseCode": "35000",
        "instructor": [
            "Stephanie Scherer",
            "Daniela Reyes",
            "Janine Marie Duncan",
            "Jennifer Jane Call",
            "Crystal Snow Webb"
        ],
        "description": "This course is an examination of diverse individual, family, and community characteristics and issues, and potential impacts on teaching and learning processes.  Includes service learning with human service agencies and personnel in the school and community.  As part of this course, students complete certification to meet the Indiana Department of Education suicide prevention training requirement for teacher licensure.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Teaching Social Studies In K-2",
        "subjectCode": "EDCI",
        "courseCode": "36101",
        "instructor": [
            "Cheryl A Mcilrath",
            "John Patrick Broome",
            "Kathryn M Obenchain"
        ],
        "description": "This course provides students with an overview of the field of social studies, of selected issues in the field, and of best practice strategies for teaching social studies to children in the K-2 classroom. Students will work to identify the most important social studies knowledge, skills and dispositions; investigate how K-2 children learn social studies most effectively. Students will then use their new understandings to implement lessons, analyzing the effectiveness of their instruction for children in the K-2 grades. Admission to Teacher Education is required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Teaching Social Studies In 3-6",
        "subjectCode": "EDCI",
        "courseCode": "36102",
        "instructor": [
            "John Patrick Broome"
        ],
        "description": "This course provides students with an overview of the field of social studies, of selected issues in the field, and of best practices strategies for teaching social studies to children in the 3-6 classroom. Students will work to identify the most important social studies knowledge, skills and dispositions; investigate how 3-6 children learn social studies most effectively. Students will then use their new understandings to implement lessons, analyzing the effectiveness of their instruction for children in the 3-6 grades.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Literacy In The Elementary School II",
        "subjectCode": "EDCI",
        "courseCode": "36300",
        "instructor": [
            "Helen Claire Bentley"
        ],
        "description": "Focuses on teaching children who experience difficulty acquiring literacy. Assessments of children's strengths and needs are used to plan and evaluate instruction. Strategies for helping children develop more mature literacy understandings are applied in weekly small-group instructional sessions. Includes a field-based experiential component. Taken concurrently with EDPS 43000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Literacy Teaching And Assessment In K-6",
        "subjectCode": "EDCI",
        "courseCode": "36303",
        "instructor": [
            "Fay Elizabeth Mentzer",
            "Whitney Marie Rippy"
        ],
        "description": "This course is an undergraduate, elementary education course designed to provide preservice teachers with classroom and practicum experiences focused on literacy instruction for children experiencing difficulty learning to read and write. Students learn to administer and analyze individual assessments to determine the strengths and needs of a struggling reader/writer and set tutoring goals based on these results. Application of appropriate instructional strategies for developing comprehension, letter and word study, vocabulary, and fluency is the focus of twice-weekly, 30 minute tutoring sessions (22+ total) in local elementary schools. Teaching is designed around children's social justice concerns. Admission to Teacher Education is required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Mathematics In The Elementary School",
        "subjectCode": "EDCI",
        "courseCode": "36400",
        "instructor": [
            "Sezai Kocabas"
        ],
        "description": "Focuses on teaching mathematics in the elementary school. Students learn what it means to teach mathematics when reasoning, problem solving, communication, and connections are the foci. Includes a field-based experiential component.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Teaching Mathematics In K-2",
        "subjectCode": "EDCI",
        "courseCode": "36401",
        "instructor": [
            "Amber Nicole Brown",
            "Laura C Bofferding",
            "Yi Zhu"
        ],
        "description": "This course focuses on teaching mathematics in the elementary school, grades K-2, and encouraging children as mathematical problem posers. Students learn what it means to teach math interactionally using children's ideas, beliefs, and experiences as primary resources. Eliciting and interpreting children's mathematical thinking as well as mathematical reasoning, problem solving, communication, and connections are foci. Admission to Teacher Education required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Teaching Mathematics In Grades 3-6",
        "subjectCode": "EDCI",
        "courseCode": "36402",
        "instructor": [
            "Signe E Kastberg"
        ],
        "description": "Focuses on teaching mathematics in the elementary school grades 3-6.  Students learn what it means to teach mathematics interactionally using children's ideas, beliefs, and experiences as primary resources. Mathematical reasoning, problem solving, communication, and connections are foci.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Science In The Elementary School",
        "subjectCode": "EDCI",
        "courseCode": "36500",
        "instructor": [
            "Jenna Rae Gist"
        ],
        "description": "Investigates ways children learn science as a basis for planning, enacting, and assessing science curriculum and instruction. State and national standards, teaching cases, and science lab experiences are used as tools for reflecting on practice. Includes a field-based experiential component. Taken concurrently with EDCI 36400 and EDCI 37000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Teaching Science Through Design In Grades K-2",
        "subjectCode": "EDCI",
        "courseCode": "36501",
        "instructor": [
            "Dean M Ballotti",
            "Austin Ryan Jenkins",
            "Gina Marie Zaccagnini",
            "Elizabeth Andrew Thiel"
        ],
        "description": "One of the primary goals of this course is to provide you with opportunities to enhance your pedagogical knowledge and skills so that you can become a culturally inclusive and effective teacher. Hence, learning to teach science in this class will involve conceptualizing science as a verb and not as a noun. To make the distinction more precise, we prefer to use the term critical cross-cultural science education instead of science education when referring to the teaching and learning of science in the increasingly culturally diverse context of schools in the US. Critical cross-cultural science education is defined as the process of actively engaging students in collaborative inquiry about what science is; whose interests are served by science; who decides what science is and what gets funded as science; and what kinds of individual and collective roles individuals could play as informed and responsible citizens in supporting the advancement of science to benefit society. Admission to teacher education required. At least 9 credits of science content required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Teaching Science Through Design In Grades 3-6",
        "subjectCode": "EDCI",
        "courseCode": "36502",
        "instructor": [
            "Rebekah Jane Hammack"
        ],
        "description": "The aim of this course is to prepare students to teach science, engineering, and computational thinking with grade 3-6 learners by building on existing pedagogical and subject matter knowledge in science. Students will engage in science and engineering learning experiences; identify and analyze children's ideas and background experiences; and examine instructional strategies for leveraging students' sense making. Using this knowledge, students will plan for and implement standards-based lessons, reflecting on the strengths and areas of improvement of their instruction for grade 3 through 6 learners. At least 9 credits of science content courses are required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Teaching And Learning English As A New Language",
        "subjectCode": "EDCI",
        "courseCode": "37001",
        "instructor": [
            "Ali Kushki",
            "Tirtha Karki",
            "Yangyang Zhu",
            "Huu Bao Nguyen Le",
            "Negar Bakhshandeh",
            "Brenda Sarmiento-Quezada"
        ],
        "description": "This course builds foundational knowledge on the theories and practices related to the English language development of English language learners in the P-12 contexts. Particular attention is given to the current issues as well as on techniques for instructing and assessing students at different stages of English language development in the school context. Students will learn to identify students' strengths and current needs in English, to design classroom experiences across the curriculum, and to assess student performance using current WIDA standards.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Teaching For Social Justice: Culturally And Linguistically Diverse Learners",
        "subjectCode": "EDCI",
        "courseCode": "38100",
        "instructor": [
            "Mary Ellen Lennon"
        ],
        "description": "This course builds on the content of EDCI 28500 (Multicultural Education) with specific attention to issues of social justice related to literacy and linguistic diversity. Within this framework, students will learn strategies for teaching English language learners, deconstruct deficit perspectives of dialectical differences, and consider approaches to classroom management. Additionally, a field experience component with an ELL teacher will be included in the course.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "The Teaching Of Biology In Secondary Schools",
        "subjectCode": "EDCI",
        "courseCode": "42100",
        "instructor": [
            "Siddika Selcen Guzey"
        ],
        "description": "The rationale, objectives, methods, and materials of teaching biology and life science in junior and senior high schools. Extensive use of multimedia resources in planning specifically for the student teaching experience. No undergraduate students may be enrolled in any of these undergraduate courses until they have been admitted to teacher education.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "The Teaching Of English In Secondary Schools",
        "subjectCode": "EDCI",
        "courseCode": "42200",
        "instructor": [
            "Benjamin Newell Lathrop"
        ],
        "description": "Explores a wide variety of instructional practices suitable for teaching middle and high school English including language, literature, and writing - addressing specific pedagogical issues such as teaching diverse learners and developing cohesive units of instruction.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "The Teaching Of Social Studies In Secondary Schools",
        "subjectCode": "EDCI",
        "courseCode": "42300",
        "instructor": [
            "Anatoli Rapoport"
        ],
        "description": "The purpose of this course is the development of a theoretical framework and pedagogical skills necessary to teach social studies to middle and high school students. Students are introduced to the general issues involved in planning and organizing a social studies curriculum.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "The Teaching Of Earth And Physical Science In The Secondary Schools",
        "subjectCode": "EDCI",
        "courseCode": "42400",
        "instructor": [
            "Nobel Sanjay Rebello"
        ],
        "description": "The methods and materials needed for the teaching of chemistry, earth-space, physics, and general science in the secondary schools, including field experience. No undergraduate students may be enrolled in any of these undergraduate courses until they have been admitted to teacher education.  May be taken for two credits (no field experience) by students who are enrolled in another methods course with field experience.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Teaching Of Secondary Mathematics",
        "subjectCode": "EDCI",
        "courseCode": "42600",
        "instructor": [
            "Abigail Erskine"
        ],
        "description": "This is the second of two methods courses designed for students who are planning to be secondary mathematics teachers. The course content is organized around principles of equity, mathematical task design, classroom discourse, classroom environment assessment and technology. It also focuses on the cycle of effective teaching, which includes justifying planning decisions, analyzing teaching, and using data to inform instruction. The courses addresses NCTM's Professional Standards as well as the content and process standards included in Indiana Academic Standards for Mathematics and pedagogical strategies for teaching in ways that serve the diverse population of mathematics learners.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Advanced Social Studies Methods",
        "subjectCode": "EDCI",
        "courseCode": "43300",
        "instructor": [
            "Chrystal S Johnson"
        ],
        "description": "Foundations of social studies; methods, techniques, strategies of teaching, and activities - with special attention to skills of planning, questioning, and testing. Includes observation, participation, and microteaching in social studies classrooms. No undergraduate students may be enrolled in any of these undergraduate courses until they have been admitted to teacher education.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Methods For Teaching Family And Consumer Sciences",
        "subjectCode": "EDCI",
        "courseCode": "44400",
        "instructor": [
            "Janine Marie Duncan"
        ],
        "description": "The culminating on-campus teacher-education course for the Purdue University Family and Consumer Sciences program.  The course builds and consolidates teacher-candidates' knowledge and skills for teaching family and consumer sciences.  Emphasis placed on standards-based instructional planning and materials; instructional strategies, including laboratories, assessment of student learning, and classroom management.  Course includes field experiences.  Program content requirements should be completed previous to or concurrent with this course.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Global Studies Seminar",
        "subjectCode": "EDCI",
        "courseCode": "45200",
        "instructor": [
            "Joann I Phillion"
        ],
        "description": "(EDPS 45200) The course builds on students' international cross-cultural experiences, particularly Study Abroad. The course is required for those wishing to complete the Global Studies minor in the College of Education.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Prof Writing Sec Math Teachers",
        "subjectCode": "EDCI",
        "courseCode": "49000",
        "instructor": [
            "Ricki Lauren McKee"
        ],
        "description": "Primarily for teacher candidates requiring special, individualized experience in research or teaching. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            8
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Supv Tch Soc Std Ed",
        "subjectCode": "EDCI",
        "courseCode": "49800",
        "instructor": [
            "Charles A German",
            "Amanda Renee Huffman Hayes"
        ],
        "description": "Teaching full time in a school classroom under the supervision of the teacher in charge of the class and a University supervisor.  Completion of education methods courses and other Gate requirements for the major area and admittance to teacher education required.",
        "capacity": 0,
        "credits": [
            8,
            16
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Foundations Of Learning Design And Technology",
        "subjectCode": "EDCI",
        "courseCode": "51300",
        "instructor": [
            "Katherine H Dufault"
        ],
        "description": "Provides an historical overview of the field and delineates the foundational knowledge, skills, and attitudes needed by professionals in the field of educational technology and instructional design.  Students explore the field by engaging in collaborative projects, along with thinking and writing about various aspects of educational technology and the underlying instructional design theories.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Integrated Science, Technology, Engineering And Mathematics (STEM) Education Methods-Secondary",
        "subjectCode": "EDCI",
        "courseCode": "55800",
        "instructor": [
            "Graham Pierce Lyon"
        ],
        "description": "Focuses on operationalizing the theoretical pedagogical approaches to integrated Science, Engineering, Mathematics and Agriculture (STEM) education. Collaboratively and cooperatively investigate, plan and deliver integrated learning experiences appropriate for secondary education. Course content will blend philosophical considerations with practical application. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Teaching Engineering And Technology Design In The Context Of K-12 Integrated STEM",
        "subjectCode": "EDCI",
        "courseCode": "55850",
        "instructor": [
            "Gary T Mcfall"
        ],
        "description": "Engineering and technology design has gained considerable traction in many K-12 schools. In this course, we will examine principals of engineering design and technology as well as where and how engineering and technology design best fits in a K-12 integrated STEM curriculum. Course participants will engage in authentic engineering and technology design experiences. Course participants will also design, develop, deliver integrated lessons that help K-12 students develop the knowledge, skills, and practices of engineering and technology design.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Principles Of Adult Education",
        "subjectCode": "EDCI",
        "courseCode": "56500",
        "instructor": [
            "Casey Downs Mull"
        ],
        "description": "(YDAE 56500) Principles of adult education applied to helping adults learn, evaluating their performance, and determining their needs. Examines history, philosophy, and research of adult education. Explores techniques required in design and delivery of instruction for adults.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Learning Systems Design",
        "subjectCode": "EDCI",
        "courseCode": "57200",
        "instructor": [
            "Wanju Huang"
        ],
        "description": "An introduction to the principles of designing instructional materials and to instructional communication theory and techniques. Topics include objectives, student characteristics, media selection, communication variables, message design, and systematic evaluation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Foundations Of Curriculum",
        "subjectCode": "EDCI",
        "courseCode": "58000",
        "instructor": [
            "Steven J Burdick"
        ],
        "description": "Introduction to the major historical and philosophical sources of curriculum ideas. Significant forces influencing curriculum decision making. Different theoretical approaches to the construction and analysis of curriculum.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Engl Sec Lng/Theor Fnd",
        "subjectCode": "EDCI",
        "courseCode": "59100",
        "instructor": [
            "Brenda M Capobianco",
            "Harris J Bras",
            "Michelle Renee Fry"
        ],
        "description": "Group study of a current problem or special topic of interest to professional educational personnel. Intensive study of research, theory, or practical aspects of a particular issue within the usual graduate class format.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Qualitative Research Methods In Education",
        "subjectCode": "EDCI",
        "courseCode": "61500",
        "instructor": [
            "Amber M Neal-Stanley"
        ],
        "description": "Focuses on expanding graduate students' research skills to include knowledge of the theories and methods associated with qualitative and qualitative-quantitative combined research. Prerequisite: EDPS 53300.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Qualitative Data Collection And Analysis In Educational Research",
        "subjectCode": "EDCI",
        "courseCode": "61600",
        "instructor": [
            "Steven J Burdick"
        ],
        "description": "This course focuses on expanding and applying students' knowledge of qualitative data collection and analysis with an emphasis on multiple approaches to data collection, analysis, and interpretation. Prerequisite: EDCI 61500 or permission of instructor.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Curriculum And Instruction Doctoral Seminar I",
        "subjectCode": "EDCI",
        "courseCode": "62800",
        "instructor": [
            "Ofelia Schepers"
        ],
        "description": "An examination of current issues and concerns related to doctoral study in Curriculum and Instruction. This course is intended for all new doctoral students in the Department of Curriculum and Instruction and should be taken within the first year of doctoral study.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Content And Goals In Mathematics Education",
        "subjectCode": "EDCI",
        "courseCode": "63500",
        "instructor": [
            "Jill A Newton"
        ],
        "description": "Examines conceptions of what mathematics is and how those conceptions have influenced the mathematics curriculum over the course of American history.  Prerequisite: Master's student standing or higher and enrolled in Mathematics Education.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Organization And Administration Of Career And Technical Education",
        "subjectCode": "EDCI",
        "courseCode": "64500",
        "instructor": [
            "James P Greenan"
        ],
        "description": "Organizational structure and delivery systems at the national, regional, state, and local levels; program areas and services; legislative initiatives; federal, state, and local planning; administrative functions and practices; leadership development; trends; and issues.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Seminar In Career And Technical Education",
        "subjectCode": "EDCI",
        "courseCode": "65300",
        "instructor": [
            "James P Greenan"
        ],
        "description": "Current trends, theory, and practices related to educational contexts and careers.",
        "capacity": 0,
        "credits": [
            1,
            9
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Learning Design And Technology Seminar",
        "subjectCode": "EDCI",
        "courseCode": "66000",
        "instructor": [
            "Adrie Anne Koehler-Blair"
        ],
        "description": "  This course is an investigation of trends, developments, and issues in learning design and technology with a focus on current practices, problems, and research. This one-credit seminar is designed to help students learn about applications of instructional design and educational technology in various settings and to interact with faculty and guest speakers about topics related to the field and the LDT program.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Advanced Practices In Learning Systems Design",
        "subjectCode": "EDCI",
        "courseCode": "67200",
        "instructor": [
            "Adrie Anne Koehler-Blair"
        ],
        "description": "Applications of learning systems design to educational situations. In-depth treatment of learner analysis, task analysis, learning activities design, learner verification and summative evaluation. Focuses on the application of instructional design concepts and principles within authentic ID situations. Prerequisite:  EDCI 57200.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Instructional Strategies",
        "subjectCode": "EDCI",
        "courseCode": "67500",
        "instructor": [
            "William R Watson"
        ],
        "description": "Examines and applies the cognitive strategies and tactics that can be used by an instructional designer to improve human learning. Applications of various instructional strategies for specific cognitive tasks (e.g., concepts, mental models, problem solving) will to be covered. Additionally, best practices for a diverse range of instructional methods will be considered, as well as, the strategies for the entire instructional experience. Prerequisite: EDCI 57200. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Unpacking Research: Writing Research Proposals In Learning Design And Technology",
        "subjectCode": "EDCI",
        "courseCode": "67700",
        "instructor": [
            "Marisa E Exter"
        ],
        "description": "This course is designed to introduce the novice researcher to the process of developing a research problem statement supported by literature resulting in a professional organization conference proposal and a proposal for a funding agency in the field of Learning Design and Technology. Permission of instructor required. Prerequisite: EDCI 67600.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Unpacking Research: Writing For Scholarly Publications In Learning Design And Technology",
        "subjectCode": "EDCI",
        "courseCode": "67800",
        "instructor": [
            "William R Watson"
        ],
        "description": "This course is designed to introduce the novice researcher to the process of publishing research in the field of Learning Design and Technology. Emphasis is placed on practical aspects of the publishing process as well as familiarizing students with the role that editors and reviewers play in that process. Prerequisite courses include: EDCI 67600 Writing Literature Reviews and EDCI 67700 Writing Research Proposals. Students must bring a draft manuscript completed through the methods portion into the course, and students must have completed research and collected data to facilitate completion of a research-based manuscript for publication during the course. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Black Education In The US",
        "subjectCode": "EDCI",
        "courseCode": "68400",
        "instructor": [
            "Amber M Neal-Stanley"
        ],
        "description": "A course designed to allow for the in-depth exploration of specialized and timely topics in curriculum theory, practice, and reform. Though all specialized topics address both theory and practice, some topics focus more heavily on practice, and others focus more heavily on theory.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    }
]