[
    {
        "title": "First-Year Composition",
        "subjectCode": "ENGL",
        "courseCode": "10600",
        "instructor": [
            "Sidney Ducleroir",
            "Dylan Lee Henderson",
            "George Travis Hein",
            "Wendy Kay Hammer",
            "Beth A Jones",
            "Harris J Bras",
            "Michelle E Parsons-Powell",
            "Michael Douglas Johnson"
        ],
        "description": "This 4-credit hour composition course includes student-teacher conferences. Students in this course produce between 7,500-11,500 words of polished writing (or 15,000-22,000 total words, including drafts or the equivalent). Within the course, students will learn to write with a rhetorical awareness of diverse audiences, situations, and contexts; critically think about writing and rhetoric through reading, analysis, and reflection; provide constructive feedback and incorporate feedback into their own writing; perform research and evaluate sources to support claims; and engage multiple digital technologies for different purposes.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Accelerated First-Year Composition",
        "subjectCode": "ENGL",
        "courseCode": "10800",
        "instructor": [
            "Kristin Browning Leaman",
            "Catherine Jean Shukle",
            "Jessica M Mercado",
            "Carla B Rosell",
            "Jessica A Weatherford"
        ],
        "description": "In this 3-credit hour composition course students should expect an emphasis on self-guided work. Students in this course produce between 7,500-11,500 words of polished writing (or 15,000-22,000 total words, including drafts or the equivalent). Within the course, students will learn to write with a rhetorical awareness of diverse audiences, situations, and contexts; critically think about writing and rhetoric through reading, analysis, and reflection; provide constructive feedback and incorporate feedback into their own writing; perform research and evaluate sources to support claims; and engage multiple digital technologies for different purposes.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "American Language And Culture For International Students I",
        "subjectCode": "ENGL",
        "courseCode": "11000",
        "instructor": [
            "Jacob Russell Spears",
            "Negin H Goodrich",
            "Armand Edward Affricano",
            "Ty C Climer",
            "Margaret E Hass",
            "Clyde Joseph Sorell",
            "Haiyan Li",
            "Parvaneh Rezaee",
            "Heejeon K Bras",
            "Minsun Kim",
            "Deborah Hannah Bush",
            "Stephen W Moriarty"
        ],
        "description": "The course takes a social science-based approach to investigating the American university by examining contemporary college life, the history of the American academy, social and environmental issues on campus, and opportunities for engagement with the wider community. Students will improve their speaking, listening, reading, writing skills in English so that they can actively participate in social and academic communication.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "American Language And Culture For International Students II",
        "subjectCode": "ENGL",
        "courseCode": "11100",
        "instructor": [
            "Charles Allen Brown",
            "Nadezda Pimenova"
        ],
        "description": "Students will continue to develop the foundational language skills and knowledge that they need to succeed in their other classes at Purdue and to prepare for further academic and professional opportunities. Students will also deepen their understanding of American culture and improve their ability to think about cultural differences in positive ways. In a sense, this class will be a bridge to help you transition to other language-intensive courses at Purdue where you need to read, write, and speak frequently and/or work in groups (such as business, engineering, literature, public speaking, and social sciences).",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Engaging English",
        "subjectCode": "ENGL",
        "courseCode": "20200",
        "instructor": [
            "Angelica A Duran",
            "Nancy J Peterson",
            "Harry C Denny"
        ],
        "description": "This theme-based course introduces students to the field of English, and provides foundational liberal arts skills. It teaches, for instance, critical and creative thinking, reading, and writing using a variety of genres, texts, and media.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Research For Professional Writers",
        "subjectCode": "ENGL",
        "courseCode": "20300",
        "instructor": [
            "Jennifer L Bay"
        ],
        "description": "Introduction to research sources and methods useful for professional writers, including electronic resources. Focus on collecting print and online information, interviewing, surveying, and conducting observations; and on evaluating, summarizing, analyzing, and reporting research.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Science Fiction Writing",
        "subjectCode": "ENGL",
        "courseCode": "20400",
        "instructor": [
            "Casey M Gray"
        ],
        "description": "A course in writing, with the special topic selected by the instructor.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Creative Writing",
        "subjectCode": "ENGL",
        "courseCode": "20500",
        "instructor": [
            "Monir Gholamzadeh Bazarbash",
            "Melissa Ann Fraterrigo",
            "Weiji Wang",
            "Aiya Yasir Sakr"
        ],
        "description": "Practice in writing short prose narratives and poetry for students who have finished composition and wish to develop their skills further. Workshop criticism.  CTL:IEL 1230 Introduction To Creative Writing",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Figures Of Myth And Legends II: Heroes And Villains",
        "subjectCode": "ENGL",
        "courseCode": "21800",
        "instructor": [
            "Michael Robert Johnston"
        ],
        "description": "This class offers in-depth explorations of the larger-than-life leaders (on the side of good, and sometimes evil, too) who have become models for how we think of heroism, charisma, and what it means to seek and wield power over others. From the chivalric Knights of the Round Table to the frightening energy of the Viking comitatus bands, it will show that no models of mythic leadership come without their complications--or admirable qualities.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Literature And Technology",
        "subjectCode": "ENGL",
        "courseCode": "22300",
        "instructor": [
            "Arkady Plotnitsky"
        ],
        "description": "This class uses literature to explore how technological innovation both enables and constrains creativity. It also explores how technology has been represented in literature, and examines the relationship between literature and new media.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Elements Of Linguistics",
        "subjectCode": "ENGL",
        "courseCode": "22700",
        "instructor": [
            "Yue Li",
            "Eunice Opoku",
            "Edier Gomez Alzate",
            "Vanessa Sheu",
            "Leah Michelle Nodar"
        ],
        "description": "A summary of what is known about human language, its structure, its universality, and its diversity; language in its social setting; language in relation to other aspects of human inquiry and knowledge. Credit will not be awarded for both ENGL 22700 and LC 26100. CTL:IEL 1260 Introduction To Linguistics",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Great Narrative Works",
        "subjectCode": "ENGL",
        "courseCode": "23000",
        "instructor": [
            "Emily McMillan Pearson",
            "Arkady Plotnitsky"
        ],
        "description": "Reading and discussion of great narratives from Homer's Odyssey to the present, considering works from a variety of cultures and time periods in order to develop an understanding of their ideas, structures, styles, and cultural values.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Intro To Disability Studies",
        "subjectCode": "ENGL",
        "courseCode": "23200",
        "instructor": [
            "Maren T Linett"
        ],
        "description": "Examination of a particular theme, such as the hero, death, or the city, and the techniques by which it is treated in various literary works, usually in more than one genre. Current offerings available from counselors.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Poetry",
        "subjectCode": "ENGL",
        "courseCode": "23700",
        "instructor": [
            "Wendy S Flory"
        ],
        "description": "Reading and discussion of poetry from different periods aimed at enhancing the student's understanding of genre, form, and style; how poetry grows out of and speaks to its historical moment; and how poetry addresses pressing social issues. CTL:IEL 1271 Introduction To Poetry.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Fiction",
        "subjectCode": "ENGL",
        "courseCode": "23800",
        "instructor": [
            "Paul W White",
            "Daniel C Morris",
            "Marybeth Perdomo"
        ],
        "description": "Reading and discussion of fiction from different periods aimed at enhancing the student's understanding of genre, form, and style; how fiction grows out of and speaks to its historical moment; and how fiction addresses pressing social issues.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "British Literature After 1789",
        "subjectCode": "ENGL",
        "courseCode": "24100",
        "instructor": [
            "Geraldine S Friedman"
        ],
        "description": "A historically oriented survey of genres, authors, and texts from the Romantic period on.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Great American Books",
        "subjectCode": "ENGL",
        "courseCode": "25000",
        "instructor": [
            "Robert P Lamb"
        ],
        "description": "What makes great American books so compelling? This course examines the dynamic history of American literature and explores how canonical and contemporary books have shaped the cultural landscape of the U.S. and the world.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Literature Of Black America",
        "subjectCode": "ENGL",
        "courseCode": "25700",
        "instructor": [
            "Paul Ryan Schneider"
        ],
        "description": "A survey of literature written by black American authors. Close attention is paid to the history of black literature and to the historical context in which it was written, as well as to the texts of major works by black writers.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "The Bible As Literature",
        "subjectCode": "ENGL",
        "courseCode": "26400",
        "instructor": [
            "Gwenael Bruno Jouin"
        ],
        "description": "  A literary study of selections from the Old and New Testaments as examples of Hebrew and early Christian literature.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "World Literature: From The Beginnings To 1700 A.D.",
        "subjectCode": "ENGL",
        "courseCode": "26600",
        "instructor": [
            "Ching Jen Sun"
        ],
        "description": "(CMPL 26600) World literature in translation. A comparative and chronological survey of the masterpieces of Eastern and Western literature.  CCN: IEL 1250 World Literature 1",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Shakespeare On Film",
        "subjectCode": "ENGL",
        "courseCode": "27600",
        "instructor": [
            "Paul W White"
        ],
        "description": "Considers the relation of the written text of five or six Shakespeare plays to multiple film versions from a wide variety of times and cultures, e.g., the United States, England, France, Italy, Japan, Denmark, India, and Russia.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Games, Narrative, Culture",
        "subjectCode": "ENGL",
        "courseCode": "28000",
        "instructor": [
            "Samantha Blackmon"
        ],
        "description": "This is an introduction to the field of game studies, and to games as narrative and cultural media. We will look at the stories games tell; the way their narrative elements or plot devices intersect with the culture around the games and gaming itself; and how all these things come together to affect game design, meaning, and play.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "The Movies",
        "subjectCode": "ENGL",
        "courseCode": "28600",
        "instructor": [
            "Thomas E Daniel",
            "Shaun F D Hughes"
        ],
        "description": "Introduction to the movies from classic to contemporary films.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Ways Of Reading",
        "subjectCode": "ENGL",
        "courseCode": "30100",
        "instructor": [
            "Daniel C Morris"
        ],
        "description": "Introduction to literary theory and practice. Close reading of and significant writing about selected literary texts informed by a variety of critical and/or theoretical perspectives.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Advanced Composition",
        "subjectCode": "ENGL",
        "courseCode": "30400",
        "instructor": [
            "Linda E Haynes"
        ],
        "description": "Designed for students who wish additional training in composition beyond the basic requirements. Extensive practice in the writing of mature expository, critical, and argumentative prose. (The course satisfies the Indiana certification requirement of three hours of advanced composition.)",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Professional Writing",
        "subjectCode": "ENGL",
        "courseCode": "30600",
        "instructor": [
            "Michael J Salvo"
        ],
        "description": "Development of skill in analyzing rhetorical situations in the workplace. Practice in planning, writing, evaluating, and revising a variety of documents typical of those used in the arts and industry.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Digital Design And Production",
        "subjectCode": "ENGL",
        "courseCode": "30900",
        "instructor": [
            "C Bradley Dilger"
        ],
        "description": "The development of the ability to write and design documents using electronic publishing technologies. Students will receive instruction in writing, graphics, and publishing software and will write, design, produce, and critique a number of publications.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Craft Of Poetry From a Writer's Perspective",
        "subjectCode": "ENGL",
        "courseCode": "31700",
        "instructor": [
            "Donald O Platt"
        ],
        "description": "This course focuses on the craft of poetry with some consideration of its underlying principles from a writer's perspective.  Topics of study may include works of poetry, statements of aesthetics and craft, and various poetic forms.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "English Language II: Structure And Meaning",
        "subjectCode": "ENGL",
        "courseCode": "32800",
        "instructor": [
            "Elena E Benedicto"
        ],
        "description": "The structure of American English and its dialects, with emphasis on syntax and semantics, including parts of speech, sentence structure, and meaning. Implications of recent theory for the teaching of English. Credit will not be given for both ENGL 32800 and LING 32100.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "English Language III: Sound And Form",
        "subjectCode": "ENGL",
        "courseCode": "32900",
        "instructor": [
            "Yuhyeon Seo"
        ],
        "description": "The structure of American English and its dialects, with emphasis on phonology and morphology. Implications of recent theory to the teaching of English.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Games And World Building",
        "subjectCode": "ENGL",
        "courseCode": "34500",
        "instructor": [
            "Samantha Blackmon"
        ],
        "description": "Every game designer and gamer knows that there is more to narrative than just words on a page and more to worldbuilding than images on a screen. This course looks at the ways that narrative worlds get built-in games. We will begin by looking at the narrative elements in analog games that have been the foundation of many digital games and move on to look at the elements in digital games that come together to form the worlds.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "American Literature Before 1865",
        "subjectCode": "ENGL",
        "courseCode": "35000",
        "instructor": [
            "Christopher J Lukasik"
        ],
        "description": "A historically oriented survey of genres, authors, and texts from European colonization to the U.S. Civil War.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Gender And Literature",
        "subjectCode": "ENGL",
        "courseCode": "36000",
        "instructor": [
            "Nancy J Peterson"
        ],
        "description": "An introduction to feminist approaches to the study of literature, including poetry, drama, fiction, and/or autobiography. Examines how gender intersects with race, ethnicity, sexual orientation, and class in shaping authorship, reading, and representation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Postcolonial Literatures",
        "subjectCode": "ENGL",
        "courseCode": "36600",
        "instructor": [
            "Aparajita Sagar"
        ],
        "description": "A study of Third World Literature, film, and theory that emerged during and after Western rule.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Science Fiction And Fantasy",
        "subjectCode": "ENGL",
        "courseCode": "37300",
        "instructor": [
            "Aparajita Sagar",
            "Geraldine S Friedman"
        ],
        "description": "Representative works of science fiction and fantasy examined in relation to both mainstream and popular literature. Emphasis is on technique, theme, and form.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "The Short Story",
        "subjectCode": "ENGL",
        "courseCode": "37900",
        "instructor": [
            "Robert P Lamb"
        ],
        "description": "A study of the development and features of the short story genre.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "The American Novel",
        "subjectCode": "ENGL",
        "courseCode": "38200",
        "instructor": [
            "Wendy S Flory"
        ],
        "description": "A survey of American novels ranging from the eighteenth century to the twenty-first-centuries.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "History Of Film To 1950",
        "subjectCode": "ENGL",
        "courseCode": "38600",
        "instructor": [
            "John N Duvall"
        ],
        "description": "This survey crosses the divide between the silent film era and the \"talkies\" to explore narrative, experimental, and documentary styles of feature films from the 1890s to 1950.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Practicum In Tutoring Writing",
        "subjectCode": "ENGL",
        "courseCode": "39000",
        "instructor": [
            "Jacob William Baumgartner"
        ],
        "description": "A practicum to teach undergraduates to teach writing in the one-to-one setting of a writing lab.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Composition For English Teachers",
        "subjectCode": "ENGL",
        "courseCode": "39100",
        "instructor": [
            "Mary Ellen Lennon"
        ],
        "description": "Exploration of the theory, research, and pedagogy of teaching writing at the secondary level.  Topics include the development of writing assignments and related activities, the study of writing process models, and the evaluation of student work in a variety of genres.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Young Adult Literature",
        "subjectCode": "ENGL",
        "courseCode": "39200",
        "instructor": [
            "Mary Ellen Lennon"
        ],
        "description": "This course examines the construct of Young Adult Literature as a genre crafted specifically for adolescents. Using both classic and contemporary novels, as well as relevant theoretical and research texts, this course explores how YA literature is defined, what it offers to adolescent readers, and how it is situated in the literary landscape.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Interdisciplinary Approaches To Environmental And Sustainability Studies",
        "subjectCode": "ENGL",
        "courseCode": "39300",
        "instructor": [
            "Robert P Marzec"
        ],
        "description": "(ANTH 39300) This course is the lynchpin of the undergraduate Certificate in Environmental and Sustainability Studies. It will present a series of case studies, core concepts, and problem questions that integrate the following three academic approaches: 1) Human Dimensions and Environment/Sustainability, 2) Engineering and Environment/Sustainability, and 3) Environmental/Sustainability Sciences.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Writing For Law",
        "subjectCode": "ENGL",
        "courseCode": "39600",
        "instructor": [
            "Mary Ellen Lennon",
            "Felicia D Roberts",
            "Emily L Allen",
            "Barry L Loftus",
            "Elaine J Francis"
        ],
        "description": "<a href=\"javascript:history.go(-1)\" onmouseover=\"window.status='Return to Previous';  return true\" onfocus=\"window.status='Return to Previous';  return true\" onmouseout=\"window.status='';  return true\" onblur=\"window.status='';  return true\">Return to Previous</a>",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Intermediate Poetry Writing",
        "subjectCode": "ENGL",
        "courseCode": "40700",
        "instructor": [
            "Adam B Giannelli"
        ],
        "description": "Study and practice of methods of composing poetry, with primary emphasis on the student's own work. Workshop criticism and discussion of published writing.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Creative Writing Capstone",
        "subjectCode": "ENGL",
        "courseCode": "40800",
        "instructor": [
            "Sharon D Solwitz"
        ],
        "description": "This course will focus on the writing and revision of the capstone thesis in Creative Writing, consisting of a substantial portfolio of either fiction or poetry with an introductory essay. Workshop, discussion of published writing, and individual conferences will form the center of the course with readings, lecture, and discussion of various literary topics. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Intermediate Fiction Writing",
        "subjectCode": "ENGL",
        "courseCode": "40900",
        "instructor": [
            "Casey M Gray",
            "Sharon D Solwitz"
        ],
        "description": "Study and practice of methods of composing fiction, with a primary emphasis on the student's own work. Workshop criticism and discussion of published fiction.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Milton God Champ Devil Advo",
        "subjectCode": "ENGL",
        "courseCode": "41100",
        "instructor": [
            "Angelica A Duran"
        ],
        "description": "A study of the literary, critical, or cinematic works of one or two influential authors or directors. A project-based capstone seminar containing a significant research component. May be repeated for credit only with a different topic.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Literature, Feminism, And AI",
        "subjectCode": "ENGL",
        "courseCode": "41400",
        "instructor": [
            "Robyn Angharad Bartlett"
        ],
        "description": "A study of literature or film from the perspective of the cultural norms and values it expresses, celebrates, and challenges. A project-based capstone seminar containing a significant research component. May be repeated for credit only with a different topic.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Multimedia Writing",
        "subjectCode": "ENGL",
        "courseCode": "41900",
        "instructor": [
            "Kaden C Milliren",
            "Tracy L Clark"
        ],
        "description": "Multimedia writing for networked contexts. Emphasizes principles, and practices of multimedia design, implementation, and publishing. Typical genres include Web sites, interactive media, digital video, visual presentations, visual argument, and user documentation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Business Writing",
        "subjectCode": "ENGL",
        "courseCode": "42000",
        "instructor": [
            "Robert Steven Beck",
            "Dan Mccormick",
            "Christopher Joseph Barber",
            "Richard D Johnson"
        ],
        "description": "Workplace writing in networked environments for management contexts. Emphasizes organizational context, project planning, document management, ethics, research, team writing. Typical genres include management memos, reports, letters, e-mail, resumes (print and online), oral presentations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Technical Writing",
        "subjectCode": "ENGL",
        "courseCode": "42100",
        "instructor": [
            "Melissa Kay Defrench",
            "Tracy L Clark"
        ],
        "description": "Workplace writing in networked environments for technical contexts. Emphasizes context and user analysis, data analysis/display, project planning, document management, usability, ethics, research, team writing. Typical genres include technical reports, memos, documentation, Web sites.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Writing For The Health And Human Sciences",
        "subjectCode": "ENGL",
        "courseCode": "42201",
        "instructor": [
            "Adrianna Marie Deptula",
            "Tracy L Clark"
        ],
        "description": "This course applies rhetorical principles to writing in health, hospitality, nutrition, nursing and related fields in the Health and Human Sciences.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Science And Medical Writing",
        "subjectCode": "ENGL",
        "courseCode": "43400",
        "instructor": [
            "Richard D Johnson"
        ],
        "description": "Science and Medical Writing is a professional writing workshop that teaches students how to write in medical and scientific fields. Students will learn the genres and conventions that are used by medical writers and science writers, as well as editors in these fields.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To English Studies",
        "subjectCode": "ENGL",
        "courseCode": "50100",
        "instructor": [
            "Michael Robert Johnston"
        ],
        "description": "Introduction to graduate studies in English with special emphasis on research and reference tools, methods of bibliography, and the writing of scholarly papers. Prerequisite: Fulfillment of the basic composition requirement and 6 credit hours in English.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Prac Teach Cr Writing",
        "subjectCode": "ENGL",
        "courseCode": "50200",
        "instructor": [
            "Sharon D Solwitz"
        ],
        "description": "Reading professional literature, preparing syllabi; evaluating student papers, leading discussions. Required of all teaching assistants in their initial semesters.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Approaches/Creative Wr",
        "subjectCode": "ENGL",
        "courseCode": "50500",
        "instructor": [
            "Sharon D Solwitz"
        ],
        "description": "Reading professional literature on the teaching of writing, linguistics, and ESL. Studies of methodologies, issues of assessment, and the relationship between theory and pedagogy. This course is not part of the degree requirement. Open only to teaching assistants in the Department of English. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Advanced Fiction Writing",
        "subjectCode": "ENGL",
        "courseCode": "50900",
        "instructor": [
            "Brian J Leung"
        ],
        "description": "Study and practice of advanced methods of composing fiction, with the primary emphasis on the student's own work. Workshop criticism and discussion of published writing.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "English Syntax And Syntactic Theory",
        "subjectCode": "ENGL",
        "courseCode": "51200",
        "instructor": [
            "Elena E Benedicto"
        ],
        "description": "Introduction to English syntactic structure, syntactic argumentation, and syntactic theory. Emphasis on one current theory as the primary theoretical framework, with other theories considered.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Advanced Professional Writing",
        "subjectCode": "ENGL",
        "courseCode": "51500",
        "instructor": [
            "Michael J Salvo"
        ],
        "description": "Production of documents and coordination of publishing projects for clients and users; application of advanced principles of document design, rhetoric, collaboration, and project management; and team writing in a computer-networked environment.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Teaching English As A Second Language: Theoretical Foundations",
        "subjectCode": "ENGL",
        "courseCode": "51600",
        "instructor": [
            "Harris J Bras"
        ],
        "description": "Survey of theories of learning and teaching English as a second/foreign/international language. Focus is on current theories and their implications for practice.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Modern Arab Thought",
        "subjectCode": "ENGL",
        "courseCode": "59600",
        "instructor": [
            "Ahmed Idrissi Alami"
        ],
        "description": "Advanced study of a topic within the instructor's fields of specialization. Emphasis on scholarly analysis and research.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Seminar In Poetry Writing",
        "subjectCode": "ENGL",
        "courseCode": "60600",
        "instructor": [
            "Adam B Giannelli"
        ],
        "description": "An advanced course in the writing of poetry. Workshop criticism. Study of the work of established writers. Prerequisite: admission to the MA program in creative writing.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "The Theory And Craft Of Creative Writing",
        "subjectCode": "ENGL",
        "courseCode": "60700",
        "instructor": [
            "Adam B Giannelli"
        ],
        "description": "A study of the craft of poetry, fiction, or drama with some consideration of underlying theories. Prerequisite: admission to the MA program in creative writing.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Classroom Communication In ESL For Teaching Assistants",
        "subjectCode": "ENGL",
        "courseCode": "62000",
        "instructor": [
            "Judson Criswell Wright",
            "Frederick Thomas Dunn",
            "Sharareh Taghizadeh Vahed",
            "Mark R Haugen",
            "Kyle Robert Swanson",
            "Beth A Lageveen",
            "Xiaorui Li"
        ],
        "description": "Student must be enrolled in the Graduate School and a non-native speaker of English. Permission of department required.",
        "capacity": 0,
        "credits": [
            5,
            5
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Experimental Syntax",
        "subjectCode": "ENGL",
        "courseCode": "62700",
        "instructor": [
            "Elaine J Francis"
        ],
        "description": "Investigation of a topic in advanced linguistics research.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Am Literary Hist Before 1900",
        "subjectCode": "ENGL",
        "courseCode": "65700",
        "instructor": [
            "Paul Ryan Schneider"
        ],
        "description": "A variable content seminar on authors, themes, genres, movements, geographic regions, or cultural contexts.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Cosmo Postcol Environmentalist",
        "subjectCode": "ENGL",
        "courseCode": "67300",
        "instructor": [
            "Beate I Allert"
        ],
        "description": "Advanced study of works from once-colonized cultures in Africa, Asia, the Caribbean, and/or postcolonial diasporas in the first world. Individual sections will focus on one or more of the following: literature, women's literature, film, and feminist and cultural theory.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Professional Personas",
        "subjectCode": "ENGL",
        "courseCode": "68000",
        "instructor": [
            "Thomas J Rickert",
            "Patricia A Sullivan"
        ],
        "description": "A variable content course dealing with topics such as cultural studies and composition, medieval rhetoric, renaissance rhetoric, literacy, historiographies of rhetoric, qualitative studies, and professional writing theory. Prerequisite: ENGL 59100.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    }
]