[
    {
        "title": "Insect Biology And Societal Grand Challenges",
        "subjectCode": "ENTM",
        "courseCode": "10100",
        "instructor": [
            "Matthew D Ginzel"
        ],
        "description": "An introduction to the roles of insect biologists in addressing societal grand challenges.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "The Practice Of Science",
        "subjectCode": "ENTM",
        "courseCode": "10200",
        "instructor": [
            "Jeffrey D Holland"
        ],
        "description": "A critical examination of science, best practices for conducting science, the contribution of research to knowledge accumulation, and the ethical obligations of scientists.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Insects: Friend And Foe",
        "subjectCode": "ENTM",
        "courseCode": "10500",
        "instructor": [
            "Laura L Ingwell"
        ],
        "description": "A one-semester course for nonscience students who want to know more about insects - the most numerous organisms on earth. An introduction to insects and their relationship with humankind, including interesting aspects of insect biology; insects in music, decoration, history; use of insects in teaching at the elementary school level; their use in art, photography, and drawing; insects as human food.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Scientific And Technical Communication",
        "subjectCode": "ENTM",
        "courseCode": "20100",
        "instructor": [
            "Ian Kaplan"
        ],
        "description": "Students gain a foundation for communicating science and insect biology at multiple levels through study and practice. Prior completion of a college-level composition course is strongly recommended.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "General Entomology",
        "subjectCode": "ENTM",
        "courseCode": "20600",
        "instructor": [
            "John S Yaninek"
        ],
        "description": "A general course on insect structure, function, biology, ecology and population management. Coordinated with the ENTM 20700 laboratory as an introductory course in entomology.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Forensic Investigation",
        "subjectCode": "ENTM",
        "courseCode": "22810",
        "instructor": [
            "Krystal Rae Hans"
        ],
        "description": "Forensic science investigation, crime scene management and field data collection techniques. Includes crime scene recognition and the documentation, collection, preservation, and processing of crime scene evidence. Emphasizes the place of field data collection as the first step in a sequence that takes evidence from scene to the lab for analysis and finally into the court of law.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Forensic Testimony And Ethics",
        "subjectCode": "ENTM",
        "courseCode": "22830",
        "instructor": [
            "Krystal Rae Hans"
        ],
        "description": "The final course in the forensic science program core, focuses on the legal ramifications that arise when forensic science is applied at the crime scene, in the crime lab and in the courtroom. Students are introduced to ethical issues that form the basis of all scientific investigations and the role of scientists as expert witnesses in maintaining the moral integrity of our justice system.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Experimentation And Analysis",
        "subjectCode": "ENTM",
        "courseCode": "30100",
        "instructor": [
            "Douglas Scott Richmond"
        ],
        "description": "Introduction to experimentation and quantitative data analysis in the life sciences with a focus on examples from insect biology.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Insect Identification",
        "subjectCode": "ENTM",
        "courseCode": "33500",
        "instructor": [
            "Aaron D Smith"
        ],
        "description": "This class is designed for learning more about the collection and identification of adult insects. Emphasis will be placed on collection and sampling techniques, the preparation of specimens for future study, and identification.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Applied Insect Biology",
        "subjectCode": "ENTM",
        "courseCode": "41000",
        "instructor": [
            "Clifford S Sadof"
        ],
        "description": "Identification, biology and management of insects associated with global food and energy security and human and animal health and well-being. Students are expected to have a knowledge of college biology.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Graduate Student Orientation",
        "subjectCode": "ENTM",
        "courseCode": "60000",
        "instructor": [
            "Catherine A Hill"
        ],
        "description": "Introduction and orientation to the requirements and culture of the Department of Entomology, the College of Agriculture, and Purdue University. Intended for graduate students in their first year.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Interntnl Pest Prblms & Soltns",
        "subjectCode": "ENTM",
        "courseCode": "69200",
        "instructor": [
            "Barry Robert Pittendrigh"
        ],
        "description": "Advanced topics in specialties of department members such as, but not limited to: biochemistry and physiology; biological control; insect pest management; veterinary entomology; nematode systematics; pathology; systematics. The field in which work is offered will appear on the student's record.  Doctoral student standing. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Fall 2023"
    }
]