[
    {
        "title": "Environmental Science And Conservation",
        "subjectCode": "FNR",
        "courseCode": "12500",
        "instructor": [
            "John B Dunning"
        ],
        "description": "(AGRY 12500, EAPS 12500, NRES 12500) Introduction to environmental science and conservation includes topics in ecological principles, conservation and natural resource management, human impacts on the environment, toxic waste disposal, climate change, energy, air and water pollution, environmental geology and geologic hazards.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Dendrology",
        "subjectCode": "FNR",
        "courseCode": "22500",
        "instructor": [
            "Ovidiu Andrei Toca"
        ],
        "description": "Field identification, taxonomy, and ecological characteristics of trees, shrubs, and herbs found in forests, prairies, old fields, and wetlands.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "The World's Forests And Society",
        "subjectCode": "FNR",
        "courseCode": "23000",
        "instructor": [
            "Eva Haviarova"
        ],
        "description": "Examination of structure, function, and environmental and cultural significance of forest ecosystems throughout the world.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Ecology And Systematics Of Fishes, Amphibians And Reptiles",
        "subjectCode": "FNR",
        "courseCode": "24150",
        "instructor": [
            "Dylan Kenji Wainwright"
        ],
        "description": "Introduction to the ecology and systematics of Fish, Amphibians and Reptiles. Discuss the evolutionary adaptations and ecological processes of these vertebrate groups at the individual, population, and community levels. Examine the roles of phylogeny, physiology, morphology, and behavior in influencing organismal responses to the environment. Assess issues related to the conservation of fish, amphibians and reptiles.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Landscape-Level Planning",
        "subjectCode": "FNR",
        "courseCode": "27000",
        "instructor": [
            "Kara A Salazar"
        ],
        "description": "The main objective of this course is to teach students about natural resources planning with an emphasis on critical skills for developing landscape-level management plans. This one credit course uses guest speakers, lectures, in-class activities, group presentations and take-home assignments to facilitate student learning.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Sustainable Wood Products Manufacturing",
        "subjectCode": "FNR",
        "courseCode": "30110",
        "instructor": [
            "Rado Gazo"
        ],
        "description": "Sustainable wood processing methods for hardwood and softwood sawmilling; veneering; plywood; pallets; lumber drying; reconstituted products including particleboard, medium density fiberboard, and oriented strand board; wood preservation including lumber, crossties, poles, and piling; secondary products including furniture, cabinets, millwork; and others; wood residues, woody biomass and others as appropriate will be covered. In addition to processing methods, the grading of material, including logs, hardwood and softwood lumber and consideration of applicable standards, and sustainability initiatives will be covered.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Forest Ecosystems",
        "subjectCode": "FNR",
        "courseCode": "33100",
        "instructor": [
            "Michael A Jenkins"
        ],
        "description": "Introduction to ecosystem processes, with emphasis on structural dynamics, energy flows, nutrient cycling, spatial patterns, classification and interaction of plant and animal populations. Processes will be related to human activities.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Silviculture",
        "subjectCode": "FNR",
        "courseCode": "33800",
        "instructor": [
            "Michael R Saunders"
        ],
        "description": "  This course introduces the common silvicultural systems used in North American forests for forestry and wildlife habitat management objectives. Topics range from stand dynamics to thinning practices and regenerative harvest systems in naturally-regenerated forests. Lectures present theoretical concepts in order to allow students to understand forest management practices, while the recitation portion of this course reviews these concepts in light of wildlife habitat management, biodiversity, and other non-timber resources. The recitation is writing-intensive requiring several reflection papers on assigned readings and a semester-ending term paper on a subject of the student's choosing. Credit cannot be earned for both FNR 33800 and FNR 43900. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Wildlife Habitat Management",
        "subjectCode": "FNR",
        "courseCode": "34100",
        "instructor": [
            "Elizabeth A Flaherty"
        ],
        "description": "Principles, practices, and justification of the habitat management approach to the manipulation of wildlife populations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Fundamental Remote Sensing",
        "subjectCode": "FNR",
        "courseCode": "35700",
        "instructor": [
            "Aishwarya Chandrasekaran"
        ],
        "description": "Introduction to the principles of remote sensing, aerial photo interpretation, photogrammetry, geographic information systems, and global positioning systems. Primary applications of geospatial science and technology in forestry and natural resources.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Spatial Ecology",
        "subjectCode": "FNR",
        "courseCode": "35910",
        "instructor": [
            "Bryan C Pijanowski"
        ],
        "description": "Introduction to the principles of landscape ecology and biogeography. Landscape ecology focuses on the important relationships of landscape structure (pattern, heterogeneity) and ecological processes (movement of animals, hydrologic dynamics) and how this information is used for natural resource management. Biogeography examines ecological patterns and processes at larger scales (generally at subcontinental to global) for the purposes of managing plants and animals of global importance.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Optimize Student Conference Attendance",
        "subjectCode": "FNR",
        "courseCode": "37700",
        "instructor": [
            "Elizabeth A Flaherty"
        ],
        "description": "  Participation in this course will formalize the experience of attending a professional conference by training students to optimize their experience. Students will then attend a professional conference with mentoring from the course instructors. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Limnology",
        "subjectCode": "FNR",
        "courseCode": "40100",
        "instructor": [
            "Jacob Daniel Hosen"
        ],
        "description": "Limnology is the study of the chemical, physical, geological, biological, and ecological processes that influence the structure and function of freshwater ecosystems. The course will focus on developing the understanding of key terms and mechanisms related to the basic understanding of limnological processes. Moreover, various applications and management considerations related to freshwater ecosystems will be presented.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Tree Physiology",
        "subjectCode": "FNR",
        "courseCode": "43400",
        "instructor": [
            "Ovidiu Andrei Toca"
        ],
        "description": "Study of physiology of growth and development of woody plants. Emphasis on the structure and function of trees and their physiological response to environmental factors.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Silviculture",
        "subjectCode": "FNR",
        "courseCode": "43900",
        "instructor": [
            "Michael R Saunders"
        ],
        "description": "This course details common silvicultural systems used in North America for establishment and tending of forest stands for a variety of objectives. Topics range from stand dynamics to thinning practices and regenerative harvest systems in naturally regenerated forests. Lectures focus is on theoretical concepts in order to allow students to apply their knowledge to North American forest ecosystems, while the laboratory portion of this course includes practical experience in marking silvicultural prescriptions and conducting silvicultural treatments. Lab projects emphasize critical thinking, data-driven decision-making (using growth and yield models), technical writing and oral communication. Permission of department required. Credit cannot be earned for both FNR 33800 and FNR 43900.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Arboricultural Practices",
        "subjectCode": "FNR",
        "courseCode": "44400",
        "instructor": [
            "Benjamin Zachary McCallister"
        ],
        "description": "Course covers a broad spectrum of arboriculture principles and techniques, including pruning, transplanting, fertilization, climbing, rigging, removal, cabling, bracing, lightning protection, hazard tree evaluation, tree appraisal, and street tree inventory.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Vertebrate Population Dynamics",
        "subjectCode": "FNR",
        "courseCode": "44700",
        "instructor": [
            "Patrick A Zollner"
        ],
        "description": "Estimation and analysis of populations; computer modeling of sampling methods, population dynamics, population and habitat management. Knowledge of computer programming not required.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Fish And Marine Population Dynamics",
        "subjectCode": "FNR",
        "courseCode": "45600",
        "instructor": [
            "Tomas O Hook"
        ],
        "description": "Theory of population dynamics of animal populations in freshwater and marine environments. Application of quantitative methodologies for the assessment and manipulation of aquatic habitats, marine and freshwater invertebrates, sport and commercial fish populations, and aquatic communities. Human resource users and non-users are considered.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "History And Role Of Hunting In North American Wildlife Conservation",
        "subjectCode": "FNR",
        "courseCode": "46500",
        "instructor": [
            "Jarred M Brooke"
        ],
        "description": "Introduction to the social, economic and wildlife management importance of hunting and how it relates to North American wildlife conservation. History of hunting and the North American Model of wildlife conservation, contrasted with those of European nations. Students will be required to participate in or observe hunting-related activities outside of class. This exercise is conducted off-campus on local Purdue-maintained properties.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Sustainable Wood Products, Furniture Design And Manufacturing",
        "subjectCode": "FNR",
        "courseCode": "48410",
        "instructor": [
            "Rado Gazo"
        ],
        "description": "This project-based course explains principles of product development, furniture construction, strength design, performance testing, and product sustainability (life cycle analysis and end-of-life options). The course familiarizes students with methods such as Computer-Aided Design (CAD), Computer-Aided Manufacturing (CAM), Computer Numerical Control (CNC) router operation, rapid prototyping, and basics of secondary wood products manufacturing, to build an actual product.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Aquatic Sampling Tech",
        "subjectCode": "FNR",
        "courseCode": "49800",
        "instructor": [
            "Christian E Butzke",
            "Reuben R Goforth"
        ],
        "description": "Topics vary. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Ecotoxicology",
        "subjectCode": "FNR",
        "courseCode": "52700",
        "instructor": [
            "Tyler D Hoskins"
        ],
        "description": "This course covers theoretical and applied approaches to the science of ecotoxicology, including application of the tools and procedures used to understand toxicant fate and effects in free-ranging animals and ecosystems. Students are expected to be knowledgeable in chemistry, biology, and animal physiology.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Wildlife And Environmental Forensics",
        "subjectCode": "FNR",
        "courseCode": "52800",
        "instructor": [
            "Andrew P Hopkins"
        ],
        "description": "Theoretical and applied approaches to the science of wildlife and environmental forensics. General introduction on environmental forensics followed by discussion of different types of investigations. Includes application of tools and procedures used to solve crimes, including morphological, chemical and biological analysis of evidence. All material will be discussed in relation to criminal investigation. (Offered in even-numbered years)",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Conservation Biology I",
        "subjectCode": "FNR",
        "courseCode": "54300",
        "instructor": [
            "John B Dunning"
        ],
        "description": "Introduction to conservation biology, including population dynamics and genetic structure of rare organisms. Recovery planning, restoration ecology, environmental policy making, and sustainable developments are considered, as is ethics in conservation of biological diversity. Offered in odd-numbered years. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Research Methods For Natural Resource Social Science",
        "subjectCode": "FNR",
        "courseCode": "58000",
        "instructor": [
            "Zhao Ma"
        ],
        "description": "This class covers basic elements of research design for social scientists, with an emphasis on issues pertinent to natural resource management. Topics to be covered include the role of theories and paradigms in designing sound research, writing research questions and hypotheses, and the importance of validity and reliability in research design. Qualitative, quantitative, and mixed methods designs are presented and discussed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Urban Ecology",
        "subjectCode": "FNR",
        "courseCode": "58600",
        "instructor": [
            "Brady S Hardiman"
        ],
        "description": "Urbanization is on the rise, transforming natural ecosystems into coupled human-natural ecosystems that encompass complex, novel functional and structural characteristics shaped by people and the inherent environment. Through local field trips and readings of the primary scientific literature, we examine the unique characteristics of coupled human-natural ecosystems. The course is designed to be broadly accessible to students from a variety of backgrounds, interests, and majors who are interested in environmental science and engineering and emphasizes the importance of incorporating an ecological perspective in environmental engineering and natural resource management. This course covers fundamental principles of ecology as applied in urban and other coupled human-natural systems with emphasis on the impact of modern industrial society on ecosystem structure and function. Organizing themes addressed in this class include macroscale processes, systems thinking, and topics related to urban systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Teaching In Natural Resources",
        "subjectCode": "FNR",
        "courseCode": "59000",
        "instructor": [
            "Elizabeth A Flaherty"
        ],
        "description": "This applied course introduces topics related to teaching science courses to facilitate and support the success of teaching assistants in Forestry and Natural Resources. Students will read and review assigned reading and then participate in a discussion at a weekly class meeting. Students also will have an opportunity to practice and apply concepts through development and presentation of a lesson plan. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Adv Fish & Marine Pop Dynamics",
        "subjectCode": "FNR",
        "courseCode": "59800",
        "instructor": [
            "Rado Gazo",
            "Tomas O Hook"
        ],
        "description": "Subjects and problems of interest to the student. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2023"
    }
]