[
    {
        "title": "Orientation To Current Issues In Human Development And Family Science",
        "subjectCode": "HDFS",
        "courseCode": "10000",
        "instructor": [
            "Cezanne M Elias"
        ],
        "description": "  Introduction to fields related to Human Development and Family Science, including majors and career paths. You will meet faculty, alumni, and professionals working in related areas. You will be matched with an advanced student mentor who will help you learn how to become successful as a HDFS student and beyond. Required of all students majoring in the department. Non-majors interested in learning more about HDFS majors are also welcome. ",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Family Processes",
        "subjectCode": "HDFS",
        "courseCode": "20100",
        "instructor": [
            "Marissa Claire Knox",
            "Marsella Rose Shrout"
        ],
        "description": "An examination of the interpersonal processes that take place within family contexts. Emphasis is on family dynamics. Also considered are linkages between family processes and the broader social environment. Basic components of the research process will be introduced.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Human Development",
        "subjectCode": "HDFS",
        "courseCode": "21000",
        "instructor": [
            "Marissa Claire Knox",
            "Laura Marie Elenbaas"
        ],
        "description": "This course provides an introduction to the development of individuals from the prenatal period to adulthood and old age. Theories and research findings related to physical growth, cognitive and language development and social and emotional development will be discussed. CTL:ISH 1021 Developmental Psychology.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Diversity In Individual And Family Life",
        "subjectCode": "HDFS",
        "courseCode": "28000",
        "instructor": [
            "Annabelle Lin Atkin",
            "Janet Marian Rhodes-Carlson"
        ],
        "description": "Students are introduced to aspects of individual and family life in diverse cultures, particularly racially and/or ethnically diverse families in the United States. The nature of relationships between dominant and minority cultures is considered. Implications of diversity for practice with diverse populations are emphasized throughout the course.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Biosocial Foundations Of The Family",
        "subjectCode": "HDFS",
        "courseCode": "30500",
        "instructor": [
            "Amy Milin Loviska"
        ],
        "description": "Family ties and family processes in the promotion of individual health and management of disease across the life course are covered. Course reviews research on families and health from multiple disciplinary perspectives.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Child Development",
        "subjectCode": "HDFS",
        "courseCode": "31100",
        "instructor": [
            "Deborah L Nichols",
            "German E Posada"
        ],
        "description": "This course addresses the study of development from infancy through childhood. It includes processes of physical, cognitive, language, social, and emotional development. Processes are discussed within the framework of historical and contemporary theories and current research. In addition, it covers topics related to methodologies used in the study of infant and child development. Finally, the conditions of children in different parts of the world are considered.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Adult Development",
        "subjectCode": "HDFS",
        "courseCode": "31200",
        "instructor": [
            "Elliot M Friedman"
        ],
        "description": "An in-depth study of developmental processes from the transition to adulthood through old age. Particular emphasis is placed on understanding the influence of contexts on adult development.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Adolescent Development",
        "subjectCode": "HDFS",
        "courseCode": "31300",
        "instructor": [
            "Paul Anthony Robbins"
        ],
        "description": "An overview of the normative developmental changes that occur during adolescence, with specific attention to individual and relational adjustment.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Atypical Child Development",
        "subjectCode": "HDFS",
        "courseCode": "31400",
        "instructor": [
            "Amy J M Schwichtenberg"
        ],
        "description": "Atypical child development from conception to adolescence can emerge from genetic, medical/health, educational, psychological, and/or contextual factors. This course will survey factors (e.g., premature birth, obesity, neurodevelopmental disorders, learning difficulties, child abuse, and war) that contribute to atypical child development. It will assess how and when typical and atypical developmental trajectories diverge and the roles of measurement and intervention.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Developmental Assessment",
        "subjectCode": "HDFS",
        "courseCode": "31801",
        "instructor": [
            "Shawna Guinevere Harbin"
        ],
        "description": "This course provides an introduction to the variety and characteristics of developmental assessments for young children, birth to age 8. Students learn formal and informal strategies for documenting individual development and learning; linking assessment and instruction; and, the use of assessment for determining eligibility for early intervention/early childhood special education. Students learn partnering with families, other professionals, as well as cultural and ethical issues in assessment.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Health And Health Care For Children And Families",
        "subjectCode": "HDFS",
        "courseCode": "32500",
        "instructor": [
            "Kirsten Lee Anderson"
        ],
        "description": "This course discusses leading causes of child health problems as well as examines the child and family reactions and adjustment to illness and disability. A developmental perspective on coping with health problems from early childhood through adolescence is presented. An overview on global child health disparities is also addressed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Sexuality And Family Life",
        "subjectCode": "HDFS",
        "courseCode": "33000",
        "instructor": [
            "Cezanne M Elias"
        ],
        "description": "Provides the student with a basic knowledge of human sexuality as it pertains to individuals, couples and families. The course is designed to be helpful to students who will become family life educators as well as to be helpful to students as individuals, spouses, and parents.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Skills For Helping Professionals In Individual, Family And Group Settings",
        "subjectCode": "HDFS",
        "courseCode": "33100",
        "instructor": [
            "Davina Nicole Santos Quichocho"
        ],
        "description": "This course is an introduction to skills commonly used in helping professions, including relationship-building skills, beginning interviewing skills, and group process skills. Attention is paid to cultural competence and professional ethics. This course includes a weekly lab experience involving practice of the helping skills, as well as a service-learning project in which helping skills are used in a community setting.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Working With Parents",
        "subjectCode": "HDFS",
        "courseCode": "34100",
        "instructor": [
            "Davina Nicole Santos Quichocho"
        ],
        "description": "This course focuses on developing and maintaining effective relationships between parents and professionals working with children, within the context of family-centered practices. Issues related to cultural, linguistic, economic, and developmental differences that affect relations between families and professionals are examined.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Assessment And Case Management",
        "subjectCode": "HDFS",
        "courseCode": "34300",
        "instructor": [
            "Natasha D Watkins"
        ],
        "description": "This course is an introduction to case management as a service delivery approach for helping individuals and families in need.  This course provides opportunities to practice basic helping and case management skills such as building rapport, assessing client needs, developing intervention plans, professional ethics, and professional writing.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Research Design And Program Evaluation",
        "subjectCode": "HDFS",
        "courseCode": "34600",
        "instructor": [
            "Paul Anthony Robbins",
            "Doran C French"
        ],
        "description": "This course is an introduction to research methods as used in community programs for children and families including review and application of existing research literature, generating research questions, conducting program needs assessments, evaluating processes and outcomes of existing programs, designing and interpreting applied research studies, and understanding ethical responsibilities in the use and application of research. Instruction has been designed to provide the skills necessary to use existing research and generate new data to benefit programs.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Administration Of Social Service Not-For-Profit Organizations",
        "subjectCode": "HDFS",
        "courseCode": "34800",
        "instructor": [
            "William A Stanczykiewicz"
        ],
        "description": "This course introduces students to aspects of not-for-profit management identified as keys by leaders in existing agencies. Students will prepare themselves for specifically establishing, building, working in and leading not-for-profit organizations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Language, Literacy, And Social Studies In Preschool And Primary Grades",
        "subjectCode": "HDFS",
        "courseCode": "40500",
        "instructor": [
            "Elizabeth C Schlesinger-Devlin"
        ],
        "description": "This course focuses on teaching language, literacy and social studies in preschool and primary-grade classrooms. It covers the developmental foundations and curriculum applications of language, literacy and social studies teaching in pre-kindergarten and of social studies in primary grades and includes ways to plan, implement and evaluate developmentally appropriate instruction for children with and without disabilities and children who are learning English.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Early Intervention / Early Childhood Special Education: Issues And Professional Practices",
        "subjectCode": "HDFS",
        "courseCode": "40800",
        "instructor": [
            "Megan L Purcell"
        ],
        "description": "  An introduction to the field of early intervention / early childhood special education including its origin, services, and practices in working with young children ages birth through eight with or at risk for developmental delays and disabilities and their families. Designing curriculum, environments, and services where all children are included, have equal opportunity for access and engagement, and feel a sense of belonging is addressed. For Early Childhood Education and Exceptional Needs majors only. A field experience in preschool or primary grade-classrooms is included.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Understanding Autism",
        "subjectCode": "HDFS",
        "courseCode": "41800",
        "instructor": [
            "Brandon M Keehn"
        ],
        "description": "(PSY 41800, SLHS 41800) This course will explore the etiology, neuroscience, diagnosis, and treatment of autism spectrum disorder (ASD). Approached from a multi-disciplinary perspective this course brings together gene, brain, and behavioral sciences with the aim of developing a better understanding of autism. The course will begin with an overview of ASD as a complex behavioral phenotype. This will include discussion of the history ASD and the expansion of the diagnostic criteria associated with the disorder. This introduction will be followed by several classes in which we will examine some of the key domains of impairment in ASD: reciprocal social interaction, language and communication, and restricted and repetitive behaviors. We will also consider the deficits associated with, but not defining of ASD, and examine co-morbid conditions frequently present in individuals with ASD. We will then address the topics of brain architecture, neurochemistry, and genetics and gene expression, all of which we will attempt to relate back to the behavioral features of autism. We will end the course with a review of treatment practices and their efficacy and an examination of impact of ASD on the family and society.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Developmental Foundations Of Infant And Toddler Curriculum",
        "subjectCode": "HDFS",
        "courseCode": "42000",
        "instructor": [
            "Chanele D Robinson-Rucker"
        ],
        "description": "Study of typical and atypical development in infants and toddlers as well as implication for practice. Focuses on infant toddler developmental assessment and designing and implementing learning activities in all developmental areas and enhancing parent/professional relationships. Includes a practicum experience with infants and toddlers.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Internship & Career Preparation For Human Services",
        "subjectCode": "HDFS",
        "courseCode": "45100",
        "instructor": [
            "Natasha D Watkins"
        ],
        "description": "This course includes an overview of HDFS-related professions, self-evaluation, career search skills, exploration of internship opportunities, and professional development. Students will complete arrangements for their field placement.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Internship & Career Preparation For Developmental And Family Science",
        "subjectCode": "HDFS",
        "courseCode": "45400",
        "instructor": [
            "Natasha D Watkins"
        ],
        "description": "This course includes an overview of HDFS-related professions, self-evaluation, career search skills, exploration of internship opportunities, and professional development. Students will complete arrangements for their field placement.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Advanced Human Development",
        "subjectCode": "HDFS",
        "courseCode": "60600",
        "instructor": [
            "Elliot M Friedman"
        ],
        "description": "  This course provides an overview of human development and serves as a graduate-level introduction to HDFS. Relevant theories and models will provide the structure for consideration of the nature, processes, and mechanisms of developmental change. Particular attention will be paid to diversity in developmental influences and trajectories, including atypical development. Students will gain specific knowledge and professional skills through the pursuit of individual research interests, culminating in a written grant proposal and class presentation of the proposal.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Quantitative Methods I: Inferential Statistics And ANOVA",
        "subjectCode": "HDFS",
        "courseCode": "61300",
        "instructor": [
            "Sharon L Christ"
        ],
        "description": "This course provides a basic understanding of foundational concepts and tools used in statistical analysis and inference in the behavioral sciences, including data preparation, sample description, hypothesis testing, univariate and bivariate statistics, and ANOVA. Emphasis is placed on the conceptual and interpretive understanding of statistical methods. Prerequisite: Undergraduate coursework in Statistics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Adolescent Development In Context",
        "subjectCode": "HDFS",
        "courseCode": "61900",
        "instructor": [
            "Zoe E Taylor"
        ],
        "description": "This course is a graduate level seminar of major issues concerning adolescents, with attention to a developmental perspective. The social ecology of adolescent development and an understanding of adolescents in their social contexts is emphasized. Prerequisite: Human Development & Family Studies majors only.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Child And Family Social Policy",
        "subjectCode": "HDFS",
        "courseCode": "62500",
        "instructor": [
            "Robert J Duncan"
        ],
        "description": "An examination of selected issues related to child and family policy relevant to scholars of CDFS. These issues include: (1) influences of research on children and families on the policy process; (2) the role of child and family specialists as advocates and analysts; (3) policy formulation, enactment, and evaluation; and (4) child and family policy in cross-national perspective. Prerequisite: HDFS 60100 and HDFS 60200.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Graduate Student Colloquium",
        "subjectCode": "HDFS",
        "courseCode": "69700",
        "instructor": [
            "Shelley Margaret Macdermid Wadsworth"
        ],
        "description": "Research presentations by faculty members and graduate students and invited speakers. Includes attention to: (1) the responsible conduct of research, (2) professional/scholarly and teaching development, and (3) diversity, equity, and inclusion.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    }
]