[
    {
        "title": "Research Thinking",
        "subjectCode": "HONR",
        "courseCode": "19900",
        "instructor": [
            "Victoria Baker Dawkins",
            "Thomas Edward Gerrish",
            "Heidi Ione Fahning"
        ],
        "description": "These introductory topic seminars are designed to open intellectual horizons and allow opportunities for learning by inquiry in a collaborative environment. Courses are limited to 20 participants or less, may be team-taught, and emphasize close interaction between the professor(s) and the students.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Honors First Yr Experience I",
        "subjectCode": "HONR",
        "courseCode": "19901",
        "instructor": [
            "Nicole Marie Fadellin",
            "Christie Nicole Shee",
            "Jonathan P Moore",
            "Renee D Gaarder",
            "Mayari Illarij Serrano anazco",
            "Anish Vanaik",
            "Matthew Eric Pessar Joseph",
            "Nathan W Swanson",
            "Elizabeth B Brite",
            "Dwaine H Jengelley",
            "Muiris Macgiollabhui",
            "Md Sanoar Rahman",
            "Jason A Ware",
            "Zahra A Tehrani"
        ],
        "description": "  All JMHC students take this 1 credit course each semester (fall and spring) of their first year. This \"Honors First Year Experience\" is designed to introduce students to college-level honors education. Learning outcomes include how to be flexible thinkers, inclusive collaborators, and ethical leaders. In fall, students explore interdisciplinary topics in small seminars with dedicated faculty and work in groups with JMHC student mentors in \"world readiness\" labs.  ",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Interdisciplinary Approaches In Writing",
        "subjectCode": "HONR",
        "courseCode": "19903",
        "instructor": [
            "Kathryn Frances Dilworth",
            "Jonathan P Moore"
        ],
        "description": "This course is a writing-intensive course in which students learn how to find, evaluate, and use credible information, how to express themselves well in a variety of different written genres, and how to write for different audiences.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Community Of Inquiry",
        "subjectCode": "HONR",
        "courseCode": "22000",
        "instructor": [
            "Kristen Marie Bellisario",
            "Ashima Krishna"
        ],
        "description": "  This course is for new members of the Honors College community, who entered as continuing Purdue students or transferred to Purdue. It, being your first or one of your first courses in the Honors College, is designed to help you hone some of the fundamental learning outcomes of an honors education: interdisciplinary thinking, critical thinking, problem-solving, research thinking, collaboration, and global awareness. You will also engage with the pillars of the Honors College and develop community within the Honors College. To accomplish these objectives, the course is simultaneously project-based and experiential. You will work in multi-disciplinary teams on applied research that emphasizes critical and multi-dimensional thinking about real-world problems. Through project-based learning, you will move your skills beyond identifying and understanding a problem to identifying and formulating solutions to that problem. The problem addressed in the course is local or global in scope and has social, economic, political, and/or environmental implications for our local and/or global community as well as begs a multi-disciplinary, innovative solution. Continuing in the vein of experiential learning and of building your honors ethos, you will attend events (some as a class, others individually) and participate in programs in the Honors College and across campus that embody the Honors College's pillars: Community and Global Engagement, Leadership, Research, and Interdisciplinary Academics. You will curate a schedule of events that take place during the semester and reflect on these experiences. Permission of department required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Solutions Lab Global:Brzl/Peru",
        "subjectCode": "HONR",
        "courseCode": "22200",
        "instructor": [
            "Ashima Krishna"
        ],
        "description": "In this course, students from Purdue University (West Lafayette, Indiana) and at universities abroad will collaborate virtually in interdisciplinary teams to identify solutions to a major global challenge. Each semester, the theme of the global challenge changes. At the start of the course, students at both universities will meet together as a class to learn about the topic from a range of disciplinary perspectives through guest lectures, assigned readings, and class discussions. Students will then be divided into interdisciplinary teams with members from both universities and provided a prompt related to the semester's theme. Teams will spend several weeks of the course focused on researching, developing, and packaging their solutions, before presenting them publicly at the end of the term. In addition to increasing knowledge of the topic and improving teamwork skills, students in this course will advance in intercultural knowledge, skills, and attitudes through their international collaborative experience.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Research Accelerator Mentors",
        "subjectCode": "HONR",
        "courseCode": "29900",
        "instructor": [
            "Temitope Folasade Adeoye",
            "Heidi Ione Fahning",
            "Thomas Edward Gerrish",
            "Adam E Watkins"
        ],
        "description": "These interdisciplinary topics seminars are designed to offer experiential learning on campus, in the community, and around the world. Courses are limited to 20 participants or fewer, may be team-taught, and emphasize close interaction between the professor(s) and the students. Students will participate in active learning exercises that may include study away and study abroad, workshops, research and creative skill building, community collaboration, and/or service learning. Seminar topics will vary from semester to semester.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Interdisciplinary Honors",
        "subjectCode": "HONR",
        "courseCode": "29901",
        "instructor": [
            "Megha Anwer",
            "Adam E Watkins",
            "Katherine M Jarriel"
        ],
        "description": "This hands-on course provides leadership training to the continuing Honors College students selected to work as mentors for the required, first-year honors course. Students work closely with a faculty instructor. Restricted to Honors College students. Department permission required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "STS: Technobodies",
        "subjectCode": "HONR",
        "courseCode": "31300",
        "instructor": [
            "Katherine M Jarriel"
        ],
        "description": "  Science and technology are deeply intertwined with the distribution of costs and benefits in human society, underscoring the need for critical perspectives. This project-based course will examine the social and ethical implications of science and technology using interdisciplinary methodologies/approaches. Students will have the opportunity to address questions such as: How have particular scientific discoveries and technologies emerged or evolved? How have they shaped society, and how has society shaped science and technology? How have science and technology compounded social inequalities (race, class, gender), and how can they be changed to reduce inequalities? Topics that will be explored will vary each semester.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Human Epoch: Cmty & Infrastruc",
        "subjectCode": "HONR",
        "courseCode": "31400",
        "instructor": [
            "Nicole Marie Fadellin"
        ],
        "description": "  In this course, students will explore the entangled relations between humanity and the environment from multiple social contexts and time periods. Throughout the class, students will read, analyze, and discuss interdisciplinary scholarship from the social and behavioral sciences. Classroom activities will take the form of discussion, projects and group assignments, and writing assignments, with an emphasis on peer-to-peer learning. Students will create a project aimed at a public audience that demonstrates knowledge about key course topics and communicates connections between social/behavioral knowledge and personal, civic, ethical, or global decisions and policies. As a result of taking this course, students will be able to understand and evaluate critical questions about humanity and its ecologies, recognize the importance of those questions for various audiences, and draw connections between course materials and their own perspectives about the world.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Exile And Banishment",
        "subjectCode": "HONR",
        "courseCode": "39900",
        "instructor": [
            "Immanuel James Williams",
            "Muiris Macgiollabhui",
            "Christopher Greg Brinton",
            "Daniel A Guberman",
            "Danilo Rd Aguiar"
        ],
        "description": "This course is designated for a wide range of honors seminars that stress interdisciplinary understanding, intellectual flexibility, creative thought, and group discussion. Topics vary by semester. Open to students at all levels.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Well-Being",
        "subjectCode": "HONR",
        "courseCode": "46100",
        "instructor": [
            "Jason A Ware"
        ],
        "description": "Copenhagen, Zurich, Helsinki, Stockholm, and Tokyo are the five most livable cities in the world according to MONOCLE's 2021 Quality of Life Index. They are the highest-ranking cities when using metrics to measure crime, emergency services' response time, transportation networks, cycling culture, food, drink, retail, and the number of independent bookshops. MONOCLE's Quality of Life survey is one among the many that exist to rank the world's best cities, but wealth is one theme that emerges from among the varying indices and their respective results. The metrics, indeed the participants responding to the metrics, represent populations of people with high levels of discretionary income. How might the metrics reflect different values if these indices include a different kind of participant, such as the urban poor?",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Research Thinking Portfolio",
        "subjectCode": "HONR",
        "courseCode": "46300",
        "instructor": [
            "Christie Nicole Shee"
        ],
        "description": "This course establishes a new pathway for Honors completion through a critical engagement with the Undergraduate Research pillar of the college. This course will empower Honors students to leverage their research, scholarly, and creative experiences in curricular as well as co- and extra-curricular experiences toward completing the HC curriculum. Our course will combine workshops, hands-on laboratories, group discussion, and one-on-one meetings. The major assignment is a reflective portfolio, which will serve as a record of your past experiences and an opportunity to reflect on the ways in which your time as an Honors College student has shaped your research thinking and helped prepare you for life beyond the university. Successful completion of the course fulfills the scholarly project requirement of the HC curriculum.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Scholarly Project: Noise",
        "subjectCode": "HONR",
        "courseCode": "46400",
        "instructor": [
            "Kristen Marie Bellisario",
            "Dwaine H Jengelley",
            "Nathan W Swanson"
        ],
        "description": "This course fulfills the scholarly project requirement of the Honors College curriculum. Students will engage in original research projects that produce new knowledge.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Research Mentorship Development Program",
        "subjectCode": "HONR",
        "courseCode": "59901",
        "instructor": [
            "Zahra A Tehrani"
        ],
        "description": "The Research Mentorship Development Program is designed for Purdue based on a nationally recognized curriculum and prepares graduate students or postdocs to mentor undergraduates in research. Effective mentoring of undergraduate researchers requires specific skillsets and approaches. Implementation of these strategies can lead to a productive and mutually beneficial experience for both students and their mentors. The course is designed for graduate students who plan to work with new researchers in their labs or research groups and who plan to enter academia or pursue careers in which they will mentor others in scholarship or research. Graduate students or postdocs selected for the program are matched with honors students who are interested in research. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    }
]