[
    {
        "title": "Fundamentals Of Horticulture",
        "subjectCode": "HORT",
        "courseCode": "10100",
        "instructor": [
            "Michael N Dana"
        ],
        "description": "Biology and technology involved in the production, storage, processing, and marketing of horticultural plants and products. Laboratories include experiments demonstrating both the theoretical and practical aspects of horticultural plant growth and development.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Medicine In The Garden",
        "subjectCode": "HORT",
        "courseCode": "12100",
        "instructor": [
            "Joshua R Widhalm"
        ],
        "description": "A survey of the uses and properties of horticultural plants for human health and well-being. Topics will focus on the close relationships between plants and human physiology, nutrition, medicines, mind-altering drugs, poisons, and beverages.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Woody Landscape Plants",
        "subjectCode": "HORT",
        "courseCode": "21700",
        "instructor": [
            "Paul C Siciliano"
        ],
        "description": "Recognition and identification of woody landscape plants; plant characteristics in terms of landscape function.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Hardy Herbaceous Landscape Plants",
        "subjectCode": "HORT",
        "courseCode": "21820",
        "instructor": [
            "Michael N Dana"
        ],
        "description": "Survey of hardy perennial herbaceous ornamentals including native and non-native species, bulbs, groundcovers, grasses, ferns, aquatics; recognition; cultural requirements; and use in landscape plantings.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Landscape Contracting And Management",
        "subjectCode": "HORT",
        "courseCode": "31700",
        "instructor": [
            "Kyle M Daniel"
        ],
        "description": "Principles and practices applicable to the installation and management of landscape plants. Topics include site and project assessment, site modification and plant installation, the business practices of estimating and bidding, and plant management. Requires class trips. Students will pay individual lodging or meal expenses when necessary.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Hydroponics Systems",
        "subjectCode": "HORT",
        "courseCode": "49100",
        "instructor": [
            "Celina Gomez"
        ],
        "description": "Training in research techniques, statistical methods, and record procedures. Assigned research problems. A written report of work accomplished is required. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Horticulture Research Seminar",
        "subjectCode": "HORT",
        "courseCode": "60200",
        "instructor": [
            "Linda S Prokopy"
        ],
        "description": "Weekly attendance at the Horticulture and Landscape Architecture Departmental seminars to help graduate students develop an appreciation for attending seminars and learning appropriate and effective presentation skills. HORT 602 compliments HORT 601 and HORT 603 by extending the presentation and project development approaches learned, so that students are better ready to prepare and defend their project proposals in HORT 603. Prerequisite: BCHM 56100.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Metabolic Plant Physiology",
        "subjectCode": "HORT",
        "courseCode": "64000",
        "instructor": [
            "Natalia Doudareva"
        ],
        "description": "(BCHM 64000, BTNY 64000) Topics include photosynthesis, respiration, carbohydrate and lipid metabolism, and nitrogen, sulfur, and secondary metabolism. This course is the third in a series of core courses in the Purdue Plant Biology Program graduate curriculum. Prerequisite: BCHM 56100, BTNY 55300 or HORT 55300, Prerequisite: BIOL 55100 or HORT 55100.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Horticulture Seminar",
        "subjectCode": "HORT",
        "courseCode": "69500",
        "instructor": [
            "Joshua R Widhalm"
        ],
        "description": "Topics of current interest to staff and students.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2023"
    }
]