[
    {
        "title": "Industrial Engineering Seminar",
        "subjectCode": "IE",
        "courseCode": "20000",
        "instructor": [
            "Patrick Alan Brunese"
        ],
        "description": "An orientation course to inform students of  the major options in the industrial engineering program, assistance in selection of appropriate electives to meet career objectives, introduction to the faculty, and selection of an academic advisor.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Probability And Statistics In Engineering I",
        "subjectCode": "IE",
        "courseCode": "23000",
        "instructor": [
            "Pramiti Sarker"
        ],
        "description": "An introduction to probability and statistics. Probability and probability distributions. Mathematical expectation. Functions of random variables. Estimation. Applications oriented to engineering problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Probability And Statistics In Engineering II",
        "subjectCode": "IE",
        "courseCode": "33000",
        "instructor": [
            "Anika Jannat Rimu"
        ],
        "description": "Introduction to statistical inference and experimental design. Correlation, regression, single and multi-factor ANOVA, non-parametric methods. Applications to statistical quality control.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Computing In Industrial Engineering",
        "subjectCode": "IE",
        "courseCode": "33200",
        "instructor": [
            "Mario Ventresca"
        ],
        "description": "Introduction to computing in industrial engineering. Reinforcement of scientific programming skills on typical IE tasks, together with introduction to simulation and related computer tools.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Operations Research",
        "subjectCode": "IE",
        "courseCode": "33500",
        "instructor": [
            "Lucky Cho",
            "Reem Khir"
        ],
        "description": "Introduction to deterministic optimization modeling and algorithms in operations research. Emphasis on formulation and solution of linear programs, networks flows, and integer programs.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Operations Research",
        "subjectCode": "IE",
        "courseCode": "33600",
        "instructor": [
            "Mohamed Salama"
        ],
        "description": "Introduction to probabilistic models in operations research. Emphasis on Markov chains, Poisson processes, and their application to queuing systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Engineering Economics",
        "subjectCode": "IE",
        "courseCode": "34300",
        "instructor": [
            "Hua Cai",
            "Zhuoli Yin"
        ],
        "description": "Cost measurement and control in engineering studies. Basic accounting concepts, income measurement, and valuation problems. Manufacturing cost control and standard cost systems. Capital investment, engineering alternatives, and equipment replacement studies. Not open to students with credit in CE 39400.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Manufacturing Processes I",
        "subjectCode": "IE",
        "courseCode": "37000",
        "instructor": [
            "Wenzhuo Wu"
        ],
        "description": "Principal manufacturing processes; metal cutting, grinding and metal forming operations, machine tools, and tools and tooling. Nontraditional machining and welding. Introduction to computer-aided manufacturing and computer-aided graphics and design, N/C programming, robots, and flexible manufacturing systems. Classroom and laboratory demonstrations included. Not open to students with credit in ME 36300.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Integrated Production Systems I",
        "subjectCode": "IE",
        "courseCode": "38300",
        "instructor": [
            "Mohamed Salama"
        ],
        "description": "Basic concepts in the design and operational control of integrated production systems. Includes topics on facility layout and material handling, material flow and information flow, resource and capacity planning, and shop floor control and scheduling.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Work Analysis And Design I",
        "subjectCode": "IE",
        "courseCode": "38600",
        "instructor": [
            "Pramiti Sarker"
        ],
        "description": "Fundamentals of work methods and measurement. Applications of engineering, psychological, and physiological principles to the analysis and design of human work systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Industrial Engineering Design",
        "subjectCode": "IE",
        "courseCode": "43100",
        "instructor": [
            "Syed Ahmad Helmi Bin Syed Hassan"
        ],
        "description": "Capstone design experience for industrial engineering students involving analysis and synthesis of unstructured problems in practical settings. Students work in teams to formulate issues, propose solutions, and communicate results in formal written and oral presentations. Prerequisite: all 30000-level industrial engineering courses required for the BS IE degree.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Manufacturing Processes II",
        "subjectCode": "IE",
        "courseCode": "47000",
        "instructor": [
            "Gary J Cheng"
        ],
        "description": "The interrelations of materials, processes, and design with various aspects of manufacturing.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Imagine, Model, Make",
        "subjectCode": "IE",
        "courseCode": "47200",
        "instructor": [
            "Ramses Martinez"
        ],
        "description": "This course develops a holistic view of an initial competency in engineering design by conceiving, designing, manufacturing, and optimizing a system component such as a complex structural part. Activities include hand sketching, CAD modeling, and operation of CNC machining equipment for rapid prototyping. Tolerance requirements will be verified and optimized prior to the fabrication of the part in the laboratory using rapid prototyping techniques. The focus is on the design process itself as well as the complementary roles of human creativity and computational methods and tools.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Industrial Control Systems",
        "subjectCode": "IE",
        "courseCode": "47400",
        "instructor": [
            "Yu She"
        ],
        "description": "Introduction to automatic controls with reference to automation of industrial machines and processes, including linear dynamic systems, feedback control, and elements of systems analysis. Introduction to digital control.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Integrated Production Systems II",
        "subjectCode": "IE",
        "courseCode": "48400",
        "instructor": [
            "Shimon Y Nof"
        ],
        "description": "Extensions of topics on the design and operational control of integrated production systems. Includes production databases, facility layout, material handling, advanced control and scheduling, and physical distribution. Case studies, lab assignments, and projects.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Work Analysis And Design II",
        "subjectCode": "IE",
        "courseCode": "48600",
        "instructor": [
            "Anika Jannat Rimu"
        ],
        "description": "Continuation of IE 38600. Applications of engineering, computer sciences, information sciences, and psychological principles and methods to the analysis and design of human work systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Healthcare Delivery Systems",
        "subjectCode": "IE",
        "courseCode": "52500",
        "instructor": [
            "Yuehwern Yih"
        ],
        "description": "This course is to introduce the interconnected sectors in the complex U.S. healthcare delivery systems, including in-patient care, emergency departments, surgical services, out-patient clinics, long-term care, pharmacies, laboratories, as well as supporting industries such as insurance, food services, information technologies, etc. The course focuses on the management of healthcare services by the industrial engineering principles and quantitative decision-making methodologies.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Quality Control",
        "subjectCode": "IE",
        "courseCode": "53000",
        "instructor": [
            "Nagabhushana Prabhu",
            "Lucky Cho"
        ],
        "description": "Principles and practices of statistical quality control in industry. Control charts for measurements and for attributes. Acceptance sampling by attributes and by measurements. Standard sampling plans. Sequential analysis. Sampling inspection of continuous production.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Linear Programming",
        "subjectCode": "IE",
        "courseCode": "53500",
        "instructor": [
            "Lu Liu"
        ],
        "description": "Optimization of linear objective functions subject to linear constraints. Development of theory and algorithmic strategies for solving linear programming problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Engineering Economic Analysis",
        "subjectCode": "IE",
        "courseCode": "54500",
        "instructor": [
            "David R Johnson"
        ],
        "description": "Analysis of engineering costs and capital investments. Applications of classical optimization, mathematical programming, and the theory of production to the analysis of investment proposals. Evaluation and selection of individual projects and formulation of capital investment programs. Typically offered Fall.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Convex Optimization",
        "subjectCode": "IE",
        "courseCode": "56100",
        "instructor": [
            "Gesualdo Scutari"
        ],
        "description": "(AAE 56100) Introduction to convex analysis, convex optimization problems, algorithms of convex optimization and measures of their complexity, and application of convex optimization in aerospace engineering. Recognition of convex optimization problems that arise in scientific and engineering applications. Introduction to software tools to solve convex optimization problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Manufacturing Process Engineering",
        "subjectCode": "IE",
        "courseCode": "57000",
        "instructor": [
            "Srinivasan Chandrasekar"
        ],
        "description": "Theories and applications of materials forming and removal processes in manufacturing, including product properties, process capabilities, processing equipment design, and economics. A systems approach to all aspects of manufacturing process engineering.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Human Factors In Engineering",
        "subjectCode": "IE",
        "courseCode": "57700",
        "instructor": [
            "Robert W Proctor"
        ],
        "description": "(PSY 57700) Survey of human factors in engineering with particular reference to human functions in human-machine systems, and consideration of human abilities and limitations in relation to design of equipment and work environments.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Applied Ergonomics",
        "subjectCode": "IE",
        "courseCode": "57800",
        "instructor": [
            "Vincent G Duffy"
        ],
        "description": "Analysis, modeling, and design of jobs and systems to be consistent with human factors and ergonomic principles.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Design And Control Of Production And Manufacturing Systems",
        "subjectCode": "IE",
        "courseCode": "57900",
        "instructor": [
            "Shimon Y Nof"
        ],
        "description": "Design and control of discrete part manufacturing systems in contemporary production environments, with emphasis on flexible, demand-driven, product-based manufacturing. Currently used planning and control methodologies, such as MRP, OPT, and JIT are reviewed and integrated with appropriate facility design methodologies, including cellular design algorithms. Introduction to Computer Integrated Manufacturing (CIM) architecture and reference models and relevant control procedures, including basis approaches to appropriate data management methodologies.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Systems Simulation",
        "subjectCode": "IE",
        "courseCode": "58000",
        "instructor": [
            "Lucky Cho"
        ],
        "description": "Philosophy and elements of digital simulation language. Practical application of simulation to diverse systems. Computer simulation exercises and applications are required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Assistive Technology Practice",
        "subjectCode": "IE",
        "courseCode": "59000",
        "instructor": [
            "Brandon J Pitts",
            "Nga Hin Benjamin Fong",
            "Ana Maria Estrada Gomez",
            "Jason Christian Reinhardt",
            "Salim Abed Semssar",
            "Wenzhuo Wu",
            "Nagabhushana Prabhu",
            "Bradley S Duerstock",
            "Stephan Robert Biller"
        ],
        "description": "Selected topics in industrial engineering for seniors and graduate students. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Multiple Objective Optimization",
        "subjectCode": "IE",
        "courseCode": "63000",
        "instructor": [
            "Susan R Hunter"
        ],
        "description": "Theory and applications of multiple objective optimization and multiple criteria decision making. Existence and specification of single and multiple attributive value and utility functions. Risk aversion. Characterization and generation of efficient (Pareto optimal) solutions to vector optimization problems. Domination cones. Interactive algorithms. Prerequisite: IE 53500.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Scheduling Models",
        "subjectCode": "IE",
        "courseCode": "63200",
        "instructor": [
            "Vaneet Aggarwal"
        ],
        "description": "Development and discussion of mathematical and simulation models for scheduling and sequencing the flow of jobs or activities in manufacturing environments. Techniques include dynamic programming, branch and bound, linear and integer programming, heuristics and stochastic network simulation. Prerequisite: IE 57900; IE 53500 or 53700.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Advanced Decision Theory",
        "subjectCode": "IE",
        "courseCode": "64600",
        "instructor": [
            "Mark R Lehto"
        ],
        "description": "An advanced course on the theory and models of decision-making and rationality. Material includes advanced topics in decision analysis, models of probabilistic reasoning, decision-making in competitive situations, and models of human and computer reasoning (including artificial intelligence). Prerequisite: IE 54600.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Advanced Manufacturing",
        "subjectCode": "IE",
        "courseCode": "67000",
        "instructor": [
            "Gary J Cheng"
        ],
        "description": "Advanced research topics and approaches in manufacturing engineering, including processes and equipment. Research methodology, nontraditional processes, manufacturing systems, and competitive aspects of manufacturing. Prerequisite: IE 57000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Reinforcement Learn & Control",
        "subjectCode": "IE",
        "courseCode": "69000",
        "instructor": [
            "Sivaranjani Seetharaman",
            "Mario Ventresca"
        ],
        "description": "Advanced study in various fields of industrial engineering for graduate students. Credits and hours to be arranged.  Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Seminar",
        "subjectCode": "IE",
        "courseCode": "69700",
        "instructor": [
            "Ana Maria Estrada Gomez"
        ],
        "description": "Industrial engineering problems with particular emphasis on current research.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2023"
    }
]