[
    {
        "title": "Survey Of Landscape Architecture",
        "subjectCode": "LA",
        "courseCode": "10110",
        "instructor": [
            "Sean Michael Rotar"
        ],
        "description": "An overview of landscape architecture, this course provides students with their first introduction to the knowledge areas, skills, and abilities that form the foundation of the landscape architecture profession. The course offers a preview of the discipline for pre-landscape architecture and horticulture students while also providing general information for students across campus who have an interest in becoming familiar with landscape architecture.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Graphic Communication In Design I",
        "subjectCode": "LA",
        "courseCode": "11600",
        "instructor": [
            "Erin M Percevault"
        ],
        "description": "A foundational course that covers a broad spectrum of hand-graphic communication techniques fundamental to landscape design including hand-drafting, sketching, architectural lettering, conceptual graphics, illustrative rendering, technical drawing, and drawing to scale. A series of short studio exercises will foster three-dimensional thinking and associated drawing methods. Materials used are purchased by the student.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Graphic Communication In Design II",
        "subjectCode": "LA",
        "courseCode": "11700",
        "instructor": [
            "David Michael Barbarash"
        ],
        "description": "A course in graphic communication theory focusing on digital skills and processes. Project-based instruction will be used to simulate design office procedures through 2D and 3D exercises using raster and vector software.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Land And Society",
        "subjectCode": "LA",
        "courseCode": "16100",
        "instructor": [
            "Sean Michael Rotar"
        ],
        "description": "An introduction to human interaction with the landscape with emphasis on the science of ecology and the technological advancements that form the response to contemporary social and environmental issues. Specific topics include: shifting cultural views of nature, climate change, land development patterns, green infrastructure and building technologies, and the role of design in shaping responses.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Professional Practice Of Landscape Architecture",
        "subjectCode": "LA",
        "courseCode": "47600",
        "instructor": [
            "Erin M Percevault"
        ],
        "description": "A study of the principles and practice of landscape architecture in private and public offices. The course covers project acquisition, office management, and project implementation procedures. Preparation of a professional compendium is required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Research Methods For Design Applications",
        "subjectCode": "LA",
        "courseCode": "50100",
        "instructor": [
            "Aaron W Thompson"
        ],
        "description": "The growing need for understanding the role of individuals, communities, and society in shaping the natural environment has led to a greater emphasis on landscape architectural research and the need to provide training in the research methods to support these efforts. It is an exciting time to enter this arena as landscape architects are collaborating with natural and social scientist to achieve better conservation outcomes, promote sustainable behaviors, and increase awareness and understanding of the complex environmental challenges facing our society. Non-Landscape Architecture students may gain enrollment with permission of instructor.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    }
]