[
    {
        "title": "Quechua Level I",
        "subjectCode": "LC",
        "courseCode": "10100",
        "instructor": [
            "Elena E Benedicto"
        ],
        "description": "Special topics in Foreign Languages. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Arabic Culture",
        "subjectCode": "LC",
        "courseCode": "23000",
        "instructor": [
            "Ahmed Idrissi Alami"
        ],
        "description": "(CMPL 23000) Foundations for comparison of works in different languages, thematic (philosophical, sociological, psychological) and structural (genre, composition, use of linguistic devices); parallel interrelation of theme and structure in works of different literatures. The importance of literary norms and systems of genres. Examination of crosscurrents in different literatures during successive periods of development.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Our Common Bond: Languages And Cultures In A Global Context",
        "subjectCode": "LC",
        "courseCode": "23700",
        "instructor": [
            "Elena Coda"
        ],
        "description": "(CMPL 23700) Students learn what lies behind the concept of Liberal Arts: the capabilities, insights and skills of individuals who think critically and freely. It exposes students from across the university to the ideas, skill-set and inspiration that emanates from the liberal arts. They will be introduced to the discipline of Comparative Literature by examining the specific roles that languages and cultures play in the globalized world. The course also demonstrates how a Language and Cultures degree will put students at a greater advantage in career opportunities.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To The Linguistic Study Of Foreign Languages",
        "subjectCode": "LC",
        "courseCode": "26100",
        "instructor": [
            "Yue Li",
            "Eunice Opoku",
            "Edier Gomez Alzate",
            "Vanessa Sheu",
            "Leah Michelle Nodar"
        ],
        "description": "Overview of linguistics and the role of language in society; fundamental concepts of linguistic analysis. The course focuses on linguistic phenomena found in French, German, Russian, and Spanish, with material, examples, and assignments drawn primarily from those languages whenever appropriate.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Intro To Global Cuisines",
        "subjectCode": "LC",
        "courseCode": "28000",
        "instructor": [
            "Elsayed Sabry Abdelaal Issa",
            "Cecilia I Tenorio"
        ],
        "description": "Special topics relating to world languages and cultures.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Sound And Form In Language",
        "subjectCode": "LC",
        "courseCode": "36100",
        "instructor": [
            "Yuhyeon Seo"
        ],
        "description": "Examination of the nature of sound systems (phonology) and form systems (morphology) of language, as well as techniques of phonological and morphological analysis, using material from various languages. Central focus on phonetic and phonological structure, and on inflectional and derivational morphology.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Sociolinguistic Study Of African American English",
        "subjectCode": "LC",
        "courseCode": "36800",
        "instructor": [
            "Felicia D Roberts"
        ],
        "description": "A study of the history, structure, uses, and educational concerns of African American English in African American speech communities and the U.S. culture at large.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Phonetics Of Foreign Languages",
        "subjectCode": "LC",
        "courseCode": "37100",
        "instructor": [
            "Alexander L Francis"
        ],
        "description": "Introduction to articulatory phonetics for students of foreign languages. Mechanisms of production of speech sounds. Production and discrimination of sounds of other languages; contrast with English sounds; practice in pronunciation and phonetic transcription. Introduction to the International Phonetic Alphabet (IPA). Credit will not be awarded for more than one of SLHS 30600, LING 31500, and LC 37100.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Teaching Of Foreign Languages",
        "subjectCode": "LC",
        "courseCode": "51900",
        "instructor": [
            "Colleen A Neary-Sundquist"
        ],
        "description": "A basic course designed to provide a forum for ideas connecting theory and research to teaching practice. Explores issues related to how learning and teaching can be enhanced and presents ideas that can be implemented in the classroom. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Modern Arab Thought",
        "subjectCode": "LC",
        "courseCode": "59300",
        "instructor": [
            "Ahmed Idrissi Alami",
            "Beate I Allert"
        ],
        "description": "Special topics in Literature. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Fundamentals Of Morphology",
        "subjectCode": "LC",
        "courseCode": "59600",
        "instructor": [
            "Yan Cong",
            "Robert Channon"
        ],
        "description": "Special topics in Linguistics. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Comparative Literature: Function And Methods",
        "subjectCode": "LC",
        "courseCode": "63000",
        "instructor": [
            "Jennifer M William"
        ],
        "description": "(CMPL 63000) An introduction to methods, problems, and the bibliographical tools pertaining to comparative study. Required of all students in the Comparative Literature Program.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Classroom SLA",
        "subjectCode": "LC",
        "courseCode": "67900",
        "instructor": [
            "Mariko M Wei"
        ],
        "description": "Advanced study and research on a significant topic in linguistics. Topic to be announced in advance. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    }
]