[
    {
        "title": "Mathematics As A Profession And A Discipline",
        "subjectCode": "MA",
        "courseCode": "10800",
        "instructor": [
            "Rachael H Kenney"
        ],
        "description": "A seminar course for undergraduate students interested in majoring in an area of mathematics at Purdue. The purpose is to build prospective mathematics majors' awareness of opportunities to enhance their experiences at Purdue and of career paths available for graduates with a good mathematical background. The format of most classes is a  presentation and discussion with an invited speaker/guest, including experts on a different aspect of mathematics in our world today. This course is recommended for undergraduates in their first or second year at Purdue.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Mathematics For Elementary Teachers I",
        "subjectCode": "MA",
        "courseCode": "13700",
        "instructor": [
            "Jennifer Michelle Fitch",
            "Nicolas Alexander Bridges",
            "Brooke M Max"
        ],
        "description": "Designed for prospective elementary school teachers. Problem solving. Numerical reasoning including self-generated and conventional algorithms. Whole and fractional number systems, elementary number theory. (Not available for credit toward graduation in the College of Science.)",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Mathematics For Elementary Teachers II",
        "subjectCode": "MA",
        "courseCode": "13800",
        "instructor": [
            "Jennifer Michelle Fitch"
        ],
        "description": "Elementary school teachers must understand how multiplication gives rise to exponents and how to represent, interpret, and compute exponents from problem situations. They must also understand how to represent practical situations using algebraic and fractional expressions, and verbally interpret graphs of functions. They have to know basic concepts of probability theory. This course covers conceptual and practical notions of exponents and radicals; algebraic and rational functions, algebraic equations and inequalities, systems of linear equations, polynomial, exponential, and logarithmic functions. Notions of probability.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Mathematics For Elementary Teachers III",
        "subjectCode": "MA",
        "courseCode": "13900",
        "instructor": [
            "Brooke M Max"
        ],
        "description": "Geometric, measurement and spatial reasoning in one, two and three dimensions as the basis for elementary school geometry. Metric and non-metric geometry, transformation geometry. (Not available for credit toward graduation in the College of Science.)",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "College Algebra",
        "subjectCode": "MA",
        "courseCode": "15300",
        "instructor": [
            "Hannah K Linzy",
            "Devin William Stetler",
            "Samantha Allien DePoy",
            "Patrick M Devlin",
            "Samuel Matthew Bogner",
            "Zachary David Herbon",
            "Eric Louis Aull",
            "Jeffrey Logan Hart",
            "Emily Alexandra Johnson"
        ],
        "description": "Exponents and radicals; algebraic and fractional expressions. Equations and inequalities, systems of linear equations. Polynomial, exponential, and logarithmic functions.  Not open to students with credit in MA 15900. Not available for credit toward graduation in the School of Science. CTL:IMA 1601 College Algebra",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Quantitative Reasoning",
        "subjectCode": "MA",
        "courseCode": "15555",
        "instructor": [
            "Timothy J Delworth"
        ],
        "description": "This course will cover important mathematical ideas, including proportion, weighted averages, linear models, exponential models, basic probability and statistics, and some algebra, by using concrete real-world problems. It will not be a prerequisite for any other mathematics course. CTL: Quantitative Reasoning",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Precalculus",
        "subjectCode": "MA",
        "courseCode": "15800",
        "instructor": [
            "April Isom-Tyler",
            "Allan Edward Bickle",
            "Keenan Arthur Estese",
            "Alejandro Cano",
            "Timothy J Delworth",
            "Jerry D Porter",
            "Daphne Ariel Goodwin",
            "Sarah Elizabeth Anderson",
            "John Clement Treacy",
            "Heather R Krebs",
            "Andrea F Barber-Dansby",
            "Patrick James Carper",
            "Tyler Joseph Dunaisky",
            "Brooke E Hejnal",
            "Jill Danielle Shalabi"
        ],
        "description": "Functions, Trigonometry, and Algebra of calculus topics designed to fully prepare students for all first semester calculus courses. Functions topics include Quadratic, Higher Order Polynomials, Rational, Exponential, Logarithmic, and Trigonometric. Other focuses include graphing of functions and solving application problems. Not Available for credit toward graduation in the College of Science. Students may not receive credit for both MA 15400 and MA 15800. Students may not receive credit for both MA 15900 and MA 15800.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Applied Calculus I",
        "subjectCode": "MA",
        "courseCode": "16010",
        "instructor": [
            "Rebekah C Chase",
            "Estepan Kirakos Ashkarian",
            "Benjamin Joel Lackey Mudrak",
            "April Isom-Tyler",
            "Can Cui",
            "Heather R Krebs",
            "Julia Anne Garner",
            "Jelena Mojsilovic",
            "Jack Anthony Weiland",
            "Franz Carlos Stoll Quevedo",
            "Ying Chen",
            "Connor Mack Thompson",
            "Ethan Thomas Kessinger",
            "Allan Edward Bickle",
            "Samuel J Oconnor",
            "Chi-Heng Lo",
            "Susitha Hapuarachchige Karunaratne",
            "Steven R Lancette",
            "Nicholas Dominic Gismondi",
            "Shaver L Phagan",
            "Rafael Ceja Ayala"
        ],
        "description": "Topics include trigonometric and exponential functions; limits and differentiation, rules of differentiation, maxima, minima and optimization; curve sketching, integration, anti-derivatives, fundamental theorem of calculus. Properties of definite integrals and numerical methods. Applications to life, managerial and social sciences. CTL:IMA 1604 Calculus - Short I",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Applied Calculus II",
        "subjectCode": "MA",
        "courseCode": "16020",
        "instructor": [
            "Alexandra Cuadra",
            "April Isom-Tyler",
            "Jakayla R Robbins",
            "Jerry D Porter",
            "Benjamin Allen Doyle",
            "Patrick Yenruh Chu",
            "Joseph D Kintzel",
            "Victor Giovanni Hughes",
            "Brian K Cheek",
            "Nathan H Schiefer"
        ],
        "description": "This course covers techniques of integration; infinite series, convergence tests; differentiation and integration of functions of several variables; maxima and minima, optimization; differential equations and initial value problems; matrices, determinants, eigenvalues and eigenvectors. Applications. CTL:IMA 1605 Calculus - Short II",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Plane Analytic Geometry And Calculus I",
        "subjectCode": "MA",
        "courseCode": "16100",
        "instructor": [
            "Mahesh Sunkula"
        ],
        "description": "Introduction to differential and integral calculus of one variable, with applications. Some schools or departments may allow only 4 credit hours toward graduation for this course. Designed for students who have not had at least a one-semester calculus course in high school, with a grade of \"A\" or \"B\". Not open to students with credit in MA 16500. Demonstrated competence in college algebra and trigonometry.",
        "capacity": 0,
        "credits": [
            5,
            5
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Plane Analytic Geometry And Calculus II",
        "subjectCode": "MA",
        "courseCode": "16200",
        "instructor": [
            "Kuan-Hua J Chen",
            "Andrei Gabrielov"
        ],
        "description": "Continuation of MA 16100. Vectors in two and three dimensions, techniques of integration, infinite series, conic sections, polar coordinates, surfaces in three dimensions. Some schools or departments may allow only 4 credit hours toward graduation for this course.",
        "capacity": 0,
        "credits": [
            5,
            5
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Analytic Geometry And Calculus I",
        "subjectCode": "MA",
        "courseCode": "16500",
        "instructor": [
            "Shuyi Weng",
            "Kenji Matsuki",
            "Sai Kee Yeung"
        ],
        "description": "Introduction to differential and integral calculus of one variable, with applications. Conic sections. Designed for students who have had at least a one-semester calculus course in high school, with a grade of \"A\" or \"B\", but are not qualified to enter MA 16200 or 16600, or the advanced placement courses MA 27100. Demonstrated competence in college algebra and trigonometry. CTL:IMA 1602 Calculus - Long I",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Actuarial Science",
        "subjectCode": "MA",
        "courseCode": "17000",
        "instructor": [
            "Daniel E Rubin"
        ],
        "description": "(STAT 17000) An introduction to actuarial science from the point of view of practicing actuaries from life insurance, casualty insurance and consulting; introduction to insurance and the mathematical theory of interest; application of spreadsheets to problems related to actuarial science.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Multivariate Calculus",
        "subjectCode": "MA",
        "courseCode": "26100",
        "instructor": [
            "Kaitlyn T Hood",
            "Daniel Lentine Johnstone",
            "Andrey Glubokov"
        ],
        "description": "Planes, lines, and curves in three dimensions. Differential calculus of several variables; multiple integrals. Introduction to vector calculus. Not open to students with credit in MA 27100.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Linear Algebra And Differential Equations",
        "subjectCode": "MA",
        "courseCode": "26200",
        "instructor": [
            "Antonio C Sa Barreto",
            "Yiran Liu",
            "Peijun Li",
            "Min Chen"
        ],
        "description": "Linear algebra, elements of differential equations. Not open to students with credit in MA 26500 or 26600.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Linear Algebra",
        "subjectCode": "MA",
        "courseCode": "26500",
        "instructor": [
            "Takumi Murayama",
            "Yilong Zhang",
            "Jing Wang",
            "Sam Nariman",
            "Yiran Wang",
            "Siamak Yassemi",
            "Raymond Leonard Polak",
            "Vaibhav Pandey",
            "Farrah Christina Yhee",
            "Ying Zhang",
            "Yi Wang",
            "Anurag Sahay",
            "Jonathon R Peterson"
        ],
        "description": "Introduction to linear algebra. Systems of linear equations, matrix algebra, vector spaces, determinants, eigenvalues and eigenvectors, diagonalization of matrices, applications. Not open to students with credit in MA 26200, 27200, 35000 or 35100.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Ordinary Differential Equations",
        "subjectCode": "MA",
        "courseCode": "26600",
        "instructor": [
            "Ping Xu",
            "Jakayla R Robbins",
            "Heejong Lee",
            "Jiahao Zhang",
            "Guang Yang",
            "Christian James Noack",
            "Shuyi Weng",
            "Gayane Poghotanyan",
            "Krishnendu Khan",
            "Arun Albert Debray",
            "Xingshan Cui"
        ],
        "description": "First order equations, second and n'th order linear equations, series solutions, solution by Laplace transform, systems of linear equations. It is preferable but not required to take MA 26500 either first or concurrently. Not open to students with credit in MA 26200, 27200, 36000, 36100, or 36600.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Honors Multivariate Calculus",
        "subjectCode": "MA",
        "courseCode": "27101",
        "instructor": [
            "Hans U Walther"
        ],
        "description": "This course is the Honors version of MA 26100, Multivariate Calculus; it will also include a review of infinite series. The course is intended for first-year students who have credit for Calculus I and II. There will be a significant emphasis on conceptual explanation, but not on formal proof. Permission of department is required.",
        "capacity": 0,
        "credits": [
            5,
            5
        ],
        "term": "Fall 2023"
    },
    {
        "title": "An Introduction To Proof Through Real Analysis",
        "subjectCode": "MA",
        "courseCode": "30100",
        "instructor": [
            "Giulio Caviglia"
        ],
        "description": "An introduction to abstract reasoning in the context of real analysis. Topics may include axioms for the real numbers, mathematical induction, formal definition of limits, density, decimal representations, convergence of sequences and series, continuity, differentiability, the extreme value, mean value and intermediate value theorems, and cardinality. The emphasis, however, is more on the concept of proof than on any one given topic.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Differential Equations And Partial Differential Equations For Engineering And The Sciences",
        "subjectCode": "MA",
        "courseCode": "30300",
        "instructor": [
            "Ning Wei",
            "Heejin Lee",
            "Guang Lin",
            "Ayan Maiti",
            "Chen Liu",
            "Michelle Michelle",
            "Moongyu Park",
            "Ying Liang"
        ],
        "description": "This is a methods course for juniors in any branch of engineering and science, designed to follow MA 26200 or MA 26600. Materials to be covered are: linear systems of ordinary differential equations, nonlinear systems, Fourier series, separation of variables for partial differential equations, and Sturm-Liouville theory.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Foundations Of Analysis",
        "subjectCode": "MA",
        "courseCode": "34100",
        "instructor": [
            "Isaac Harris",
            "Yuan Gao",
            "Marius D Dadarlat",
            "Philip P Mummert"
        ],
        "description": "An introductory course in rigorous analysis, covering real numbers, sequences, series, continuous functions, differentiation, and Riemann integration. MA 30100 is helpful but not required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Elementary Linear Algebra",
        "subjectCode": "MA",
        "courseCode": "35100",
        "instructor": [
            "Xiangxiong Zhang",
            "Margaret E M Thomas",
            "Rolando De santiago",
            "Lyuzhou Chen"
        ],
        "description": "Systems of linear equations, finite dimensional vector spaces, matrices, determinants, eigenvalues and eigenvector applications to analytical geometry. Not open to students with credit in MA 26500.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Linear Algebra II",
        "subjectCode": "MA",
        "courseCode": "35301",
        "instructor": [
            "Thomas J Sinclair",
            "James E Mcclure"
        ],
        "description": "Theoretical background for methods and results that appear in MA 35100. Inner products, orthogonality, and applications including least squares.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Topics In Vector Calculus",
        "subjectCode": "MA",
        "courseCode": "36200",
        "instructor": [
            "Donu V B Arapura"
        ],
        "description": "Multivariate calculus; partial differentiation; implicit function theorems and transformations; line and surface integrals; vector fields; theorems of Gauss, Green, and Stokes. Credit granted for only one of MA 36200 and 51000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Ordinary Differential Equations",
        "subjectCode": "MA",
        "courseCode": "36600",
        "instructor": [
            "Johnny E Brown",
            "Monica Torres",
            "Matthew Dominick Novack"
        ],
        "description": "An introduction to ordinary differential equations with emphasis on problem solving and applications. The one-hour computer lab will give students an opportunity for hands-on experience with both the theory and applications of the subject.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Financial Mathematics",
        "subjectCode": "MA",
        "courseCode": "37300",
        "instructor": [
            "Sally Anne Ray"
        ],
        "description": "A mathematical treatment of some fundamental concepts of financial mathematics and their application to real world business situations and basic risk management. Includes discussions of valuing investments, capital budgeting, valuing contingent cash flows, yield curves, spot rates, forward rates, short sales, Macaulay duration, modified duration, convexity, and immunization. Provides preparation for the SOA/CAS Actuarial Exam FM/2.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Discrete Mathematics",
        "subjectCode": "MA",
        "courseCode": "37500",
        "instructor": [
            "Philip P Mummert"
        ],
        "description": "Induction, permutations, combinations, finite probability, relations, graphs, trees, graph algorithms, recurrence relations, generating functions. Problem solving in all these areas. Credit granted for only one of MA 27600 and 37500.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Probability",
        "subjectCode": "MA",
        "courseCode": "41600",
        "instructor": [
            "Mireille Boutin",
            "Christian James Noack",
            "Nianqiao Ju",
            "Christopher Janjigian",
            "Thomas M Sellke"
        ],
        "description": "(STAT 41600) An introduction to mathematical probability suitable as a preparation for actuarial science, statistical theory, and mathematical modeling. General probability rules, conditional probability and Bayes theorem, discrete and continuous random variables, moments and moment generating functions, joint and conditional distributions, standard discrete and continuous distributions and their properties, law of large numbers and central limit theorem.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Elements Of Complex Analysis",
        "subjectCode": "MA",
        "courseCode": "42500",
        "instructor": [
            "Kiril Datchev"
        ],
        "description": "Complex numbers and complex-valued functions; differentiation of complex functions; power series, uniform convergence; integration, contour integrals; elementary conformal mapping.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Honors Real Analysis I",
        "subjectCode": "MA",
        "courseCode": "44000",
        "instructor": [
            "Rolando De santiago"
        ],
        "description": "Real analysis in one and n-dimensional Euclidean spaces. Topics include the completeness property of real numbers, topology of Euclidean spaces, Heine-Borel theorem, convergence of sequences and series in Euclidean spaces, limit superior and limit inferior, Bolzano-Weierstrass theorem, continuity, uniform continuity, limits and uniform convergence of functions, Riemann or Riemann-Stieltjes integrals.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Algebra Honors",
        "subjectCode": "MA",
        "courseCode": "45000",
        "instructor": [
            "Tong Liu"
        ],
        "description": "This course, which is essentially the first half of MA 55300, is recommended for students wanting a more substantial background in algebra than is afforded by MA 45300, in particular students intending to do graduate work in science or engineering. Topics include the elements of number theory and group theory; unique factorization in polynomial rings and in principal ideal domains.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Elements Of Algebra I",
        "subjectCode": "MA",
        "courseCode": "45300",
        "instructor": [
            "Saugata Basu",
            "David B Mcreynolds",
            "Baiying Liu"
        ],
        "description": "Fundamental properties of integers, polynomials, groups, rings, and fields, with emphasis on problem solving and applications. Not open to students with credit in MA 45000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Geometry",
        "subjectCode": "MA",
        "courseCode": "46000",
        "instructor": [
            "David Goldberg"
        ],
        "description": "This course begins at the high-school level and then moves quickly to intermediate and advanced topics including an introduction to non-Euclidean geometry. Emphasis on proofs.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Actuarial Models-Life Contingencies",
        "subjectCode": "MA",
        "courseCode": "47201",
        "instructor": [
            "Sally Anne Ray"
        ],
        "description": "Mathematical foundation of actuarial science, emphasizing probability models for life contingencies as the basis for analyzing life insurance and life annuities and determining premiums and reserves. This course provides the background for Course MLC of the Society of Actuaries and Course 3L of the Casualty Actuarial Society.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Advanced Problem-Solving Seminar",
        "subjectCode": "MA",
        "courseCode": "48100",
        "instructor": [
            "Victor D Lie"
        ],
        "description": "Seminar intended to prepare students for the national Putnam examination in mathematics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Seminar On Teaching College Algebra And Trigonometry",
        "subjectCode": "MA",
        "courseCode": "48400",
        "instructor": [
            "Rachael H Kenney"
        ],
        "description": "This course is a seminar on the teaching of mathematics for our best undergraduate mathematics education students. It provides supervised teaching experience along with a chance for the students to perfect their knowledge of algebra before going on to be high school teachers. Students who take this class will also teach a section of MA 15300. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Adv Short Term Actuarial Math",
        "subjectCode": "MA",
        "courseCode": "49000",
        "instructor": [
            "TBA"
        ],
        "description": "Supervised reading courses as well as special topics courses for undergraduates are given under this number. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Fall 2023"
    },
    {
        "title": "From Groups To Geometry & Back",
        "subjectCode": "MA",
        "courseCode": "49500",
        "instructor": [
            "Sam Nariman",
            "Trevor Dion Wooley"
        ],
        "description": "  Advanced topics courses in mathematics for undergraduates are given under this number. Permission of instructor required. ",
        "capacity": 0,
        "credits": [
            1,
            5
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Abstract Algebra",
        "subjectCode": "MA",
        "courseCode": "50300",
        "instructor": [
            "Tong Liu"
        ],
        "description": "Group theory: definitions, examples, subgroups, quotient groups, homomorphisms, and isomorphism theorems. Ring theory: definitions, examples, homomorphisms, ideals, quotient rings, fraction fields, polynomial rings, Euclidean domains, and unique factorization domains. Field theory: algebraic field extensions, straightedge and compass constructions.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Real Analysis",
        "subjectCode": "MA",
        "courseCode": "50400",
        "instructor": [
            "Monica Torres"
        ],
        "description": "Completeness of the real number system, basic topological properties, compactness, sequences and series, absolute convergence of series, rearrangement of series, properties of continuous functions, the Riemann-Stieltjes integral, sequences and series of functions, uniform convergence, the Stone-Weierstrass theorem, equicontinuity, and the Arzela-Ascoli theorem.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Linear Algebra With Applications",
        "subjectCode": "MA",
        "courseCode": "51100",
        "instructor": [
            "Nung Kwan Yip"
        ],
        "description": "Real and complex vector spaces; linear transformations; Gram-Schmidt process and projections; least squares; QR and LU factorization; diagonalization, real and complex spectral theorem; Schur triangular form; Jordan canonical form; quadratic forms.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Numerical Analysis",
        "subjectCode": "MA",
        "courseCode": "51400",
        "instructor": [
            "Suchuan Dong"
        ],
        "description": "(CS 51400) Iterative methods for solving nonlinear; linear difference equations, applications to solution of polynomial equations; differentiation and integration formulas; numerical solution of ordinary differential equations; roundoff error bounds.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Probability",
        "subjectCode": "MA",
        "courseCode": "51900",
        "instructor": [
            "Gregery T Buzzard",
            "Anirban Dasgupta"
        ],
        "description": "(STAT 51900) Algebra of sets, sample spaces, combinatorial problems, independence, random variables, distribution functions, moment generating functions, special continuous and discrete distributions, distribution of a function of a random variable, limit theorems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Partial Differential Equations",
        "subjectCode": "MA",
        "courseCode": "52300",
        "instructor": [
            "Arshak Petrosyan"
        ],
        "description": "First order quasi-linear equations and their applications to physical and social sciences; the Cauchy-Kovalevsky theorem; characteristics, classification and canonical forms of linear equations; equations of mathematical physics; study of Laplace, wave and heat equations; methods of solution.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Complex Analysis",
        "subjectCode": "MA",
        "courseCode": "52500",
        "instructor": [
            "Kiril Datchev"
        ],
        "description": "Complex numbers and complex-valued functions of one complex variable; differentiation and contour integration; Cauchy's theorem; Taylor and Laurent series; residues; conformal mapping; applications. Not open to students with credit in MA 42500.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Advanced Mathematics For Engineers And Physicists I",
        "subjectCode": "MA",
        "courseCode": "52700",
        "instructor": [
            "Erika Birgit Kaufmann"
        ],
        "description": "MA 52700 is not a prerequisite for MA 52800; these courses can be taken independently. Topics in MA 52700 include linear algebra, systems of ordinary differential equations, Laplace transforms, Fourier series and transforms, and partial differential equations. MA 51100 is recommended.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Functions Of A Complex Variable I",
        "subjectCode": "MA",
        "courseCode": "53000",
        "instructor": [
            "Steven R Bell"
        ],
        "description": "Complex numbers and complex-valued functions of one complex variable; differentiation and contour integration; Cauchy's theorem; Taylor and Laurent series; residues; conformal mapping; special topics. More mathematically rigorous than MA 52500.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Elements Of Stochastic Processes",
        "subjectCode": "MA",
        "courseCode": "53200",
        "instructor": [
            "Takashi Owada"
        ],
        "description": "(STAT 53200) A basic course in stochastic models, including discrete and continuous time Markov chains and Brownian motion, as well as an introduction to topics such as Gaussian processes, queues, epidemic models, branching processes, renewal processes, replacement, and reliability problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Probability Theory II",
        "subjectCode": "MA",
        "courseCode": "53900",
        "instructor": [
            "Rodrigo Banuelos"
        ],
        "description": "(STAT 53900) Convergence of probability laws; characteristic functions; convergence to the normal law; infinitely divisible and stable laws; Brownian motion and the invariance principle.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Real Analysis And Measure Theory",
        "subjectCode": "MA",
        "courseCode": "54400",
        "instructor": [
            "Jonathon R Peterson"
        ],
        "description": "Metric space topology; continuity, convergence; equicontinuity; compactness; bounded variation, Helly selection theorem; Riemann-Stieltjes integral; Lebesgue measure; abstract measure spaces; LP-spaces; Holder and Minkowski inequalities; Riesz-Fischer theorem.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Abstract Algebra",
        "subjectCode": "MA",
        "courseCode": "55300",
        "instructor": [
            "Freydoon Shahidi"
        ],
        "description": "Group theory: Sylow theorems, Jordan Hlder theorem, solvable groups. Ring theory: unique factorization in polynomial rings and principal ideal domains. Field theory: ruler and compass constructions, roots of unity, finite fields, Galois theory, solvability of equations by radicals.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Linear Algebra",
        "subjectCode": "MA",
        "courseCode": "55400",
        "instructor": [
            "Saugata Basu"
        ],
        "description": "Review of basics: vector spaces, dimension, linear maps, matrices determinants, linear equations. Bilinear forms; inner product spaces; spectral theory; eigenvalues. Modules over a principal ideal domain; finitely generated abelian groups; Jordan and rational canonical forms for a linear transformation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Abstract Algebra I",
        "subjectCode": "MA",
        "courseCode": "55700",
        "instructor": [
            "Giulio Caviglia"
        ],
        "description": "Review of fundamental structures of algebra (groups, rings, fields, modules, algebras); Jordan-Holder and Sylow theorems; Galois theory; bilinear forms; modules over principal ideal domains; Artinian rings and semisimple modules. Polynomial and power series rings; Noetherian rings and modules; localization; integral dependence; rudiments of algebraic geometry and algebraic number theory; ramification theory.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Differential Geometry And Topology",
        "subjectCode": "MA",
        "courseCode": "56200",
        "instructor": [
            "Manuel Luis Rivera"
        ],
        "description": "Smooth manifolds; tangent vectors; inverse and implicit function theorems; submanifolds; vector fields; integral curves; differential forms; the exterior derivative; DeRham cohomology groups; surfaces in E3., Gaussian curvature; two dimensional Riemannian geometry; Gauss-Bonnet and Poincare theorems on vector fields.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Elementary Topology",
        "subjectCode": "MA",
        "courseCode": "57100",
        "instructor": [
            "Ralph Martin Kaufmann"
        ],
        "description": "Fundamentals of point set topology with a brief introduction to the fundamental group and related topics, topological and metric spaces, compactness, connectedness, separation properties, local compactness, introduction to function spaces, basic notions involving deformations of continuous paths.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Algebraic Number Theory",
        "subjectCode": "MA",
        "courseCode": "58400",
        "instructor": [
            "Daniel Tuan-Dan Le"
        ],
        "description": "Dedekind domains, norm, discriminant, different, finiteness of class number, Dirichlet unit theorem, quadratic and cyclotomic extensions, quadratic reciprocity, decomposition and inertia groups, completions and local fields.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Neural Network Numerical PDEs",
        "subjectCode": "MA",
        "courseCode": "59500",
        "instructor": [
            "Trevor Dion Wooley",
            "Jaroslaw Wlodarczyk",
            "Sam Nariman",
            "Daniel Leyva",
            "Jeremy K Miller",
            "Di Qi",
            "Alexandros Kafkas",
            "Victor D Lie",
            "Oleksandr Tsymbaliuk",
            "Zhiqiang Cai"
        ],
        "description": "Special topics courses including dual-level special topics. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            5
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Commutative Algebra Seminar",
        "subjectCode": "MA",
        "courseCode": "59800",
        "instructor": [
            "Dominic J Naughton",
            "Takumi Murayama",
            "Rolando De santiago",
            "Daniel Tuan-Dan Le",
            "Kiril Datchev",
            "Christopher Janjigian",
            "Lyuzhou Chen",
            "Changyou Wang",
            "Marius D Dadarlat",
            "Erika Birgit Kaufmann",
            "Andrew S Toms",
            "Zhiqiang Cai",
            "Manuel Luis Rivera"
        ],
        "description": "Supervised reading courses as well as dual-level special topics courses are given under this number. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            5
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Methods Of Linear And Nonlinear Partial Differential Equations I",
        "subjectCode": "MA",
        "courseCode": "64200",
        "instructor": [
            "Changyou Wang"
        ],
        "description": "Second order elliptic equations including maximum principles, Harnack inequality, Schauder estimates, and Sobolev estimates. Applications of linear theory to nonlinear equations. Prerequisite: MA 52300.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Commutative Algebra",
        "subjectCode": "MA",
        "courseCode": "65000",
        "instructor": [
            "William J Heinzer"
        ],
        "description": "The study of those rings of importance in algebraic and analytic geometry and algebraic number theory. Prerequisite: MA 55800.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Matrix Methods For Data Sci",
        "subjectCode": "MA",
        "courseCode": "69200",
        "instructor": [
            "Jianlin Xia"
        ],
        "description": "Topics in applied math. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2023"
    }
]