[
    {
        "title": "Organic Chemistry II",
        "subjectCode": "MCMP",
        "courseCode": "20500",
        "instructor": [
            "Ryan Alan Altman"
        ],
        "description": "Continuation of MCMP 20400.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Basic Principles Of Chemical Action On Biological Systems",
        "subjectCode": "MCMP",
        "courseCode": "57000",
        "instructor": [
            "Rong Huang"
        ],
        "description": "Detailed description of modern pharmacology with emphasis on the mechanism of drug action and approaches used to understand their therapeutic and toxic effects. Topics include receptor theory and signal transduction, pharmacokinetics and pharmacogenetics with emphasis on current concepts in molecular pharmacology. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Grant Writing",
        "subjectCode": "MCMP",
        "courseCode": "62500",
        "instructor": [
            "Val J Watts"
        ],
        "description": "Strategies for preparation of grant proposals; generating ideas for proposals and peer review. Lecture and laboratory periods will alternate each week (i.e., lecture week one, laboratory week two). Permission of department required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Intro To Pharm Sci Research",
        "subjectCode": "MCMP",
        "courseCode": "69000",
        "instructor": [
            "Andy Hudmon",
            "Danzhou Yang"
        ],
        "description": "Special topics, projects, or laboratory exercises in selected areas of medicinal chemistry and molecular pharmacology. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            6
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Seminar In Medicinal Chemistry And Molecular Pharmacology",
        "subjectCode": "MCMP",
        "courseCode": "69600",
        "instructor": [
            "Daniel P Flaherty"
        ],
        "description": "Faculty and student participation in discussion of current research and developments in synthetic medicinal products, quality control, instrumentation, biosynthesis, and structure elucidation of natural products.",
        "capacity": 0,
        "credits": [
            0,
            1
        ],
        "term": "Fall 2023"
    }
]