[
    {
        "title": "PMEA Leadership Program",
        "subjectCode": "ME",
        "courseCode": "19800",
        "instructor": [
            "Beth J Hess"
        ],
        "description": "A weekly seminar that includes topics such as leadership, professional skills, teamwork, and the Mechanical Engineering culture.  Students will utilize these skills while representing Mechanical Engineering to current and prospective students, alumni, donors, and other visitors to the school.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Thermodynamics I",
        "subjectCode": "ME",
        "courseCode": "20000",
        "instructor": [
            "Richard O Buckius",
            "Jay P Gore",
            "Elizabeth M Holloway",
            "Haotian Liu",
            "Andrew J Fix",
            "Sameer V Naik",
            "Riley Bradley Barta",
            "Kevin James Kircher",
            "Jong Hyun Choi"
        ],
        "description": "First and second laws of thermodynamics, entropy, reversible and irreversible processes, properties of pure substances. Application to engineering problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Mechanical Engineering Design, Innovation And Entrepreneurship",
        "subjectCode": "ME",
        "courseCode": "26300",
        "instructor": [
            "Morgan D Murphy",
            "Francisco J Montalvo"
        ],
        "description": "The product design process. Development of product design specifications using customer inputs, benchmarking, product/market research and patent review. Concept generation and evaluation using brainstorming, functional decomposition, modeling and decision matrices. Detailed product design including assembly, economic analysis, CAD, and bill of materials. Oral and written design reviews. Key skills developed include teamwork, communication, project planning, innovation, design, and entrepreneurship.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Basic Mechanics I",
        "subjectCode": "ME",
        "courseCode": "27000",
        "instructor": [
            "Fabio Semperlotti",
            "Morgan D Murphy",
            "Satish C Boregowda",
            "Vahidullah Tac",
            "James D Jones",
            "Tianhong Han"
        ],
        "description": "Vector operations, forces and couples. Free body diagrams, equilibrium of a particle and of rigid bodies. Distributed forces. Centers of gravity and centroids. Friction. Trusses, frames, and machines. Internal reactions resulting from axial, shear, torsional, and bending loading. Stress and strain analyses and elementary failure criteria.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Basic Mechanics II",
        "subjectCode": "ME",
        "courseCode": "27400",
        "instructor": [
            "Luz Del Rosario Sotelo",
            "Patricia Davies"
        ],
        "description": "Review and extension of particle motion to include energy and momentum principles. Planar kinematics of rigid bodies. Kinetics for planar motion of rigid bodies, including equations of motion and principles of energy and momentum. Three-dimensional kinematics and kinetics of rigid bodies. Linear vibrations, with emphasis on single-degree-of-freedom systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Global Engineering Professional Seminar",
        "subjectCode": "ME",
        "courseCode": "29000",
        "instructor": [
            "Beth J Hess"
        ],
        "description": "Forum on contemporary issues in the global profession of mechanical engineering. Professionalism and ethics. Interactions with engineering faculty and with professionals outside the University. Quizzes on assigned readings in the areas of globalization, cultural difference and collaborating across cultural boundaries. Individually developed professional profiles describe technical interests and convey awareness of ethical responsibilities in global context.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "ME Soph Sem Peer Mentor Prog",
        "subjectCode": "ME",
        "courseCode": "29700",
        "instructor": [
            "Beth J Hess",
            "Charles Gregory Jensen"
        ],
        "description": "Projects or special topics of contemporary importance can be studied under the Mechanical Engineering Projects course. Interested students should seek a faculty advisor by meeting with individual faculty members who work in their area of special interest. Students submit a summary report. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            6
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Thermodynamics II",
        "subjectCode": "ME",
        "courseCode": "30000",
        "instructor": [
            "Sameer V Naik",
            "Christopher S Goldenstein"
        ],
        "description": "Properties of gas mixtures, air-vapor mixtures, applications. Thermodynamics of combustion processes, equilibrium. Energy conversion, power, and refrigeration systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Fluid Mechanics",
        "subjectCode": "ME",
        "courseCode": "30800",
        "instructor": [
            "Guang Lin",
            "Carlo Scalo",
            "Izzet Sahin",
            "Brett A Meyers",
            "Carl R Wassgren",
            "Aaron B Morris"
        ],
        "description": "Continuum description, velocity field, fluid statics, manometers, basic conservation laws for systems and control volumes, dimensional analysis. Bernoulli's equation along a streamline and with head losses. Flow over submerged bodies, boundary layers. Viscous flows in pipes, turbomachinery, system performance. One-dimensional gas dynamics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Heat And Mass Transfer",
        "subjectCode": "ME",
        "courseCode": "31500",
        "instructor": [
            "Tiwei Wei",
            "Justin A Weibel",
            "Xiulin Ruan",
            "Thomas Edwin Beechem",
            "Devahdhanush Vijayaraju Swathibanu"
        ],
        "description": "Fundamentals of heat transfer by conduction, convection, and radiation; mass transfer by convection. Relevance to engineering applications.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Mechanics Of Materials",
        "subjectCode": "ME",
        "courseCode": "32300",
        "instructor": [
            "Charles M Krousgrill",
            "Alex Chortos",
            "Ryan B Wagner",
            "Shubhra Bansal",
            "Klod Kokini"
        ],
        "description": "Integrated approach to mechanics of materials emphasizing mechanics fundamentals as applied to machine design applications. Stress and strain in machine elements; mechanical properties of materials; extension, torsion, and bending of members; thermal stress; pressure vessels; static indeterminacy, stress transformation, Mohr's circle.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Machine Design",
        "subjectCode": "ME",
        "courseCode": "35400",
        "instructor": [
            "Beth J Hess",
            "Steven J Lorenz"
        ],
        "description": "Design, analysis, and selection of machine components for fluctuating loading. Application of design fundamentals to mechanical components and integration of components to form systems. Open-ended design projects reinforce the design process.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Principles And Practices Of Manufacturing Processes",
        "subjectCode": "ME",
        "courseCode": "36300",
        "instructor": [
            "Yung C Shin",
            "Benxin Wu"
        ],
        "description": "Manufacturing processes for engineering materials, both metallic and non-metallic. Fundamentals of manufacturing processes with a \"hands-on\" laboratory sequence. Analysis and design of processes for various engineering materials and their link to engineering design. Hands-on experiences through laboratory experiments and demonstrations. Not open to students with credit in IE 37000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Measurement And Control Systems I",
        "subjectCode": "ME",
        "courseCode": "36500",
        "instructor": [
            "Todd Daniel Lillian",
            "Euiwon Bae",
            "Junfei Li",
            "Xinyan Deng",
            "Bin Yao"
        ],
        "description": "The fundamentals of dynamic system modeling are reviewed with special reference to measurement systems. Analytical and experimental techniques of general importance in systems engineering are presented, including sensor utilization in feedback control. Engineering measurement fundamentals, including digital and frequency domain techniques noise and error analysis are covered.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Measurement And Control Systems II",
        "subjectCode": "ME",
        "courseCode": "37500",
        "instructor": [
            "Laura Helen Blumenschein",
            "Kartik B Ariyur"
        ],
        "description": "This course provides an introduction to modeling electrical, mechanical, fluid, and thermal systems containing elements such as sensors and actuators used in feedback control systems. Modeling techniques based on physical laws and principles are used to generate subsystem and system transfer functions. Closed-loop system analysis will include the use of proportional, integral, and derivative elements to control system response.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Principles Of Turbomachinery",
        "subjectCode": "ME",
        "courseCode": "43300",
        "instructor": [
            "Nicole L Key"
        ],
        "description": "Unified treatment of principles underlying fluid mechanic design of hydraulic pumps, turbines and gas compressors. Similarity and scaling laws. Cavitation. Analysis of radial and axial flow machines. Blade element performance. Radial equilibrium theory. Centrifugal pump design. Axial compressor design.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Computer-Aided Design And Prototyping",
        "subjectCode": "ME",
        "courseCode": "44400",
        "instructor": [
            "Min Liu"
        ],
        "description": "Introduction to advanced computer-aided design (CAD) for product design, modeling, and prototyping. Individual use and team-based environment to design and prototype a functional and marketable product. Projects include use of the advanced design tools to produce a working prototype that is manufacturable. Application to design, manufacturing, and analysis.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Vehicle Design And Fabrication",
        "subjectCode": "ME",
        "courseCode": "45500",
        "instructor": [
            "Todd A Nelson"
        ],
        "description": "Open-ended project course to design and build competitive prototype vehicles. Integration of design concept formulation, engineering analysis and testing, and prototype fabrication. Product development activities in a hands-on setting. Design constraints imposed by manufacturing limitations, funding constraints and market competition. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Engineering Design",
        "subjectCode": "ME",
        "courseCode": "46300",
        "instructor": [
            "Charles Gregory Jensen"
        ],
        "description": "Application of the design process to the design of various engineering components and systems. Mathematical modeling in design is emphasized. Design problems from all areas of mechanical engineering are considered.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Automatic Control Systems",
        "subjectCode": "ME",
        "courseCode": "47500",
        "instructor": [
            "Yan Gu"
        ],
        "description": "Controller design in frequency domain with introduction to digital systems and control.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Finite Element Analysis",
        "subjectCode": "ME",
        "courseCode": "48900",
        "instructor": [
            "Thomas H Siegmund"
        ],
        "description": "Introduction to finite element analysis with focus on linear elasticity and heat transfer. Matrix analysis and assembly of solutions. Strong form and weak form as a general solution process for differential equations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Additive Mfg:Fund, Equip &Appl",
        "subjectCode": "ME",
        "courseCode": "49601",
        "instructor": [
            "Salil Bapat"
        ],
        "description": "Experimental classes offered at the junior or senior level on a temporary basis to test the viability of offering the course on a permanent basis.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Advanced Thermodynamics",
        "subjectCode": "ME",
        "courseCode": "50000",
        "instructor": [
            "Terrence R Meyer"
        ],
        "description": "The empirical, physical basis of the laws of thermodynamics. Availability/exergy concepts and applications. Properties and relations between properties in homogeneous and heterogeneous systems. The criteria of equilibrium. Application to a variety of systems and problems, including phase and reaction equilibrium. Offered in alternate years.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Statistical Thermodynamics",
        "subjectCode": "ME",
        "courseCode": "50100",
        "instructor": [
            "Robert P Lucht"
        ],
        "description": "The molecular interpretation of thermodynamic equilibrium. Development of the partition function. Introduction to quantum mechanics and molecular spectroscopy. The Maxwell-Boltzmann formulation of statistical mechanics and applications to ideal gases, solids, radiation, and laser diagnostics. The Gibbs formulation of statistical mechanics and application to real gases. Kinetic theory and applications to transport properties and chemical kinetics. Offered in alternate years.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Micro-And-Nano-Scale Energy Transfer Processes",
        "subjectCode": "ME",
        "courseCode": "50300",
        "instructor": [
            "Amy M Marconnet"
        ],
        "description": "Transport of energy in natural and fabricated micro- and nano-scale structures. Physical nature of energy transport by three carriers-electrons, phonons, and photons. Bulk material properties (e.g., thermal/electrical conductivity) are derived from statistical particle transport theories. Effects of spatial confinement on bulk properties are quantified. Contemporary interdisciplinary engineering applications.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Intermediate Heat Transfer",
        "subjectCode": "ME",
        "courseCode": "50500",
        "instructor": [
            "David Em Warsinger"
        ],
        "description": "Heat and mass transfer by diffusion in one-dimensional, two-dimensional, transient, periodic, and phase change systems. Convective heat transfer for external and internal flows. Similarity and integral solution methods. Heat, mass, and momentum analogies. Turbulence. Buoyancy-driven flows. Convection with phase change. Radiation exchange between surfaces and radiation transfer in absorbing-emitting media. Multimode heat transfer problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Two-Phase Flow And Heat Transfer",
        "subjectCode": "ME",
        "courseCode": "50600",
        "instructor": [
            "Issam Mudawar"
        ],
        "description": "Basic two-phase flow equations, homogeneous model, drift-flux model, flow regimes, pressure drop in two-phase flow. Nucleation and bubble dynamics, pool boiling, subcooled boiling, forced convection boiling, critical heat flux in pool boiling, critical heat flux in forced convection boiling, minimum heat flux, film boiling, post dryout heat transfer. Flow instabilities, choking in two-phase flow, film and dropwise condensation. Applications to heat exchangers. Special boiling and two-phase flow problems. Offered in alternate years.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Laser Processing",
        "subjectCode": "ME",
        "courseCode": "50700",
        "instructor": [
            "Xianfan Xu"
        ],
        "description": "Introduces background knowledge in laser science and laser technology and fundamentals involved in laser processing and manufacturing. The following topics are discussed: laser fundamentals, industrial laser systems and processes, and the laser-induced thermal, thermo-mechanical, and thermo-acoustic effects. The course also discusses emerging areas of laser applications, such as microscale laser processing, ultrafast laser processing, and the related energy transport analyses. Laboratory and video demonstration sessions are used to enhance the overall understanding of the course materials. Offered in alternate years.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Heat Trans In Biological Systems",
        "subjectCode": "ME",
        "courseCode": "50800",
        "instructor": [
            "Bumsoo Han"
        ],
        "description": "Introduction to applications of heat transfer in living systems to students who have general interests in biomedical engineering. Fundamental concepts of biology and engineering involved in these applications are introduced. Regulation of blood flow under external thermal stimuli and its effect on heat transfer are discussed. Clinical applications of heat transfer, including cancer therapy and gene therapy. Prerequisite: first course in fluid or aerodynamics. Offered in alternate years.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Intermediate Fluid Mechanics",
        "subjectCode": "ME",
        "courseCode": "50900",
        "instructor": [
            "Ivan C Christov"
        ],
        "description": "Fluid properties. Basic laws for a control volume. Kinematics of fluid flow. Dynamics of frictionless incompressible flow and basic hydrodynamics. Equations of motion for viscous flow, viscous flow applications, boundary layer theory. Wall turbulence, lift and drag of immersed bodies.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Engineering Acoustics",
        "subjectCode": "ME",
        "courseCode": "51300",
        "instructor": [
            "J Stuart Bolton"
        ],
        "description": "The simple oscillator. Lumped acoustical elements. Electro-mechanical-acoustical analogies. Wave motion in strings and membranes. Introduction to linear acoustics through derivation of the wave equation and simple solutions. Plane and spherical waves. Acoustic intensity. Plane wave transmission through fluid layers and simple barriers. Sound absorption. Modeling of acoustical sources: monopoles, dipoles, quadrupoles. Mechanisms of sound generation and directionality. Sound propagation in one-dimensional systems (e.g., ducts and mufflers). Introduction to room acoustics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Analysis Of Thermal Systems",
        "subjectCode": "ME",
        "courseCode": "51800",
        "instructor": [
            "Davide Ziviani"
        ],
        "description": "Modeling and optimization of thermal systems with a focus on heat-pumping equipment, such as vapor compression, absorption, and some advanced heat-pumping cycles. Students combine the use of thermodynamics, heat transfer, fluid mechanics, and numerical methods to develop and apply mathematical models for the analysis and optimization of specific equipment. Offered in alternate years.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Combustion",
        "subjectCode": "ME",
        "courseCode": "52500",
        "instructor": [
            "Monique Suzanne Mcclain"
        ],
        "description": "Physical and chemical aspects of basic combustion phenomena. Chemical energetics and equilibrium. Basic chemical kinetics, chain reactions, and explosions. Chain and thermal ignition. Homogeneous combustion models. Detonations and deflagrations. Laminar flame speed and flame extinction. The Shvab-Zeldovich formulation of the multicomponent conservation equations. Diffusion flames and droplet combustion. Introduction to turbulent combustion.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Design And Modeling Of Fluid Power Systems",
        "subjectCode": "ME",
        "courseCode": "53500",
        "instructor": [
            "Andrea Vacca"
        ],
        "description": "Introduction to fluid power technology. Design of hydraulic systems for mobile and industrial application for functionality, cost and energy efficiency. Modeling strategies for fluid power systems. Labs and class projects are given to reinforce the design and modeling learning projects.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Air Breathing Propulsion",
        "subjectCode": "ME",
        "courseCode": "53800",
        "instructor": [
            "Guillermo Paniagua Perez"
        ],
        "description": "(AAE 53800) Analysis of operating characteristics of turbojet, turbofan, turboshaft, afterburning, and ramjet propulsion systems. Analysis and design of inlet, diffuser, combustor, compressor, turbine, and nozzle. Component matching and off-design performance. Inlet distortion, nozzle-afterbody, and installation losses. Mission analysis.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Scientific Machine Learning",
        "subjectCode": "ME",
        "courseCode": "53900",
        "instructor": [
            "Ilias Bilionis"
        ],
        "description": "Introduction to the fundamentals of predictive modeling for advanced undergraduates and graduate science and engineering students that work in the intersection of data and theory.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Engineering Design: A Decision-Based Perspective",
        "subjectCode": "ME",
        "courseCode": "54100",
        "instructor": [
            "Jitesh H Panchal"
        ],
        "description": "Multi-objective decision making under risk and uncertainty; Group decision making; Sequential decision making; Model-based and data-driven decision making; Heuristics and biases in design decision making. Applications to engineering design including estimation of customer preferences, simulation-based design, and sustainable design.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Intellectual Property For Engineers",
        "subjectCode": "ME",
        "courseCode": "55400",
        "instructor": [
            "Dwadasi Sarma"
        ],
        "description": "Survey of the law of patents, trade secrets, trademarks, and copyrights, with special emphasis on the process of defining inventions broadly and diversely. Obtaining, registering, licensing, and litigation of intellectual property.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Mechanical Vibrations",
        "subjectCode": "ME",
        "courseCode": "56300",
        "instructor": [
            "James M Gibert"
        ],
        "description": "Review of systems with one degree for freedom. LaGrange's equations of motion for multiple degree of freedom systems. Introduction to matrix methods. Transfer functions for harmonic response, impulse response, and step response. Convolution integrals for response to arbitrary inputs. Principle frequencies and modes. Applications to critical speeds, measuring instruments, isolation, torsional systems. Introduction to nonlinear problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Theory And Design Of Control Systems",
        "subjectCode": "ME",
        "courseCode": "57500",
        "instructor": [
            "Bin Yao"
        ],
        "description": "Covers the analysis and design of control systems from both a classical and modern viewpoint, with emphasis on design of controllers. Classical control design is reviewed, including both root locus and Bode domain design methodologies. The state space representation is introduced, along with notions of stability, controllability, and observability. State feedback controllers for pole placement and state observers are discussed with emphasis in their frequency domain implications.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Nonlinear Engineering Systems",
        "subjectCode": "ME",
        "courseCode": "58000",
        "instructor": [
            "Anil Kumar Bajaj"
        ],
        "description": "Methods of analysis for nonlinear ordinary differential equations arising in engineering systems. Review of linear systems. Stability concepts. Phase plane methods. Perturbation and averaging methods of analysis. Self-excited and parametrically-excited systems. Relaxation oscillations. Systems with more than one degree of freedom.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Numerical Methods In Mechanical Engineering",
        "subjectCode": "ME",
        "courseCode": "58100",
        "instructor": [
            "Marisol Koslowski"
        ],
        "description": "The solution of problems arising in mechanical engineering using numerical methods. Topics include nonlinear algebraic equations, sets of linear algebraic equations, eigenvalue problems, interpolation, curve fitting, ordinary differential equations, and partial differential equations. Applications include fluid mechanics, gas dynamics, heat and mass transfer, thermodynamics, vibrations, automatic control systems, kinematics, and design.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "System Identification",
        "subjectCode": "ME",
        "courseCode": "58400",
        "instructor": [
            "Neera Jain"
        ],
        "description": "Theory and application of System Identification methods. Connecting the world of mathematical models to experimental data - least squares methods and difference equation models. Background in probability and analysis: algebra of random variables, law of large numbers, central limit theorem. The ARMA family of models; mapping physics models to generalized ARMAX forms (linear and nonlinear); mapping the parameter estimation problem to the least squares problem (batch and recursive), and numerical solution techniques. Model (in)validation, optimal identification criteria, experiment design and data preprocessing considerations. Issues of signal-to-noise ratio, persistency of excitation, sampling frequency, data accuracy and data sizes.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Microprocessors In Electromechanical Systems",
        "subjectCode": "ME",
        "courseCode": "58600",
        "instructor": [
            "Peter Heinrich Meckl"
        ],
        "description": "Architecture of microcomputers; operating systems, logic functions, logic circuit design; I/O structure and interfacing; assembly language, manual assembly; software and hardware interrupts; data acquisition, serial and parallel communications; the role of high-level languages. Laboratory experiments on applications to electrical, mechanical, and thermofluid systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Engineering Optics",
        "subjectCode": "ME",
        "courseCode": "58700",
        "instructor": [
            "Song Zhang"
        ],
        "description": "Fundamentals of geometrical and physical optics as related to problems in engineering design and research. Characteristics of imaging systems; properties of light sources; optical properties of materials. Diffraction, interference, polarization, and scattering phenomena as related to optical measurement techniques. Introduction to lasers and holography. (Laboratory work can be undertaken for additional credit by special arrangement.).",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Robotics Seminar",
        "subjectCode": "ME",
        "courseCode": "59700",
        "instructor": [
            "Fabio Semperlotti",
            "David J Cappelleri",
            "Dongming Gan",
            "Kejie Zhao",
            "Andres Arrieta Diaz"
        ],
        "description": "Projects or special topics of contemporary importance or of special interest that are outside the scope of the standard graduate curriculum can be studied under the Mechanical Engineering Projects course. Interested students should seek a faculty advisor by meeting with individual faculty members who work in their area of special interest and prepare a brief description of the work to be undertaken in cooperation with their advisor. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            6
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Principles Of Turbulence",
        "subjectCode": "ME",
        "courseCode": "61100",
        "instructor": [
            "Luciano Castillo"
        ],
        "description": "Methods of description and basic equations for turbulent flows. Isotropic and homogeneous turbulence, energy spectra, and correlations. Introduction to measurements. Transition theory and experimental evidence. Wall turbulence, engineering calculations of turbulent boundary layers. Free turbulent jets and wakes. Prerequisite: ME 61000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    }
]