[
    {
        "title": "Production Design And Specifications",
        "subjectCode": "MET",
        "courseCode": "10200",
        "instructor": [
            "Paul B Mcpherson"
        ],
        "description": "The design, evaluation, and documentation of engineering specifications required of manufacturability and assembly are introduced. Emphasis is on CAD-based details, assemblies, design layouts, equipment installations, and related industrial practices.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Applied Statics",
        "subjectCode": "MET",
        "courseCode": "11100",
        "instructor": [
            "Wei Vian"
        ],
        "description": "Force systems, resultants and equilibrium, trusses, frames, beams, and shear and moments in beams are studied.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Materials And Processes I",
        "subjectCode": "MET",
        "courseCode": "14300",
        "instructor": [
            "Kyler Michael Blowers",
            "Gozdem Kilaz",
            "Randale J Glaze",
            "Joseph F Dues",
            "Ruiji Sun",
            "Rex C Kanu",
            "Sarah E Leach"
        ],
        "description": "An overview of structures, properties, processing, and applications of metals and ceramics commonly used in industry is presented. Problem solving skills are developed in the areas of materials selection, evaluation, measurement, and testing.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Materials And Processes II",
        "subjectCode": "MET",
        "courseCode": "14400",
        "instructor": [
            "Wei Vian"
        ],
        "description": "An overview of structures, properties, processing, and applications of polymers, composites, laminates, biomaterials, green materials, nanomaterials, and pharmaceuticals commonly used in industry is presented. Problem solving skills are developed in the areas of material selection, evaluation, measurement, and testing.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Applied Strength Of Materials",
        "subjectCode": "MET",
        "courseCode": "21100",
        "instructor": [
            "Damon C Sisk",
            "Kyler Michael Blowers",
            "Miles A Creasy",
            "Rex C Kanu",
            "Sarah E Leach",
            "Jeffrey R Heiking",
            "Sunghwan Lee"
        ],
        "description": "The principles of strength, stiffness, and stability are introduced and applied primarily to mechanical components.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Dynamics",
        "subjectCode": "MET",
        "courseCode": "21300",
        "instructor": [
            "Mo Rastgaar"
        ],
        "description": "Kinematics and kinetics principles of rigid-body dynamics are introduced. Emphasis is on the analysis of bodies in plane motion.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Heat And Power",
        "subjectCode": "MET",
        "courseCode": "22000",
        "instructor": [
            "Damon C Sisk",
            "Megan E Prygoski",
            "Maher Shehadi",
            "Rex C Kanu",
            "William J Hutzel",
            "Jeffrey R Heiking"
        ],
        "description": "Heat/Power is an introduction to the principles of thermodynamics and heat transfer. Basic thermodynamic processes are used to evaluate the performance of energy-based systems such as internal combustion engines, power plants, and refrigeration equipment.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Fluid Power",
        "subjectCode": "MET",
        "courseCode": "23000",
        "instructor": [
            "Farid Youssef El breidi"
        ],
        "description": "This course consists of the study of compressible and incompressible fluid statics and dynamics as applied to hydraulic and pneumatic pumps, motors, transmissions, and controls.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Manufacturing Systems",
        "subjectCode": "MET",
        "courseCode": "24500",
        "instructor": [
            "Kyler Michael Blowers",
            "Milan Rakita",
            "Rex C Kanu",
            "Sarah E Leach",
            "Rustin D Webster",
            "Ruiji Sun",
            "Jeffrey R Heiking"
        ],
        "description": "This course surveys the manufacturing processes and tools commonly used to convert cast and molded, formed, and joined materials into finished products.  It includes the fundamentals of material removal, measurement, statistical quality control, assembly processes, process planning and optimization, CNC programming and automated manufacturing.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Industrial Controls",
        "subjectCode": "MET",
        "courseCode": "28400",
        "instructor": [
            "Thomas M Lucas",
            "Grant P Richards"
        ],
        "description": "This course examines the concepts, devices, and common practices associated with modern industrial control systems. Common industrial control devices are studied. Students learn how to wire, program, and troubleshoot programmable logic controller (PLC) based control systems. PLC applications focus on interfacing and controlling a variety of electromechanical devices such as motors and pneumatic actuators. Industrial safety practices and procedures are emphasized throughout the course.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "CAD In The Enterprise",
        "subjectCode": "MET",
        "courseCode": "30200",
        "instructor": [
            "Paul B Mcpherson",
            "Ruiji Sun"
        ],
        "description": "Theory and practice of management, use and integration of computer-aided design systems, and related engineering tools and practices are studied as they are applied in the industrial enterprise. Emphasis is on course projects.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Experimental Strength Of Materials",
        "subjectCode": "MET",
        "courseCode": "31100",
        "instructor": [
            "Rex C Kanu"
        ],
        "description": "Selected advanced topics from the areas of mechanics of materials, structures, stress analysis, and strain measurements are considered. Basic electronic strain gage circuits and instrumentation are presented, with emphasis on transducer applications.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Applied Fluid Mechanics",
        "subjectCode": "MET",
        "courseCode": "31300",
        "instructor": [
            "Maher Shehadi",
            "Anne M Lucietto",
            "Joseph P Fuehne"
        ],
        "description": "The fundamental principles of fluid mechanics are developed, including properties of fluid, pressure, hydrostatics, dynamics of fluid flow, friction losses, and sizing of pipes. Emphasis is on problem solving.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Applications Of Machine Elements",
        "subjectCode": "MET",
        "courseCode": "31400",
        "instructor": [
            "Maher Shehadi",
            "Damon C Sisk",
            "Haiyan H Zhang"
        ],
        "description": "The methods developed in statics, dynamics, and strength of materials are applied to the selection of basic machine components (gears, shafts, bearings, chain and belt drives, clutches and brakes, and motors).",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Mechanics Of Machine Design",
        "subjectCode": "MET",
        "courseCode": "31601",
        "instructor": [
            "Miles A Creasy",
            "Dongming Gan"
        ],
        "description": "Concepts of stress and strain analysis under combined loadings are introduced. Analyses emphasize use of von Mises stress, Mohr's circle, static failure theories, and fatigue failure criteria. Structural joints and buckling are also analyzed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Applied Thermodynamics",
        "subjectCode": "MET",
        "courseCode": "32000",
        "instructor": [
            "John W Sheffield"
        ],
        "description": "Following a review of fundamental concepts, advanced power and refrigeration cycles are analyzed. Applications such as gas mixtures, air-vapor mixtures, and chemical reactions of combustion processes are presented.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Advanced Fluid Power",
        "subjectCode": "MET",
        "courseCode": "33400",
        "instructor": [
            "Jose M Garcia Bravo"
        ],
        "description": "Hydraulic and pneumatic circuits and their steady state and time-variant behavior as it affects the selection and design of components and systems used in fluid power transmission and motion control are studied. Emphasis is placed on industrial and mobile applications, but the principles also apply to aerospace, marine, and other fluid power systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Advanced Materials In Manufacturing",
        "subjectCode": "MET",
        "courseCode": "34600",
        "instructor": [
            "Xiaoming Wang"
        ],
        "description": "Metals, polymers, ceramic, and composite materials are studied. Crystal structure, molecular behavior, and the effects of various processes on material properties are considered. Course emphasizes the development and control of material properties to meet engineering requirements and specifications.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Stringed Instrument Design And Manufacture",
        "subjectCode": "MET",
        "courseCode": "34900",
        "instructor": [
            "Richard Mark French"
        ],
        "description": "Concepts, knowledge, and skills in experimental mechanics, production processes, and design are integrated to manufacture a working musical instrument. Production concerns such as fixture design, process variability, and validation testing comprise key course elements.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To The Finite Element Method",
        "subjectCode": "MET",
        "courseCode": "41100",
        "instructor": [
            "Dongming Gan"
        ],
        "description": "The finite element method is introduced, with emphasis on modeling and interpretation of results. Linear static problems are solved using commercial FEA software, and FEA results are verified through laboratory tests and/or theoretical calculations. Topics include trusses, frames, plane stress/strain, torsion, 3D structures, buckling, and natural frequency/mode shape analyses.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Air Conditioning And Refrigeration",
        "subjectCode": "MET",
        "courseCode": "42100",
        "instructor": [
            "William J Hutzel"
        ],
        "description": "Heat gains and losses, heat-producing equipment, cooling, and refrigeration equipment are studied. System design is presented, including controls and instrumentation for commercial, industrial, and residential systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Power Plants And Energy Conversion",
        "subjectCode": "MET",
        "courseCode": "42200",
        "instructor": [
            "Anne M Lucietto"
        ],
        "description": "The theories and skills learned from prerequisite coursework are applied to the analysis and design of power plants and their systems and to selected technologies of energy conversion. Industrial procedures and methods are emphasized.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Internal Combustion Engines",
        "subjectCode": "MET",
        "courseCode": "42600",
        "instructor": [
            "Jason K Ostanek"
        ],
        "description": "Introduces the operating principles of internal combustion engines with emphasis on performance, efficiency, and emissions. Students will evaluate engine performance through geometric, kinematic, and thermodynamic analysis. Introduces advanced thermodynamic cycles and trends in internal combustion engine technology.  ",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Pneumatic Motion Control Systems",
        "subjectCode": "MET",
        "courseCode": "43600",
        "instructor": [
            "Jose M Garcia Bravo"
        ],
        "description": "The application of pneumatic motion control systems to industrial motion control and robotics is studied. Circuit design with control logic of both fluid and electronic types is stressed, as applied to pneumatic point-to-point and proportional controls. Control designs are implemented, tested, and evaluated in the laboratory.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Applied Metallurgy",
        "subjectCode": "MET",
        "courseCode": "44400",
        "instructor": [
            "Xiaoming Wang"
        ],
        "description": "Metals used in common engineering applications are studied to determine how their properties are achieved. Photomicrographic and other methods are employed to investigate the alloying, hotworking, coldworking, and heat treating processes of these metals. Detection, identification, and diagnosis of metal failure are included.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Advanced GD&T Concepts Applied To Product Quality",
        "subjectCode": "MET",
        "courseCode": "45200",
        "instructor": [
            "Paul B Mcpherson"
        ],
        "description": "This course explores the theory and application of Geometric Dimensioning and Tolerancing (GD&T) to measurement systems and the programming necessary to insure product quality.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Mechatronics",
        "subjectCode": "MET",
        "courseCode": "48200",
        "instructor": [
            "Damon C Sisk",
            "Haiyan H Zhang"
        ],
        "description": "Fundamental concepts and applications of practical mechatronics are presented, with emphasis on product design, systems integration, and functional relationships between mechanical structure, sensor data, precision actuators, power resources, embedded microcontrollers, control logic, and drives. Students gain hands-on experience with mechatronics components and measurement equipment which is applied in a team-based design-build mechatronics system project.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Technology From A Global Perspective",
        "subjectCode": "MET",
        "courseCode": "52700",
        "instructor": [
            "Duane D Dunlap"
        ],
        "description": "Introduction to the challenges faced by the practicing technologist when working and interacting with international technical personnel, both here and abroad, including history, standards, education, and practice of technology outside the United States. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": " Applied Metallurgy",
        "subjectCode": "MET",
        "courseCode": "58100",
        "instructor": [
            "Xiaoming Wang"
        ],
        "description": "Advanced study of technical and professional topics. Emphasis is on new developments relating to technical, operational, and training aspects of industry and technology education.",
        "capacity": 0,
        "credits": [
            0,
            8
        ],
        "term": "Fall 2023"
    }
]