[
    {
        "title": "Introduction To Management",
        "subjectCode": "MGMT",
        "courseCode": "10000",
        "instructor": [
            "David Michael Randich"
        ],
        "description": "An introduction to and survey of the field of management. Exposure to the different functional areas of management will be stressed. Focus will be on the individual development of the student in regard not only to future professional employment but also to his or her educational planning. Required for freshman management students.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Management And Information Strategies",
        "subjectCode": "MGMT",
        "courseCode": "11000",
        "instructor": [
            "Annette Helen Bochenek"
        ],
        "description": "An introduction to and survey of the field of business. Exposure to the different functional areas of management will be stressed. Focus will be on the individual development of the student in regard not only to future professional employment but also to his or her educational planning. Designed to build and sharpen students' information-gathering skills. Guides students in developing systematic methods for finding, evaluating, and presenting information. Students apply their knowledge of business in a Case Competition. Required for freshman Krannert Leaders Academy students.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Careers In Accounting & Finance",
        "subjectCode": "MGMT",
        "courseCode": "19700",
        "instructor": [
            "Kevin J Koharki"
        ],
        "description": "This course explores the various career opportunities available to accounting majors, as well as opportunities available to non-accounting majors who have a strong background in accounting. While most students believe public/private accounting are the only career options for accounting majors, we examine other avenues such as hedge funds, private equity and consulting, among others.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introductory Accounting",
        "subjectCode": "MGMT",
        "courseCode": "20000",
        "instructor": [
            "Terra D Maienbrook",
            "Jeremy David Michels"
        ],
        "description": "The objectives of the course are to help students: (1) understand what is in financial statements and what the statements say about a business, (2) identify the business activities that caused the amounts that appear in the statements, and (3) understand how, when, and at what amount the effects of manager and employee actions will appear in the statements. CTL:IPO 1801 Accounting I",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Management Accounting I",
        "subjectCode": "MGMT",
        "courseCode": "20100",
        "instructor": [
            "R Scott Sorensen"
        ],
        "description": "An introduction to management's internal use of accounting information--for decision making, production management, product costing, motivating and evaluating performance, and budgeting. CTL:IPO 1802 Accounting II",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Business Accounting",
        "subjectCode": "MGMT",
        "courseCode": "21200",
        "instructor": [
            "Paula J Conroy"
        ],
        "description": "The two primary objectives are to teach the skills to produce financial information-to send the relevant signals to decision makers; and to teach the skills to interpret the financial report-to receive the signals. To meet these objectives the students will gain an understanding of the reasoning behind the processes used to record financial information and the manner in which it is reported to external decision makers; gain an understanding of the four basic statements; and an understanding of the importance of financial statement information in interpreting the performance of organizations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Contemporary Thought Of Minorities In Management",
        "subjectCode": "MGMT",
        "courseCode": "24300",
        "instructor": [
            "Darren L Henry"
        ],
        "description": "The basic goal of this course is to introduce the minority student to the vast opportunities that are available in the field of management. The logic of a business education for the minority student is a reflection of the phenomenon that many corporations today are actively seeking minorities for managerial positions. Each semester, approximately 15 Fortune 500 companies are invited to the class to give presentations about entry-level opportunities with their firms. Other topics include the interview, resume writing, dual-career couples, the work force, affirmative action, minorities in the corporate world, etc. Each student is required to give a class presentation covering a business area of interest followed by class discussion over the topic.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Legal Foundations Of Business I",
        "subjectCode": "MGMT",
        "courseCode": "25400",
        "instructor": [
            "Cara C Putman",
            "Clifford D Fisher",
            "Cecelia Marie Harper",
            "Randy John Williams",
            "Miltina Ann Gavia"
        ],
        "description": "An examination and study, for management students, of the nature and place of law in our society, both national and international, the social and moral bases of law enactment, regulation of business, legal liability, enforcement procedures, and the legal environment for managers.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Programming For Business Applications",
        "subjectCode": "MGMT",
        "courseCode": "28800",
        "instructor": [
            "Shoaib Amjad Khan"
        ],
        "description": "This course will cover the fundamentals of business rules and logic in a business application development context. Students will acquire these skills using computer programming. A modern programming language will be used to learn and reinforce logical concepts, including abstraction, process flow, variable assignment, and control structures, as well as proper programming and application development practices, including documentation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Integrated Business & Engineering Seminar I",
        "subjectCode": "MGMT",
        "courseCode": "29110",
        "instructor": [
            "David Michael Randich"
        ],
        "description": "The seminar courses to expose students to contemporary topics related to the design and management of modern organizations and enterprises. These seminars will leverage the expertise of faculty across Purdue, prominent alumni, and thought leaders in each (flexible, rotating) topic area. Seminar topics might include contemporary topics, for example, artificial intelligence, cybersecurity, climate resilience, and sustainable economic growth. Seminars will also focus on professional development of students along with discovery, development, and practice of skills required to enable a diverse team to address complex problems affecting a wide range of stakeholder through collaboration, communication, and application of a wide range of influencing strategies and techniques. Simulation, guest speakers, projects, field visits will be used as appropriate.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Integrated Business & Engineering Seminar II",
        "subjectCode": "MGMT",
        "courseCode": "29120",
        "instructor": [
            "Ryan Paul Case"
        ],
        "description": "The seminar courses to expose students to contemporary topics related to the design and management of modern organizations and enterprises. These seminars will leverage the expertise of faculty across Purdue, prominent alumni, and thought leaders in each (flexible, rotating) topic area. Seminar topics might include contemporary topics, for example, artificial intelligence, cybersecurity, climate resilience, and sustainable economic growth. Seminars will also focus on professional development of students along with discovery, development, and practice of skills required to enable a diverse team to address complex problems affecting a wide range of stakeholder through collaboration, communication, and application of a wide range of influencing strategies and techniques. Simulation, guest speakers, projects, field visits will be used as appropriate.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Navigating Gender In The Workplace",
        "subjectCode": "MGMT",
        "courseCode": "29400",
        "instructor": [
            "Jill E Gulker"
        ],
        "description": "This course has four objectives: (1) To Increase self-awareness and understand its value in managing careers; (2) To learn how gender culture and implicit bias may affect workplace experiences; (3) To develop strategies to deal with gender related challenges; and (4) To develop competencies in leading effective, gender-aware teams. By exploring these areas, students will develop new insights for managing their careers, and they will learn new leadership strategies to help their teams achieve higher levels of performance.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Career Readiness & Exploration",
        "subjectCode": "MGMT",
        "courseCode": "29500",
        "instructor": [
            "Kristin E Deckard Dawson",
            "Storie Preo Pedley",
            "Emma K Cox",
            "Patrick Michael Francis",
            "Emily Beth Easley",
            "Juna Rika-Arline Johnson",
            "Corey David Guilford"
        ],
        "description": "Start developing career readiness competencies through an engaging, hybrid course. Come prepared to create and modify your career necessities (resume, LinkedIn profile, elevator pitch, etc.), while growing in the competencies employers are looking for when hiring recent graduates! Following career necessities, you'll get a taste of what you might encounter in the workforce, and what steps you can take to explore other career options if you get into the workplace and find it's not a good fit. Jump-start your career through MGMT 29500!",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Financial Management",
        "subjectCode": "MGMT",
        "courseCode": "30400",
        "instructor": [
            "Phillip Guy Baeza"
        ],
        "description": "Introductory course providing a foundation in corporate finance and covering topics such as: discounted cash flow valuation, bond valuation, equity valuation, option valuation, factors influencing a firm's cost of capital, and international finance issues.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Business Statistics",
        "subjectCode": "MGMT",
        "courseCode": "30500",
        "instructor": [
            "Gary W Evans",
            "Pangpang Liu",
            "Xing Wang",
            "Riddhiman Bhattacharya",
            "Jen Tang"
        ],
        "description": "Introduction to business statistics as related to facilitating managerial decision making. Topics include descriptive statistics, probability models, estimation, hypothesis testing, and regression analysis. Students use software to do their own analyses.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Management Science",
        "subjectCode": "MGMT",
        "courseCode": "30600",
        "instructor": [
            "Gary Mercado Velasco",
            "Xing Wang",
            "Arthur A Alexander"
        ],
        "description": "Use of optimization, simulation, and decision theory models to support management decision making. Emphasis on modeling and interpreting results for managerial applications of linear and integer programming models, network problems, simulation models, and decision analysis. Computer applications are stressed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Financial Management",
        "subjectCode": "MGMT",
        "courseCode": "31000",
        "instructor": [
            "Woong Bae Kim",
            "Alexander W Boquist",
            "Kaushik Vasudevan",
            "Youngmin Kim"
        ],
        "description": "Management of the financial affairs of the industrial enterprise. Working capital management, current asset management, capital budgeting, stock and bond valuation, and capital structure decisions.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Principles Of Marketing",
        "subjectCode": "MGMT",
        "courseCode": "32300",
        "instructor": [
            "Laura A Downey"
        ],
        "description": "This course aims to provide students with a broad understanding of marketing concepts that are useful to managers in a variety of applications including the marketing of consumer products, marketing of services, business-to-business marketing, and the marketing challenges that arise in not-for-profit organizations. Marketing involves identifying customer needs, then satisfying those needs by offering the right product and/or service at an acceptable price, making it available to customers through appropriate distribution channels, and promoting it in ways that motivate purchase as much as possible. The course serves as a foundation for marketing knowledge in general. No credit for students in the School of Management, except economics majors.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Marketing Management",
        "subjectCode": "MGMT",
        "courseCode": "32400",
        "instructor": [
            "Chaewon Seol",
            "Ankit Sisodia",
            "Hongyu Fu",
            "Siyun Lu",
            "Julie Michelle Abdinoor",
            "Laura A Downey"
        ],
        "description": "The objective of this course is to introduce students to the concepts, analyses, and activities that comprise marketing management, and to provide practice in analyzing and solving marketing problems. The course is also a foundation for advanced elective courses in marketing. Topics covered in the course include customer behavior, market segmentation, product positioning, market research, product management, pricing, promotion, sales force management and competitive analysis.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Strategic Business Writing",
        "subjectCode": "MGMT",
        "courseCode": "33500",
        "instructor": [
            "Aryca Peay Woodson",
            "Kasie M Roberson"
        ],
        "description": "Strategic Business Writing is designed to help Krannert undergraduate students become more effective, strategic writers in a business setting. The course format involves class lectures/discussions, small group work and extensive written work. In this course, students learn how to: develop a writing style that is clear, concise and thorough; adapt writing to varying audience needs and levels, including using appropriate style and tone when communicating; develop Visual Aids that are effective and persuasive; write with greater ease and credibility; use Emotional Intelligence when writing; effectively listen to feedback on your writing and offer helpful feedback to others on their writing; write under a tight deadline; edit thoroughly and write various standard forms of Business Writing.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Intermediate Accounting I",
        "subjectCode": "MGMT",
        "courseCode": "35000",
        "instructor": [
            "Theodore H Goodman"
        ],
        "description": "Financial reporting for interested external parties. Emphasis on asset valuation, income measurement, and preparation of financial statements, and on appreciation of discretion available to preparers.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Intermediate Accounting II",
        "subjectCode": "MGMT",
        "courseCode": "35100",
        "instructor": [
            "Lin Qiu"
        ],
        "description": "Continuation of Intermediate Accounting I. An examination of additional problems in financial reporting, including long-term assets, liabilities, owners' equity, income taxes, earnings per share, leases, and pensions.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Strategic Management",
        "subjectCode": "MGMT",
        "courseCode": "35200",
        "instructor": [
            "John Francis Burr",
            "Heejung Byun",
            "Helge Jan Dirk Klapper",
            "Amir Sariri"
        ],
        "description": "The course focuses on understanding competitive forces and how organizations strive to build sustainable competitive advantages through business- and corporate-level strategies. It integrates and builds upon previous training in functional areas and presents new analytical tools for developing an understanding of the strategic decisions that determine future directions and effectiveness of the organization.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Intermediate Accounting For Non-Accounting Majors",
        "subjectCode": "MGMT",
        "courseCode": "35300",
        "instructor": [
            "Lin Qiu"
        ],
        "description": "The course is designed to meet the needs of students of predominantly finance students, as a firm grasp of key accounting concepts is critical to success in most finance professions. Throughout the course we will study measurement and reporting issues related to selected important financial statement items. The goal of this course is to educate students on major accounting topics that are likely to influence key financial decisions such as different inventory methods, different depreciation methods, lease recognition, pension accounting, among other topics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Consulting Tools And Skills",
        "subjectCode": "MGMT",
        "courseCode": "35500",
        "instructor": [
            "John Francis Burr"
        ],
        "description": "This novel course will provide an opportunity for motivated students to gain exposure to the skills and tools necessary to succeed in the consulting industry. There will be a chance to work in small teams to define client problems, collect and analyze data, develop solution proposals, and implement recommendations. Students will also be given an insider's look into the history of consulting, common types of consulting, and professional standards in this specialized area of management. Honing skills in project management, presentation delivery, storytelling, and stakeholder engagement will form the foundation of the tools used to solve client challenges.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Operations Management",
        "subjectCode": "MGMT",
        "courseCode": "36100",
        "instructor": [
            "Manohar S Madan",
            "Chen-An Lin",
            "Olga Rusyaeva Senicheva"
        ],
        "description": "This course provides an understanding of the issues involved in designing and managing manufacturing and service systems. Topics include manufacturing strategy, quality management, inventory systems, aggregate planning, just-in-time manufacturing, and operations scheduling. Case studies and articles integrate these topics and highlight managerial implications.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Real Estate Fundamentals",
        "subjectCode": "MGMT",
        "courseCode": "37000",
        "instructor": [
            "Lindsay Ellen Relihan"
        ],
        "description": "This course introduces the basic concepts, principles, and analytic methods applied in the field of real estate. The course covers topics including legal, financial, economic and marketing concepts related to real estate. The goal of the course is to expose students to the field of real estate and prepare them for more advanced real estate courses.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Accounting Information Systems & Data Analytics",
        "subjectCode": "MGMT",
        "courseCode": "37300",
        "instructor": [
            "Paula J Conroy"
        ],
        "description": "Learn how to manage the design, control and operation of accounting information systems. The emphasis is on identifying the information needs of decision makers and developing appropriate business process control in the design of accounting information systems. Gain an understanding and appreciation of the accounting information system and how it is used to successfully manage, audit and develop processes to support today's evolving business environment.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Real Estate Law",
        "subjectCode": "MGMT",
        "courseCode": "37500",
        "instructor": [
            "Cecelia Marie Harper"
        ],
        "description": "The course provides an overview of real estate law and its influence on various aspects of the real estate industry. The course examines the legal issues surrounding the nature of real property, types of ownership and possession, real estate contracts, escrow and title and insurance, zoning, financing, landlord and tenant, land use regulations, environments law and regulations, and agency ethics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Management Information Systems",
        "subjectCode": "MGMT",
        "courseCode": "38200",
        "instructor": [
            "Alok R Chaturvedi",
            "Gerald Roland Dehondt"
        ],
        "description": "This case-oriented course is designed to familiarize students with existing and emerging technologies and their business applications. It also covers issues, problems, and opportunities that information systems (IS) executives and general managers face when managing IS resources in their organizations. Includes lectures, presentations, case analyses and discussions, and a World Wide Web project. Case discussions cover real situations and deal with the operational and strategic decisions that every IS manager has to make in managing and exploiting the available information technology.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Strategic Thinking And Decision-Making",
        "subjectCode": "MGMT",
        "courseCode": "39100",
        "instructor": [
            "Douglas E Pruim"
        ],
        "description": "This course focuses on how to think strategically and make good business decisions. By the end of the class, you will be able to do the following: (1) Recognize biases in how people process information, conducting user tests and interviews to gain insights from prototypes to make business development decisions; (2) Engage in decision-making strategies to design/develop prototypes in a variety of media (digital and/or physical) for the appropriate level of fidelity necessary to communicate, understand, and test innovative ideas; (3) Select and use appropriate methods/tools/equipment to make decisions and design/prototype innovative ideas; (4) Pitch a viable solution for a validated problem to a variety of potential investors and/or stakeholders.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Krannert Executive Forum",
        "subjectCode": "MGMT",
        "courseCode": "40100",
        "instructor": [
            "Lou M Underwood"
        ],
        "description": "A lecture-discussion course featuring executives from business firms and other organizations. Emphasis is placed on the actual practice of management in corporate America, on career selection and mobility, on styles of management, and on other topics not normally covered in undergraduate courses.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Six Sigma And Quality Analytics",
        "subjectCode": "MGMT",
        "courseCode": "40500",
        "instructor": [
            "Gary Mercado Velasco"
        ],
        "description": "The course is an undergraduate elective offered as part of the Center for Manufacturing Management Enterprises (CMME) quality initiatives. Provides an overview of various tools and methods for total quality management.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Investment Management",
        "subjectCode": "MGMT",
        "courseCode": "41100",
        "instructor": [
            "Shuaiyu Chen",
            "Huseyin Gulen"
        ],
        "description": "Examination of investment alternatives relevant to the individual and/or family-unit investor. Operations of the markets in which securities are traded. Theory and application of security valuation, portfolio construction, capital markets, and performance evaluation. Particular attention given to fixed income securities, common stocks, options, investment companies, and other popular investment alternatives.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Futures And Options",
        "subjectCode": "MGMT",
        "courseCode": "41150",
        "instructor": [
            "Alexander W Boquist"
        ],
        "description": "The course covers basic features and pricing of derivative securities such as forwards, futures, and options.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Financial Institutions And Markets",
        "subjectCode": "MGMT",
        "courseCode": "41200",
        "instructor": [
            "Phillip Guy Baeza"
        ],
        "description": "Introduction to financial markets and management of financial institutions. Emphasis on determinants of interest rates, and measurement and management of financial risk. Concentration on management of depository firms such as banks and savings and loans.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "FinTech",
        "subjectCode": "MGMT",
        "courseCode": "41220",
        "instructor": [
            "Mehmet Deniz Yavuz"
        ],
        "description": "  Dramatic development in technology is fundamentally transforming all aspects of financial intermediation including lending, payment services, investments and trading. The goal of the course is to introduce these new developments to students with the emphasis on underlying economic mechanisms. We will start with talking about fiat money but quickly delve into cryptocurrencies and their applications. We will talk about tokens, smart contracts, automated market making and how applications of these concepts are transforming financial services and financial inclusion. We will cover these topics by analyzing real companies and contrast them with traditional players in the financial system.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Corporate Finance",
        "subjectCode": "MGMT",
        "courseCode": "41300",
        "instructor": [
            "John J Mcconnell",
            "Fabricio R R D'Almeida"
        ],
        "description": "The course provides the theoretical and problem-solving tools needed in entry-level financial analysis positions in a corporate, commercial lending, or investment banking setting. Topics include corporate valuation, cash flow forecasting, project evaluation, capital structure, dividend policy, capital acquisition, and mergers/acquisition.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Financial Data Analysis And Modeling",
        "subjectCode": "MGMT",
        "courseCode": "41310",
        "instructor": [
            "Lulu Zeng"
        ],
        "description": "In the business world today, finance professionals are going to be given opportunities to analyze and model data. The objective of MGMT 41310 is to give students opportunities to work with financial data sets to ask and answer real questions that businesses have. In this course, students will use several data analysis software packages including R. Additionally, the course will include extensive application of Excel tools for Financial Modeling.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Corporate Mergers And Acquisitions",
        "subjectCode": "MGMT",
        "courseCode": "41601",
        "instructor": [
            "Sergiy Chernenko"
        ],
        "description": "The financial analysis of corporate acquisitions, mergers, and reorganizations including asset acquisitions, joint ventures, spin-offs, sell-offs, equity carve-outs, bankruptcy proceedings and reorganizations, and corporate governance. The course uses a combination of lectures, readings, and case analysis.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Consumer Analytics",
        "subjectCode": "MGMT",
        "courseCode": "42000",
        "instructor": [
            "Ho jung Yoon"
        ],
        "description": "The course focuses on understanding how and why consumers behave the way they do. We explore behavioral and economics theories that help us better understand and predict consumers' behavior, and learn about how these theories can be applied in developing marketing strategies. The key topics covered in the course include: (i) discussion of a framework for analyzing consumers' decision making; (ii) review of relevant psychological, sociological and economics concepts; (iii) discussion of marketing research methods for studying consumer behavior. We apply the concepts covered in these topics to measure consumers' beliefs, attitudes, intentions, and behavior and predict how consumers will react to different marketing strategies. Finally, we consider the application of behavior theory to the design of marketing strategies, including product design, pricing, and advertising.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Marketing Analytics",
        "subjectCode": "MGMT",
        "courseCode": "42110",
        "instructor": [
            "Weijia Dai"
        ],
        "description": "This course covers essential decision models and strategic metrics that form the cornerstone of marketing analytics. Using the insight gained in the course, students can predict the outcome of marketing plans to boost return on marketing investment (ROMI). The course emphasizes hands-on learning so students can immediately apply the econometric tools and techniques on a variety of marketing applications. A number of relevant topics are discussed, such as market sizing, forecasting and positioning, promotion budget allocation, and profit maximization. The final piece of this course is guiding the students on how best to craft data-driven presentations to key stakeholders through the use of an experiential learning project provided by an external client.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Marketing Research",
        "subjectCode": "MGMT",
        "courseCode": "42500",
        "instructor": [
            "Guofang Huang"
        ],
        "description": "The purpose of this course is to develop skills in the planning and execution of market research studies designed to acquire useful information for marketing decisions. It aims to familiarize students with techniques of research design, data collection, and analysis. Emphasis is placed on evaluating the results obtained from such investigations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Brand Management",
        "subjectCode": "MGMT",
        "courseCode": "42610",
        "instructor": [
            "Chad Ruel Allred"
        ],
        "description": "This course is designed to provide an understanding of how to manage a brand, product, or product category. The course concerns issues related to customer behavior and customer decision making, with an emphasis on how to utilize such customer-oriented knowledge for building and maintaining brand equity. This course builds on concepts and topics covered in the core marketing course.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Digital Marketing Strategy",
        "subjectCode": "MGMT",
        "courseCode": "42710",
        "instructor": [
            "Jinsuh Lee"
        ],
        "description": "Digital marketing is where marketing meets the internet, wireless devices, and other digital media. The course covers a variety of topics including online advertising, search engine optimization, participation in social media, online listening and monitoring, and web & social media analytics. Through a combination of lecture, case studies, hands-on exercises, and course projects, students develop capabilities in designing, implementing, and evaluating digital marketing strategies. Students can also gain hand-on learning experience in the course by participating in an online marketing project. In the online marketing project, each student team is given $50 to promote a chosen business or organization via online or social media platform (including search engine advertising and online display advertising).",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Professional Selling",
        "subjectCode": "MGMT",
        "courseCode": "43000",
        "instructor": [
            "Laura A Downey"
        ],
        "description": "The course covers all aspects of professional selling to help students develop an understanding of sales managers' goals, decisions, and challenges and learn about the tools, frameworks, and insights to diagnose and resolve strategic and tactical issues of selling. These concepts can help all employees promote their own ideas internally and more effectively work with the sales organization to achieve organizational success.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Real Estate Investment & Development",
        "subjectCode": "MGMT",
        "courseCode": "43901",
        "instructor": [
            "Michael Donald Eriksen"
        ],
        "description": "The course will cover two main topics: real estate development and real state investment. For real estate development, we will discuss the process of the real estate development process, including the basics of the idea conception, feasibility, planning, financing, market analysis, contract negotiation, risk management, marketing, and asset management. For real estate investment, we will discuss the process and techniques of analyzing real property investment, and the effects of market conditions, government policies, and other factors on real estate investment.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Management Of Human Resources",
        "subjectCode": "MGMT",
        "courseCode": "44301",
        "instructor": [
            "Henry E Williams"
        ],
        "description": "Survey of theory and techniques used in human resource management within organizations. Emphasis is placed on legal concerns, human resource staffing and development, reward systems, and the role of unions in American society. Techniques studied include job analysis, the use of various recruitment and selection procedures, compensation, administration, and collective bargaining. No credit for students in the School of Management.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Leadership In A Changing World",
        "subjectCode": "MGMT",
        "courseCode": "44362",
        "instructor": [
            "Kelly S Wilson"
        ],
        "description": "  This course is designed to help you become a more effective leader in a complex and rapidly changing world. Effective leadership developed over time through practice, feedback, and self-reflection is crucial for organizational success. While engaging in effective leadership practices can be rewarding, it is also a significant challenge for most people. This course aims to equip you with the knowledge and tools necessary to improve your leadership capabilities and confidence based on evidence-based practices and leadership theories. Through interactive sessions, we will explore various aspects of effective leadership, assess where you stand in your leadership development journey, and hone your leadership skills. By the end of the course, you should be able to recognize the importance of interpersonal relationship skills and abilities in effective leadership, discuss key leadership principles and practices in organizational settings with peers, colleagues, supervisors, and mentors, identify your own leadership strengths and areas for development, propose evidence-based solutions to real-world leadership problems, and develop a leadership philosophy based on your personal values and evidence-based strategies. ",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Human Resources Management",
        "subjectCode": "MGMT",
        "courseCode": "44428",
        "instructor": [
            "Joel Munoz"
        ],
        "description": "Survey of the techniques and practices used in human resource management. Emphasis is on legal requirements, cost/benefit considerations, and strategic needs in managing human resources. Topics include recruitment, selection and placement, compensation, work design, and reactions to work. Specific techniques reviewed include assessment centers, incentive plans, structured interviewing, and autonomous work groups. Current issues and managerial decision making are emphasized.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Staffing: Talent Acquisition",
        "subjectCode": "MGMT",
        "courseCode": "44430",
        "instructor": [
            "Brian K Chupp"
        ],
        "description": "This course focuses on the effective management of the flow of talent into and through organizations. It covers workforce planning, recruiting and selection, career transitions and other workforce movement. It is designed to teach students the skills to recruit and select the best talent to help drive organizational strategy. It will also prepare students to evaluate methods for job analysis and selection. Students will learn how to design and ask interview questions that are behaviorally anchored and focused on organization-person fit and person-job fit, both of which are important for successful adaptation and effective performance on the job. Students will also learn how to design a process and framework for final individual or group selection. Lastly, they will learn several strategies to successfully orient and onboard new employees.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Negotiation And Decision Making",
        "subjectCode": "MGMT",
        "courseCode": "44690",
        "instructor": [
            "Joel Munoz",
            "Jordan Douglas Nielsen"
        ],
        "description": "The purpose of this course is to understand the theory and processes of negotiation so that you can negotiate successfully in organizational and management settings. This course covers a wide variety of negotiation problems faced by business people. In addition, models of effective and ineffective decision-making are introduced and students will have the opportunity to make decisions at both the individual and group levels.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Technology Strategy",
        "subjectCode": "MGMT",
        "courseCode": "44810",
        "instructor": [
            "Luis Adrian Rios"
        ],
        "description": "  In today's business environment, success is driven by a firm's ability to create and capture value through innovation. This course seeks to develop tools for understanding how firms and industries evolve through new technology. This award-winning course uses an experiential team-based approach. Student teams pick a firm early in the semester and become experts in it by understanding how each framework we learn impacts its performance. The class is very interactive and there are various presentations throughout the semester. Ultimately students gain a deep understanding of the processes used by firms to develop new technologies, the choices they make regarding how to commercialize their knowledge, and the strategies they use to position and build a dominant competitive position.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Legal Background For Business I",
        "subjectCode": "MGMT",
        "courseCode": "45500",
        "instructor": [
            "Miltina Ann Gavia",
            "Cecelia Marie Harper"
        ],
        "description": "The nature and place of law in our society, national and international, social and moral bases of law enactment, regulation of business, legal liability, and enforcement procedures. Special emphasis on torts, contracts, and agency. No credit to students in the School of Management.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "International Management",
        "subjectCode": "MGMT",
        "courseCode": "45900",
        "instructor": [
            "Wan Ting Chiu"
        ],
        "description": "This course focuses on the challenges top managers face in developing strategies and management policies in multinational corporations (MNCs). Major topics usually covered include foreign market entry strategies, motivations and organizational challenges of internationalization, analyzing global industries, managing MNC/host government relations, building competitive advantage in global industries, international alliances and acquisitions, structuring and controlling MNCs, risk management, and the country manager role.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Advanced Manufacturing Planning And Control Systems",
        "subjectCode": "MGMT",
        "courseCode": "46200",
        "instructor": [
            "Manohar S Madan"
        ],
        "description": "An intensive individual computer lab supplements lectures examining the role of computerized information and control systems in manufacturing. An elaborate series of case studies, enlivened by advanced computer simulations, bring together production planning, master scheduling, materials planning, short-range capacity planning, production floor execution, and quality control. Students plan and execute the production and purchasing of all parts, aided by an integrated MRP/capacity planning/shop-floor control system built into the computer simulation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Strategic Sourcing And Procurement",
        "subjectCode": "MGMT",
        "courseCode": "46501",
        "instructor": [
            "Zhan Pang"
        ],
        "description": "<a href=\"javascript:history.go(-1)\" onmouseover=\"window.status='Return to Previous';  return true\" onfocus=\"window.status='Return to Previous';  return true\" onmouseout=\"window.status='';  return true\" onblur=\"window.status='';  return true\">Return to Previous</a>",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Big Data & Cloud Computing",
        "subjectCode": "MGMT",
        "courseCode": "46700",
        "instructor": [
            "Alok R Chaturvedi"
        ],
        "description": "Cloud computing and big data technologies are rapidly enhancing an organization's business intelligence ecosystem. Two modules of the course are specially designed for students to gain valuable hands-on experience in collecting, cleaning, formatting, integrating, and storing massive amounts of data that may be structured or unstructured, archived, or streaming in a cloud platform. The first module will introduce cloud computing fundamentals, its enabling technologies, main building blocks, and hands-on experience through projects utilizing Google Cloud Platform (GCP). The second module will cover processes for creating data pipelines in GCP so that the student will be able to curate big data for training, analysis, and prediction using AI/ML and other data science techniques.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Advanced Spreadsheet Modeling And Simulation",
        "subjectCode": "MGMT",
        "courseCode": "47200",
        "instructor": [
            "Gary Mercado Velasco"
        ],
        "description": "This course covers up-to-date and practical spreadsheet modeling tools that can be applied to a wide variety of business problems from finance, marketing, and operations. The topical coverage consists of the following five modules: (1) Excel functions, skills and financial models; (2) deterministic and stochastic optimization techniques to determine the best managerial actions under internally-and/or externally-imposed constraints; (3) probability distribution fitting techniques to find the most likely description of the uncertainty in future business; (4) simulation modeling techniques to discover and analyze the risk and uncertainties in business environment and processes; (5) application of spreadsheet modeling and simulation techniques in forecasting asset dynamics( stock price) and pricing options and real investment opportunities. This course provides hands-on experience of computer application using Microsoft Excel and the spreadsheet add-ins @RISK, RISKOptimizer, SimQuick, etc.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Data Mining",
        "subjectCode": "MGMT",
        "courseCode": "47300",
        "instructor": [
            "Zhiwei Zhu"
        ],
        "description": "Students follow a structured analytical process using popular industry tools (e.g., RStudio, Tableau, SQL) to identify, visualize, and summarize relationships within large data sets to support business problems. More focus is on descriptive analytics which includes business segmentation and clustering methods, but also introduces two predictive analytic methods, decision trees, and neural networks.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Predictive Analytics",
        "subjectCode": "MGMT",
        "courseCode": "47400",
        "instructor": [
            "Tongseok Lim"
        ],
        "description": "Students build and evaluate predictive models to support regression-type and classification-type business problems using popular industry tools (e.g., RStudio, SAS Enterprise Miner). Methods covered include multiple linear regression, ridge regression, lasso, CART, logistic regression, LDA/QDA, SVM, and ensemble methods such as random forests.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Management Of Entrepreneurial Ventures",
        "subjectCode": "MGMT",
        "courseCode": "48400",
        "instructor": [
            "Sugato Chakravarty"
        ],
        "description": "This course teaches skills required to become an entrepreneur, succeed in a start-up venture, work in venture capital, join a family business, or develop a franchise operation. Students will learn about how to identify and shape emerging market opportunities, innovate new business models, prepare and evaluate business plans, raise capital, build a skilled founding team, network for resources, and grow an initial market.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Data-Driven Decisions In Digital Markets",
        "subjectCode": "MGMT",
        "courseCode": "48800",
        "instructor": [
            "Ilango Guru Muniasamy"
        ],
        "description": "This course analyzes the changes in business models that have been enabled by Internet technologies, and exposes students to hands-on data analyses to quantify the impact these technologies and business models have on firms, economies, and people.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Intellectual Property Management",
        "subjectCode": "MGMT",
        "courseCode": "49200",
        "instructor": [
            "Cara C Putman"
        ],
        "description": "Intellectual property (IP) has become a strategic opportunity for creating value for the firm. Firms are tasked with understanding how to utilize intellectual property as a competitive advantage in multiple market contexts. In the current economic environment, intellectual assets can be the largest portion of a firm's total wealth. Strategic management of these assets is very critical. Managing intellectual property is about transforming a firm's ideas, know-how, etc., into learning, products, and ultimately cash flow. In Managing Intellectual Property, we examine this topic by viewing intellectual property as both a legal asset (property ownership) and business asset (value-adding). The focus of Managing Intellectual Property is on the integration of IP generation, IP protection, and strategizing functions of the firm in creating value with an IP portfolio. Concepts and frameworks discussed/developed in lecture are exercised in case studies from multiple contexts.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Advanced Accounting",
        "subjectCode": "MGMT",
        "courseCode": "50300",
        "instructor": [
            "Michael Kregar"
        ],
        "description": "Advanced course in financial accounting. A range of contemporary issues in financial reporting, such as business combinations, investments, consolidations, inflation, multinationals, and tax allocation are covered. Both technical proficiency and user applications are emphasized.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Tax Accounting",
        "subjectCode": "MGMT",
        "courseCode": "50400",
        "instructor": [
            "John T Eagan"
        ],
        "description": "Basic tax course designed to provide an understanding of the various federal taxes, including income, gift, estate, excise, federal insurance contribution, self-employment, and unemployment taxes.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Management Accounting II",
        "subjectCode": "MGMT",
        "courseCode": "50500",
        "instructor": [
            "Rahul Sukumar Menon"
        ],
        "description": "The focus of the course is managerial decision making and the economic role of information. Topics covered include decentralized financial performance evaluation, cost analysis, and financial planning and control systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Auditing",
        "subjectCode": "MGMT",
        "courseCode": "50600",
        "instructor": [
            "Troy D Janes"
        ],
        "description": "A study of the concepts and procedures of auditing, which is the systematic process of objectively obtaining and evaluating evidence regarding assertions about economic actions and events. Primary emphasis is on audits conducted by independent certified public accountants, but topics covered apply to internal auditing as well.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "International Accounting",
        "subjectCode": "MGMT",
        "courseCode": "50900",
        "instructor": [
            "Michael Kregar"
        ],
        "description": "Provides insight into and an understanding of the many accounting problems and issues faced in an international business environment. The material is approached from two compatible and overlapping perspectives: the perspective of accounting or financial management in a U.S. multinational corporation and the perspective of an investor interested in understanding the international business environment.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Brand Management",
        "subjectCode": "MGMT",
        "courseCode": "52100",
        "instructor": [
            "Chad Ruel Allred"
        ],
        "description": "This course exposes students to the issues and activities in brand management. Topics include developing the brand marketing plan, design and execution of integrated marketing communications, testing, launching, and repositioning of brands, creating and managing brand equity, formulating strategies for leveraging and defending brands, product line and category management.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "New Product Development",
        "subjectCode": "MGMT",
        "courseCode": "52200",
        "instructor": [
            "William T Robinson"
        ],
        "description": "The course covers new product development issues including idea generation, concept testing, prototype development, patent protection, and product launch. Student teams generate a new product idea, test the idea with target customers, and develop a product launch strategy.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Digital Marketing Strategy",
        "subjectCode": "MGMT",
        "courseCode": "52300",
        "instructor": [
            "Qiang Liu"
        ],
        "description": "This course enables students to rethink marketing in the evolving digital age and develop capabilities in developing, implementing, and evaluating digital marketing strategies. Topics include: digital marketing strategy framework, search engine marketing, social media marketing, and location based marketing (mobile).",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Marketing Analytics",
        "subjectCode": "MGMT",
        "courseCode": "52500",
        "instructor": [
            "Weijia Dai"
        ],
        "description": "This course equips students with quantitative and analytical techniques, and statistical software tools required for implementing marketing concepts such as segmentation, targeting, product positioning and product design. It trains students to use a data and analytics driven systematic approach for solving real marketing decision problems.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Data-Driven Marketing",
        "subjectCode": "MGMT",
        "courseCode": "52610",
        "instructor": [
            "Guofang Huang"
        ],
        "description": "<a href=\"javascript:history.go(-1)\" onmouseover=\"window.status='Return to Previous';  return true\" onfocus=\"window.status='Return to Previous';  return true\" onmouseout=\"window.status='';  return true\" onblur=\"window.status='';  return true\">Return to Previous</a>",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Government/Not-For-Profit Accounting",
        "subjectCode": "MGMT",
        "courseCode": "53100",
        "instructor": [
            "R Scott Sorensen"
        ],
        "description": "This course is designed to provide students with a solid understanding of the financial reporting and accounting principles used in the preparation of governmental and not-for-profit entities. Topics include, but are not limited to, fund accounting, city government accounting, state government accounting, special funds, budgetary accounting for the general and special revenue funds, fiduciary funds and government-wide statements, university accounting, accounting for community foundations, not-for-profit accounting, and auditing not-for-profit entities.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Analytics For Social Media Marketing",
        "subjectCode": "MGMT",
        "courseCode": "53900",
        "instructor": [
            "Jinsuh Lee"
        ],
        "description": "The objective of this course is to equip students with tools and develop marketing skills required to address current marketing problems. The approach is to learn R software for conducting basic scraping on social media sites to understand user behavior and sentiment. In addition, Python will be used for web-scraping data from various websites and websites with dynamic content. The goal is to become familiar with such qualitative techniques as: word clouds, cluster dendrograms, sentiment analysis, and other methods. Occasional homework assignments or check points will be given to gain deeper understanding of the materials covered in class.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Database Management Systems",
        "subjectCode": "MGMT",
        "courseCode": "54400",
        "instructor": [
            "Jinyang Zheng"
        ],
        "description": "Covers the theory and practice of database design and usage. Students will learn the importance of data modeling concepts and how to use these effectively and how to plan and design a database, including issues such as data security and control. The following course is recommended: MGMT 29000 Programming for Business Applications or CS 15900 or CS 17700 or CNIT 17500, all with a C- or higher.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Leading Management Of Diversity And Inclusion In Organizations",
        "subjectCode": "MGMT",
        "courseCode": "55500",
        "instructor": [
            "Ellen E Kossek"
        ],
        "description": "This course is designed to help students more effectively manage self, peers, teams, clients and firms in diverse organizational settings and lead change. People and leaders in organizations are constantly working with members of different backgrounds, social identities, and experiences, fostering increased attention to diversity and inclusion in an employment and organizational context. [1] For example, women represent over half of the labor for 57% (BLS, 2018) [2] but are severely under-represented at senior management levels and in high-paying technical and professional fields (Kossek & Buzzanell, 2018) [3]. Ethnic and racial minorities are also severely under-represented. The U.S. population is increasingly diverse as 40% of the population identifies as racial or ethnic minorities (U.S. Bureau of Census, 2019) including African-American (13.4%), Hispanic-American (18.3%), Asian-American (5.9%), American Indian or Alaska Native (1.3%), and European American (60%) as well as a growing number of individuals who identify with more than one race or ethnicity (U.S. Bureau of Census, 2019) [4]. Further, 26% of the population has some form of disability, and 16% are over the age of 65 (U.S. Bureau of Census, 2018). Many other minority groups can face workplace marginalization challenges such as veterans, minority religious group members (Muslims, Jews, Hinduism; Catholic; Latter-day Saints), immigrants, people with mental or intellectual disabilities, & LGBTQ persons (Stone, Lukaszewski, & Dulebohn, 2020)[5]. When leveraged effectively, these differences in social identity and values can help attract and retain talent, strengthen societal and community economic equality, support organizational and team effectiveness; but when overlooked, or mismanaged, these differences can increase turnover, conflict, stress, talent under-utilization, and harm career and work-life well-being, and productivity. The class focuses on management of gender and diversity for inclusion and equity from an individual employee, leader and team/organizational perspective in a workplace context. The goal of this class is to take a multi-level approach to help you learn how to lead the management of diversity and inclusion through a) improving your ability to work in diverse teams, as well as b) developing your ability to lead, develop, and implement strategies to foster cultural and structural change to support the management of gender and diversity toward enhanced organizational effectiveness. Men, as well as women, majority and minority individuals, will be able to leverage the skills taught in this course when making their own career decisions, as well as when managing, being managed by, or collaborating with others; or leading and changing organizations to support new ways of working. We integrate multiple levels and lenses to understand diversity and inclusion. From an individual leadership perspective, we tackle the question: \"Why does diversity matter in employing organizations and business, what is the state-of-the-art evidence-based knowledge, and what does it mean to me personally in my career and my leadership beliefs.\" Specifically, we focus on the business and social science processes - including attitudes toward in-groups and out-groups, stereotyping, identity, privilege, and power, intersectionality, discrimination, bias, equity influence opportunity, bystander awareness, and perspective taking - this affects how members of different social groups perceive and interact with one another. Since managing social identity increasingly involves managing work-life boundaries and work and non-work public and private selves, we will also learn about authenticity choices and social and public/professional identity boundary management. From an organizational and group perspective, we address the question: \"What are best practices for successful diversity management?\" We will focus on organizational and institutional structures and cultures and their relations to strategies for creating diversity through management practices; how to create an inclusive culture and positive climate for inclusion and talent management, and developing and retaining diverse talent and foster innovation and organizational effectiveness across multiple levels of intervention (individual, group, intergroup, organizational, and societal). We discuss how to conduct an organizational diagnosis of the current diversity climate and barriers and facilitators for creating a multicultural workplace and a flexible environment supportive of many identities, and how assumptions may vary across industry and cultural contexts.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Manufacturing Planning And Control",
        "subjectCode": "MGMT",
        "courseCode": "56000",
        "instructor": [
            "Amy B David"
        ],
        "description": "An advanced course in manufacturing planning and control systems, emphasizing the integration of demand forecasting, inventory control, production scheduling, and production control. Topics are linked through case studies and an elaborate manufacturing computer simulation game.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Logistics",
        "subjectCode": "MGMT",
        "courseCode": "56100",
        "instructor": [
            "Zhan Pang"
        ],
        "description": "<a href=\"javascript:history.go(-1)\" onmouseover=\"window.status='Return to Previous';  return true\" onfocus=\"window.status='Return to Previous';  return true\" onmouseout=\"window.status='';  return true\" onblur=\"window.status='';  return true\">Return to Previous</a>",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Project Management",
        "subjectCode": "MGMT",
        "courseCode": "56200",
        "instructor": [
            "Manohar S Madan"
        ],
        "description": "Emphasizes the use of PC-based project management software and its applications, particularly in manufacturing organizations and especially new product development projects. Extensive use is made of several case studies to illustrate the planning and monitoring of a project. Class is held in a computer lab.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Strategic Sourcing And Procurement",
        "subjectCode": "MGMT",
        "courseCode": "56500",
        "instructor": [
            "Qi Feng"
        ],
        "description": "This course will address the process of procurement including terminology, metric, and decision making. Additionally, we will investigate the best practices and processes for managing the relationships with suppliers and their performance. We will also explore the sourcing decision and the strategic ramifications of producing/ providing goods and services internally or purchasing them from external organizations. Prerequisites: Students are expected to have taken a basic course on operations (such as the masters core class MGMT 66000: Introduction to Operations Management) and a basic course on supply chain management (such as the masters elective MGMT 66400: Supply Chain Management).",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Global Supply Chain Management",
        "subjectCode": "MGMT",
        "courseCode": "56600",
        "instructor": [
            "Amy B David"
        ],
        "description": "This course will integrate issues from marketing (channels of distribution), logistics, and operations management to develop a broad understanding of a supply chain in a global context. Students will learn how different factors, including exchange rate risk, custom duty and trading policies, geographic distribution of resources and demand, availability and reliability of local supplier, and characteristics of consumer, affect the design and execution of global supply chain strategies. Prerequisites: Students are expected to have taken a basic course on operations (such as the masters core class MGMT 66000: Introduction to Operations Management) and a basic course on supply chain management (such as the masters elective MGMT 66400: Supply Chain Management). Exposure to a course on optimization is also preferred, but not required. The course requires logical and analytical thinking.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Data Mining",
        "subjectCode": "MGMT",
        "courseCode": "57100",
        "instructor": [
            "Wei Sun"
        ],
        "description": "Introduces the concepts, techniques, tools, and applications of data mining. The material is approached from the perspective of a business analyst, with an emphasis on supporting tactical and strategic decisions. Includes a variety of techniques to identify nuggets of information or decision-making knowledge in bodies of data, and extracting these in such a way that they can be put to use in the area, such as decision support, prediction, forecasting, and estimation.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Management Of Organizational Data",
        "subjectCode": "MGMT",
        "courseCode": "58200",
        "instructor": [
            "Yang Wang"
        ],
        "description": "Provides the basic concepts and skills needed to analyze and organize business data, as well as to utilize the organized data to answer a variety of business queries. After successful completion, students will have an understanding of why database management is important and what it entails, how to analyze the data requirements of a business scenario and represent these requirements by means of entity-relationship (ER) diagrams, translate an ER diagram into normalized relations for a relational database management system, write simple and relatively complex data retrieval commands in the SQL language for an Oracle database, use Microsoft Access as a front end to a server database in Oracle, be familiar with several selected topics of current interest in the data management arena.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Python Programming",
        "subjectCode": "MGMT",
        "courseCode": "58600",
        "instructor": [
            "Shoaib Amjad Khan"
        ],
        "description": "Because data grows exponentially and becomes complex, we need computational methods to collect, store, and analyze them in order to be successful in science, engineering, business, and other professions. Python Programming, is an introductory programming class that meets this need. You will learn how to write computer programs in Python language to solve real-world problems. This class is designed for students that want to learn to computer programming for data science. This course guides students through the basic Python programming language, from initial concepts to final data analysis using python and external packages.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Analyzing Unstructured Data",
        "subjectCode": "MGMT",
        "courseCode": "59000",
        "instructor": [
            "Alok R Chaturvedi",
            "Jinyang Zheng",
            "Kasie M Roberson",
            "Matthew A Lanham",
            "Zaiyan Wei",
            "Mohammad Saifur Rahman",
            "Stephan Robert Biller"
        ],
        "description": "Credit Hours: 1.00 to 4.00 (West Lafayette, North Central) 2.00 to 4.00 (Calumet).  Supervised reading and reports in various subjects. Open only to a limited number of seniors and graduate students. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Launching Global Leaders",
        "subjectCode": "MGMT",
        "courseCode": "59100",
        "instructor": [
            "Brian K Chupp"
        ],
        "description": "Capitalizing on the unique personal and professional backgrounds of each student in our program, the Launching Global Leaders course provides a comprehensive and customizable leadership development curriculum. In this year long course, students will engage in a 360 assessment of strategically identified professional competencies critical to success in the contemporary workforce. Using these target areas as a guide, students will then customize their leadership development experience by selectively engaging in a variety of program offerings, including: interactive industry simulations, personal and team performance enhancement tools, professional coaching, interactive learning sessions with industry leaders, and workshops in developing intercultural competency, personal branding and career management.",
        "capacity": 0,
        "credits": [
            0,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Accounting For Managers",
        "subjectCode": "MGMT",
        "courseCode": "60000",
        "instructor": [
            "John T Eagan"
        ],
        "description": "Credit Hours: 2.00 or 3.00 (West Lafayette) 3.00 (Calumet, North Central).  The two-course accounting sequence employs a user's perspective on the firm's database. First, the standard accounting model is developed into a working tool, as no prior study of accounting is assumed. Then illustrative business cases are discussed to show how external reports conform to financial contracts and public regulation. Public reports primarily directed to investors and creditors are analyzed to reconstruct the economic events and managerial decisions underlying generally accepted accounting standards. Prerequisite: Masters student standing and Management majors only.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Valuation And Financial Statement Analysis",
        "subjectCode": "MGMT",
        "courseCode": "60200",
        "instructor": [
            "Kevin J Koharki"
        ],
        "description": "Establishes how to use accounting information to make business and investment decisions. Internally, the information is used to assess performance of units, to evaluate performance of upper-level management, to monitor the firm's investment and financing decisions, and for comparison purposes with the firm's rivals. Externally, accounting information is used by financial analysts, investors and (potential) acquirers to assess the value of the firm, by creditors to assess its credit-worthiness, and by regulators. Prerequisite: MGMT 60000, 60100.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Financial Management",
        "subjectCode": "MGMT",
        "courseCode": "61000",
        "instructor": [
            "Alexander W Boquist"
        ],
        "description": "Analysis of short-term working capital needs. Cash budgeting procedures, pro forma statements, major types of short-term loan arrangements, and short-term asset management. Prerequisite: MGMT 60000, Master's student standing or higher and Management and Computational Finance majors only.",
        "capacity": 0,
        "credits": [
            0,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Advanced Corporate Finance",
        "subjectCode": "MGMT",
        "courseCode": "61100",
        "instructor": [
            "Fabricio R R D'Almeida"
        ],
        "description": "Credit Hours: 2.00 to 4.00 (West Lafayette, Calumet) 3.00 (North Central).  Long-term capital structure planning, capital budgeting, treatment of uncertainty in investment decisions, security underwriting, dividend policies, and mergers. Prerequisite: MGMT 61000.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Seminar In Managerial Finance I",
        "subjectCode": "MGMT",
        "courseCode": "61801",
        "instructor": [
            "Sergiy Chernenko"
        ],
        "description": "This is the first in a sequence of four PhD level finance courses that cover theoretical empirical research in managerial finance. Offered in alternate years.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Seminar In Managerial Finance II",
        "subjectCode": "MGMT",
        "courseCode": "61802",
        "instructor": [
            "Ping Liu"
        ],
        "description": "This is the second in a sequence of four PhD level finance courses that cover theoretical empirical research in managerial finance. Offered in alternate years. Prerequisite: MGMT 61801.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Marketing Management",
        "subjectCode": "MGMT",
        "courseCode": "62000",
        "instructor": [
            "Wreetabrata Kar"
        ],
        "description": "Credit Hours: 2.00 to 4.00 (West Lafayette and Calumet) 3.00 (North Central).  The objective of this course is to familiarize students with the methods and frameworks necessary to execute strategic plans in a marketing context. Marketing managers must be able to properly identify the needs of their given consumer base and design strategic plans to align the different dimensions of the marketing mix; such as pricing, promotional campaigns, product characteristics, and the necessary distribution channels, while taking into consideration the offerings of the competitors. To this end, we offer an immersive course, which leverages both lectures and case discussions, to enhance the thought process and presentation of hallmark marketing frameworks.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Marketing Research",
        "subjectCode": "MGMT",
        "courseCode": "62500",
        "instructor": [
            "Jinsuh Lee"
        ],
        "description": "Credit Hours: 2.00 to 4.00 (West Lafayette) 3.00 (Calumet).  The purpose of this course is to develop skills in the planning and execution of market research studies designed to acquire useful information for marketing decisions. It aims to familiarize students with techniques of research design, data collection, and analysis. Emphasis is placed on evaluating the results obtained from such investigations. Prerequisite: MGMT 67000.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Seminar In Marketing Models",
        "subjectCode": "MGMT",
        "courseCode": "62600",
        "instructor": [
            "Federico Rossi",
            "Qiang Liu"
        ],
        "description": "Treatment of theoretical marketing models. Study of marketing models in research setting. Prerequisite: MGMT 62000, 67200.",
        "capacity": 0,
        "credits": [
            2,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Accounting For Private Equity",
        "subjectCode": "MGMT",
        "courseCode": "63150",
        "instructor": [
            "Bryan J Wright"
        ],
        "description": "  The course offers students with knowledge of private equity services that accounting firms provide to clients. It covers investment banking, buy- and sell-side due diligence, M&A tax services, business valuations, etc.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Business Law For Accountants",
        "subjectCode": "MGMT",
        "courseCode": "63400",
        "instructor": [
            "Cecelia Marie Harper"
        ],
        "description": "This course is designed to help prepare students for their professional careers by familiarizing them with aspects of the law that are directly relevant to the practice of accounting. These topics are not only at work every day in business but are also tested on professional examinations such as the Uniform Certified Public Accounting (CPA) Exam. Specific topics include, but are not limited to, contract law, relevant provisions of the Uniform Commercial Code, bankruptcy, and the legal liability of accountants. The course will be taught through a mixture of lectures and class discussions. Students are expected to come to class having completed the assigned readings and ready to  participate in class discussions.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Financial Statement Analysis And Valuation",
        "subjectCode": "MGMT",
        "courseCode": "63450",
        "instructor": [
            "Kevin J Koharki"
        ],
        "description": "This course is designed to prepare students to become intelligent financial statement users. Understanding how market participants use financial statements will assist professionals in their primary tasks of creating and communicating financial information to these individuals.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Options And Futures",
        "subjectCode": "MGMT",
        "courseCode": "64100",
        "instructor": [
            "Alexander W Boquist"
        ],
        "description": "Rigorous and applied coverage of the pricing and hedging of options and futures contracts with applications. Prerequisite:  MGMT 61000.",
        "capacity": 0,
        "credits": [
            2,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Portfolio Management",
        "subjectCode": "MGMT",
        "courseCode": "64200",
        "instructor": [
            "Huseyin Gulen"
        ],
        "description": "Methods of analysis of common stocks and bonds for individual and institutional portfolios. Review of the empirical evidence of security market efficiency, and implications of that evidence for various methods of security analysis. Team projects to analyze the economy, the particular industry or sector, and selected firms within the industry or sector, and to make specific buy-hold-sell recommendations for the stocks and bonds of those firms. Prerequisite: MGMT 61000.",
        "capacity": 0,
        "credits": [
            2,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Venture Capital And Investment Banking",
        "subjectCode": "MGMT",
        "courseCode": "64400",
        "instructor": [
            "Fabricio R R D'Almeida"
        ],
        "description": "Examines the process of corporate value creation through financial policy choices. The sequence of topics roughly parallels the life cycle of a typical corporation. Begins by studying the financing of entrepreneurial companies. Then studies the investment banking and capital acquisition process employed for public securities issues. Also examines capital acquisition and reorganization decisions, such as the use of hybrid securities like convertible debt and PIPEs, project financing bankruptcy reorganizations, and equity structurings. Prerequisite: MGMT 61000.",
        "capacity": 0,
        "credits": [
            2,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Mergers, Acquisitions, And Corporate Control",
        "subjectCode": "MGMT",
        "courseCode": "64500",
        "instructor": [
            "Sergiy Chernenko"
        ],
        "description": "Focuses on firms' internal governance structures and on pressure from the external market for corporate control, including executive compensation, board of directors' composition, shareholder activism, mergers, and takeovers. Prerequisite: MGMT 61000.",
        "capacity": 0,
        "credits": [
            2,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "HR Strategy",
        "subjectCode": "MGMT",
        "courseCode": "65330",
        "instructor": [
            "Brian K Chupp"
        ],
        "description": "Survey of theory and techniques used in human resource management within organizations. Emphasis is placed on HRM, Strategic HRM, Managing Human Resources Globally, and Strategically Managing Human Resource Functions.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Staffing Systems",
        "subjectCode": "MGMT",
        "courseCode": "65350",
        "instructor": [
            "Michael A Campion"
        ],
        "description": "Examines all aspects of the staffing process beginning with applicant recruitment and ending with termination and outplacement. Emphasis on building skills that the general manager will need to evaluate, design, and implement these activities. Designed for the future manager, as well as the future HR professional. Topics will be addressed from an individual perspective, as well as an organizational perspective. Prerequisite: OBHR 63100 or OBHR 63300 or MGMT 65310.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "HR Analytics",
        "subjectCode": "MGMT",
        "courseCode": "65390",
        "instructor": [
            "Lindsay Mechem Rosokha"
        ],
        "description": "This course provides an introduction to the field of HR analytics. HR Analytics is an advanced set of data analysis methodologies, tools, and metrics for comprehensive workforce performance measurement and improvement. The objective of HR analytics is to drive evidence-based decisions and action in the workplace. In addition to your instructor, you may hear from expert practitioners and corporate leaders who have \"been there and done that\" leveraging a myriad of HR analytics along the way. We will also review (and hopefully expand) your understanding of handling data including conceptualizing models, identifying key metrics, collecting data, analyzing data, and presenting data in ways that tell a powerful story. Throughout our course, I will infuse consulting concepts, methodologies, and lessons learned that combined with your analytic skills will help you to effectively serve as an HR Business Partner (internal HR consultant).",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Training And Development",
        "subjectCode": "MGMT",
        "courseCode": "65410",
        "instructor": [
            "Brian K Chupp"
        ],
        "description": "This course prepares students to design training and develop training programs and to identify principles, practices and methods of staff training and career development. Students will learn and practice how to deliver and evaluate said programs for return on investment (ROI). Emphasis is placed on the application of principles related to adult learning instructional design and program development, evaluation and learning technologies. Specific objectives include topics related to communication, diversity, generational differences and group dynamics.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Leadership",
        "subjectCode": "MGMT",
        "courseCode": "65420",
        "instructor": [
            "Kelly S Wilson"
        ],
        "description": "Examines organizational leadership responsibilities, forms of leadership, the acquisition, use, and consequences of power, critical leader skills, and how corporate environments shape leadership. Emphasis on self-discovery and development of managerial leadership knowledge and skills.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Talent Acquisition",
        "subjectCode": "MGMT",
        "courseCode": "65460",
        "instructor": [
            "Michael A Campion"
        ],
        "description": "This course focuses on the effective management of the flow of talent into and through organizations. It covers workforce planning, recruiting and selection, career transitions, and other workforce movement. It is designed to teach students the skills to recruit and select the best talent to help drive organizational strategy. Students will also learn how to design a process and framework for final individual or group selection. Lastly, they will learn several strategies to successfully orient and onboard new employees.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Operations Management",
        "subjectCode": "MGMT",
        "courseCode": "66000",
        "instructor": [
            "Pengyi Shi"
        ],
        "description": "Credit Hours: 2.00 to 4.00 (West Lafayette) 3.00 (Calumet, North Central).  As goods and services are produced and distributed, they move through a set of inter-related operations or processes in order to match supply with demand. The design of these operations for strategic advantage, investment in improving their efficiency and effectiveness, and controlling these operations to meet performance objectives is the domain of Operations Management. The primary objective of the course is to provide an overview of this important functional area of business. Prerequisite: MGMT 67000, 67100.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Management Of Operating Systems",
        "subjectCode": "MGMT",
        "courseCode": "66100",
        "instructor": [
            "Amy B David"
        ],
        "description": "A project course in which students are exposed to a variety of operations problems as they arise in a real world setting. The focus of the course is problem formulation, analysis, and proposal(s) of an implementable scheme for their resolution. Prerequisite: MGMT 66000.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Business Analytics",
        "subjectCode": "MGMT",
        "courseCode": "67000",
        "instructor": [
            "Gary W Evans",
            "Kwei Tang"
        ],
        "description": "Introduction to quantitative decision procedures under uncertainty. Applications of descriptive statistics, probability models, simulation models, interval estimates, and hypothesis testing to management problems. Managerial-oriented cases are used in instruction. Prerequisite: Master's student standing and Management majors only.",
        "capacity": 0,
        "credits": [
            2,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Information Technology For Innovations And Competitive Advantage",
        "subjectCode": "MGMT",
        "courseCode": "68300",
        "instructor": [
            "Yu J Hu"
        ],
        "description": "The important technological issues of computing are presented. The emphasis is on the impact of technology on the organization. Topics include problem organization and complexity, database management, operating systems, data communications, and privacy. Research projects on an assigned topic provide greater depth of coverage of certain topics.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Developing A Global Business Strategy",
        "subjectCode": "MGMT",
        "courseCode": "68800",
        "instructor": [
            "Wan Ting Chiu"
        ],
        "description": "Provides an introduction regarding the business and strategy challenges faced by managers in our global economy, regardless of whether the firm is a small domestic company or a large multi-national. Major topics for the course include motivations and challenges of internationalization, international business fundamentals, foreign market entry strategies, organizing across countries, analyzing global industries, building competitive advantage in global industries, and the influence of culture and institutions. Prerequisite: MGMT 65000.",
        "capacity": 0,
        "credits": [
            2,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "OM Seminr&Brown Bag Series PHD",
        "subjectCode": "MGMT",
        "courseCode": "69000",
        "instructor": [
            "J George Shanthikumar",
            "Michael Kregar",
            "Kasie M Roberson",
            "Qi Feng",
            "Weibin Mo",
            "Mehmet Deniz Yavuz",
            "Phillip Guy Baeza",
            "Shuaiyu Chen",
            "Benjamin B Dunford",
            "Douglas E Pruim",
            "Amir Sariri",
            "Troy D Janes",
            "Ping Liu",
            "Mohammad Saifur Rahman",
            "Umit Ozmel Yavuz"
        ],
        "description": "Advanced investigation in a specific management field at the graduate level.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Strategic Mgmt Workshp",
        "subjectCode": "MGMT",
        "courseCode": "69100",
        "instructor": [
            "Wooyong Jo",
            "Amir Sariri",
            "Qiang Liu"
        ],
        "description": "Advanced investigation in a specific management field at the graduate level. For students in the master's programs in management who are registered in the master's program summer session. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Managerial Communication Skills",
        "subjectCode": "MGMT",
        "courseCode": "69200",
        "instructor": [
            "Aryca Peay Woodson"
        ],
        "description": "Enhances student professionalism in managerial contexts by improving oral communication skills by developing strong oral presentation techniques.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    }
]