[
    {
        "title": "Introduction To The Army",
        "subjectCode": "MSL",
        "courseCode": "10100",
        "instructor": [
            "Michael D Churchill"
        ],
        "description": "  An introduction to the army, the profession of arms, and basic soldier skills. Students learn what it means to be a professional in the U.S. Army. The overall focus is introducing them to the Army Leadership Requirements Model and the Reserve Officers' Training Corps (ROTC) program, its purpose in the Army, and its advantages for the student. Other topics include map reading, land navigation, fieldcraft, first aid, and individual/team movement techniques.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Leadership And Ethics",
        "subjectCode": "MSL",
        "courseCode": "20100",
        "instructor": [
            "Sam A Dirienzo"
        ],
        "description": "An examination of leadership and ethics through the study and analysis of famous leaders. Army values and ethics and their relationship to the Law of Land Warfare is stressed. Emphasizes the philosophy of military service and how military leaders can apply values and ethics to a variety of situations they might encounter in the Army.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Training Management And The Warfighting Function",
        "subjectCode": "MSL",
        "courseCode": "30100",
        "instructor": [
            "Michael D Churchill"
        ],
        "description": "Examines how the Army operates through warfighting functions. Emphasizes planning, preparing, and executing training for small-unit tactics.",
        "capacity": 0,
        "credits": [
            3,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "The Army Officer",
        "subjectCode": "MSL",
        "courseCode": "40100",
        "instructor": [
            "Amie Bashant"
        ],
        "description": "An examination of Army officer development to include planning, resourcing, and assessing training at the small-unit level. Topics include counseling subordinates, evaluating performance, values and ethics, career planning, legal responsibilities, and programs that support Army officers in these endeavors.",
        "capacity": 0,
        "credits": [
            3,
            4
        ],
        "term": "Fall 2023"
    }
]