[
    {
        "title": "Introduction to Nuclear Engineering",
        "subjectCode": "NUCL",
        "courseCode": "20000",
        "instructor": [
            "Allen L Garner"
        ],
        "description": "A course designed to acquaint students with the field of nuclear engineering and design. Concepts of fission, fusion, radioactivity, and neutron physics are introduced. Modern applications of nuclear technology, including nuclear medicine, food preservation, space reactors and propulsion.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Mechanics Of Materials",
        "subjectCode": "NUCL",
        "courseCode": "27300",
        "instructor": [
            "Martin A Lopez-De-Bertodano"
        ],
        "description": "Analysis of stress and strain; equations of equilibrium and compatibility; stress-strain laws; extension, torsion, and bending of bars; membrane theory of pressure vessels; combined loading conditions; transformation of stresses and principal stresses; elastic stability, elected topics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Sophomore Seminar",
        "subjectCode": "NUCL",
        "courseCode": "29800",
        "instructor": [
            "Seungjin Kim"
        ],
        "description": "Career areas in nuclear engineering, job opportunities, areas of related study, topics of current interest, orientation, professional ethics, and responsibility.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Nuclear Structure And Radiation Interactions",
        "subjectCode": "NUCL",
        "courseCode": "30000",
        "instructor": [
            "Rusi P Taleyarkhan"
        ],
        "description": "Review of atomic properties and introduction to nuclear models. Discussion of radioactive decay and the interaction of nuclear radiation and reaction products with matter. Energetics and cross-sections of nuclear reactions with applications to problems typical of nuclear engineering.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Nuclear Engineering Undergraduate Laboratory II",
        "subjectCode": "NUCL",
        "courseCode": "30500",
        "instructor": [
            "Stylianos Chatzidakis"
        ],
        "description": "Continuation of NUCL 20500. Experiments with scintillation detectors, multichannel analyzers, neutron detectors, the subcritical pile, and the reactor will be performed. Measurements will be made to demonstrate neutron activation analysis techniques, neutron slowing down, neutron flux distributions, and the effects of control rods on neutron fluxes.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Materials For Nuclear Applications",
        "subjectCode": "NUCL",
        "courseCode": "32000",
        "instructor": [
            "Yi Xie"
        ],
        "description": "Nuclear environments and materials selection for nuclear applications, bonding, crystal structure and symmetry, defects and irradiation, chemical thermodynamics, phase equilibria, phase transformations, and corrosion in nuclear systems and design.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Nuclear Materials Laboratory",
        "subjectCode": "NUCL",
        "courseCode": "32500",
        "instructor": [
            "Xiaoyuan Lou"
        ],
        "description": "Nuclear materials laboratory that evaluates various characterization techniques and technologies, tensile properties, hardness, fracture toughness, microstructures, X-ray diffraction, electron microscopy, mechanical properties of thin-films, NDE techniques and data acquisition in materials characterization techniques.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Nuclear Thermal-Hydraulics I",
        "subjectCode": "NUCL",
        "courseCode": "35000",
        "instructor": [
            "Seungjin Kim"
        ],
        "description": "The first of an integrated two-course sequence introducing the concepts of nuclear reactor thermal transport and associated hydraulics with applications to design and safety. Macroscopic balances, dimensional analysis, and flow measurement. Fluid behavior, momentum transfer, and applications to reactor systems and design.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Junior Seminar",
        "subjectCode": "NUCL",
        "courseCode": "39800",
        "instructor": [
            "Seungjin Kim"
        ],
        "description": "Continuation of NUCL 29800.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Engineering Of Nuclear Power Systems",
        "subjectCode": "NUCL",
        "courseCode": "40200",
        "instructor": [
            "Rusi P Taleyarkhan"
        ],
        "description": "Principles and practice of power plant systems with design applications; thermal cycles, heat transport, mechanical designs, control, safety analysis, shielding analysis, fuel cycles; resources, optimization, options, waste management. Fusion and alternate energy sources.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Reactor Theory And Applications",
        "subjectCode": "NUCL",
        "courseCode": "41000",
        "instructor": [
            "Hany S Abdel-Khalik"
        ],
        "description": "Intermediate treatment of reactor theory and its relevance to routine design engineering calculations, including introduction to transport theory, criticality evaluation, multi-group theory, isotopic depletion, and concludes with short overview of multi-level reactor design calculations, critical experiments, and treatment of neutronic uncertainties. List of Topics: Derivation of Boltzmann transport equation, and its reduction to steady state and time dependent diffusion equation. Introduction to multi-group theory, and evaluation of group parameters in both wide and narrow resonance approximations. Introduction to homogenization theory, and evaluation of lattice parameters. Evaluation of criticality condition for bare and reflected reactor geometries. Development of discretization techniques for the time-dependent multi-group diffusion theory equation. Reactor kinetics, reactivity coefficients and reactivity balance equation. Flowchart of multi-level reactor design calculations. Introduction to critical experiments and startup reactor physics test. Sources and treatment of uncertainties in reactor calculations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Radiation Interaction With Materials And Applications",
        "subjectCode": "NUCL",
        "courseCode": "42001",
        "instructor": [
            "Ahmed Hassanein"
        ],
        "description": "Fundamental of radiation interaction with materials and applications, types of radiation and radiation sources, physical mechanisms of radiation interaction with solids, radiation damage, ion mixing, applications in nuclear fission and fusion reactors, applications in materials synthesis.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Senior Design Proposal",
        "subjectCode": "NUCL",
        "courseCode": "44900",
        "instructor": [
            "Hitesh Bindra"
        ],
        "description": "The course outcome is the writing and presentation of a proposal for the senior design project, NUCL 45000. The tasks include the selection of project design topics (various nuclear engineering components and systems designs), the selection of teams, introduction to design process, team management, communication, and engineering ethics, literature and patents survey, initiation of design activities and familiarization with design tools (for example software).",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Sim Nucl Reactor Phys",
        "subjectCode": "NUCL",
        "courseCode": "49700",
        "instructor": [
            "Yunlin Xu"
        ],
        "description": "Topics vary. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Senior Seminar",
        "subjectCode": "NUCL",
        "courseCode": "49800",
        "instructor": [
            "Seungjin Kim"
        ],
        "description": "Lectures to acquaint the senior students with professional ethics, job opportunities, graduate schools, continuing study, and services of professional societies.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Nuclear Engineering Principles",
        "subjectCode": "NUCL",
        "courseCode": "50100",
        "instructor": [
            "Hany S Abdel-Khalik"
        ],
        "description": "A first course for graduate students desiring a nuclear engineering sequence and an elective for students in science or engineering. The course is structured in four parts: (1) Nuclear structure and radiation, biological effects and medical applications of radiation. (2) Basics of neutron and reactor physics, neutron diffusion and reactor criticality. (3) Nuclear materials and waste. (4) Reactor systems and safety.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Mass, Momentum, And Energy Transfer In Energy Systems",
        "subjectCode": "NUCL",
        "courseCode": "55100",
        "instructor": [
            "Mamoru Ishii"
        ],
        "description": "Formulations for analyzing complicated thermal-hydraulic phenomena in energy systems. Derivation of two-phase flow field equations and constitutive relations. Thermal-hydraulic modeling of nuclear reactor systems. Analyses of nuclear reactor safety related phenomena based on conservation principles.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Fusion Technology",
        "subjectCode": "NUCL",
        "courseCode": "56000",
        "instructor": [
            "Chan K Choi"
        ],
        "description": "Introduction to electricity and magnetism, magneto-fluid-mechanics and plasma physics. Thermonuclear reactions, power balances, macroscopic and microscopic instabilities. Principles of operation and conceptual design of Tokamaks, Mirror, Theta-Pinch, and Laser-Driven fusion reactors.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Neural Computing In Engineering",
        "subjectCode": "NUCL",
        "courseCode": "57500",
        "instructor": [
            "Lefteri Tsoukalas"
        ],
        "description": "Mathematical fundamentals of computing with neural networks. Survey of engineering applications. Computational metaphors from biological neurons. Artificial neural networks modeling of complex, nonlinear and ill-posed problems. Emphasizes engineering utilization of neural computing to diagnostics, control, safety, and decision-making problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Beam Target Interactions",
        "subjectCode": "NUCL",
        "courseCode": "59700",
        "instructor": [
            "Ahmed Hassanein"
        ],
        "description": "Development of individual research and study projects. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Inertial Confinement Fusion Technology",
        "subjectCode": "NUCL",
        "courseCode": "66100",
        "instructor": [
            "Chan K Choi"
        ],
        "description": "Inertially confined thermonuclear fusion reactions and energy gains; laser-plasma interactions; hydrodynamic compression; energy transports including electron thermal conduction and radiation transport; beam transport and instabilities; driver energy deposition and the driver development for lasers, particle beams and accelerators; and target designs. Approval of Instructor required. Prerequisite: NUCL 56000 or equivalent.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Nuclear Engineering Seminar",
        "subjectCode": "NUCL",
        "courseCode": "69600",
        "instructor": [
            "Seungjin Kim"
        ],
        "description": "Discussion by graduate students and invited speakers of their research projects and topics of interest in nuclear engineering.  Prerequisite: Master's student standing and Nuclear Engineering majors only.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Adv Tpc Reactor Sty II",
        "subjectCode": "NUCL",
        "courseCode": "69700",
        "instructor": [
            "Mamoru Ishii"
        ],
        "description": "Courses on topics of contemporary importance or special interest in nuclear engineering. Hours and credits to be arranged. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2023"
    }
]