[
    {
        "title": "Introduction To Organizational Behavior",
        "subjectCode": "OBHR",
        "courseCode": "33000",
        "instructor": [
            "Joel Munoz",
            "Kinshuk Sharma",
            "Jinfeng Chen",
            "Lindsay Mechem Rosokha",
            "Jonathan G Ying"
        ],
        "description": "This course investigates the impact that individuals, groups, and organizational structure have on behavior within organizations for the purpose of applying such knowledge toward improving an organization's effectiveness. Attention is given to such topics as motivation, leadership, group processes, organizational structure, technological innovation, and conflict management. Emphasis is placed on developing management skills and application of organizational behavior theories.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Labor Relations",
        "subjectCode": "OBHR",
        "courseCode": "42900",
        "instructor": [
            "James B Dworkin"
        ],
        "description": "The course focuses on employee-employer relations. Attention is given to topics in legal aspects of union organizing and collective bargaining, labor unions history and structure in the United States, labor management negotiations, dispute resolution procedures, international labor relations, and labor-management cooperation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Research Methods I",
        "subjectCode": "OBHR",
        "courseCode": "60500",
        "instructor": [
            "Meredith Lauren Woehler"
        ],
        "description": "An introduction to research methods. This seminar examines the use of research methods to develop empirical tests for theoretical and practical issues. It includes readings and discussions on the philosophy of science, reliability, validity, research design, threats to research, ethics, and other issues in research methodology. Students formulate hypotheses and an original research design to test their hypotheses.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Managing Behavior In Organizations",
        "subjectCode": "OBHR",
        "courseCode": "68100",
        "instructor": [
            "Bradley J Alge"
        ],
        "description": "Individual and group behavior are the central components of the study of behavior in organizations. Focus is on the managerial application of knowledge to issues such as motivation, group processes, leadership, organizational design structure, and others. The course employs cases, exercises, discussions, and lectures. Prerequisite: Master's student standing and Management majors only.",
        "capacity": 0,
        "credits": [
            2,
            4
        ],
        "term": "Fall 2023"
    }
]