[
    {
        "title": "Critical Thinking And Ethics",
        "subjectCode": "OLS",
        "courseCode": "34600",
        "instructor": [
            "Jennifer S Linvill",
            "Kyle A Ochs"
        ],
        "description": "A course in complex problem solving and creative thinking with an emphasis on the ethical impacts of these solutions.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Training Methods",
        "subjectCode": "OLS",
        "courseCode": "37500",
        "instructor": [
            "Tammy J Wolf",
            "Paul A Asunda"
        ],
        "description": "Principles, practices, and methods of employee training. Introduction to systematic training program design, development, and evaluation. Emphasis is on the supervisor as a trainer.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Labor And Management Relations",
        "subjectCode": "OLS",
        "courseCode": "37800",
        "instructor": [
            "Brandon Carlyle Grant"
        ],
        "description": "An introduction to, and overview of, the fundamental concepts of labor relations, collective bargaining, and dispute resolution procedures. An international comparative analysis is used to assess some of the legal, economic, and political structures of labor relations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Leadership For Organizational Change And Innovation",
        "subjectCode": "OLS",
        "courseCode": "38600",
        "instructor": [
            "John S Hutcheson"
        ],
        "description": "Introduction to and overview of fundamental concepts of leading organizational change and innovation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Advanced Project Management",
        "subjectCode": "OLS",
        "courseCode": "45000",
        "instructor": [
            "Steven R Dunlop"
        ],
        "description": "An introduction to project management concepts and practices in the context of human resource development projects.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Gender And Diversity In Management",
        "subjectCode": "OLS",
        "courseCode": "45400",
        "instructor": [
            "Kyle A Ochs",
            "Regena L Scott"
        ],
        "description": "The work force of the future will represent multiple differences including gender, race, culture, ethnicity, physical abilities, and age. Following this broad-based perspective of diversity, this course will focus on using knowledge of diversity to develop the leadership potential of individuals in organizations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Conflict Management",
        "subjectCode": "OLS",
        "courseCode": "47700",
        "instructor": [
            "Abrar Hammoud"
        ],
        "description": "A study of the methods for dealing with innerpersonal, interpersonal, and political disputes by means generally outside the traditional court system. Students will investigate the theoretical and practical aspects of conflict assessment, negotiation, problem solving, mediation, and arbitration.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Leadership Philosophy",
        "subjectCode": "OLS",
        "courseCode": "48700",
        "instructor": [
            "Christopher Nelson Bittinger"
        ],
        "description": "A review of current managerial, education, and development theories and practices; discussions of fundamental social, economic, and political changes affecting business and the art of managing; implications of these changes for individual development and continued growth.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Coaching And Mentoring In Organizations",
        "subjectCode": "OLS",
        "courseCode": "58300",
        "instructor": [
            "Regena L Scott"
        ],
        "description": "This course explores issues and practices in technologically-driven organizations pertaining to the roles and functions that coaching and mentoring play in employee development. A \"best practices\" approach, utilizing the case method, is emphasized. Presented from the point of view of a human resource manager/leader, the focus of the course is on identifying coaching opportunities, enhancing communication skills, developing and implementing coaching and mentoring strategies, and evaluating the outcomes of these strategies. Attention is directed to facilitating personal coaching mentoring skills. Course may be offered in traditional, distance, or blended format. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    }
]