[
    {
        "title": "The Big Questions: Introduction To Philosophy",
        "subjectCode": "PHIL",
        "courseCode": "11000",
        "instructor": [
            "Daniel R Kelly"
        ],
        "description": "The basic problems and types of philosophy, with special emphasis on the problems of knowledge and the nature of reality. CTL:ISH 1050 Introduction To Philosophy",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "I Play, Therefore I Am: Introduction To Philosophy Through Video Games",
        "subjectCode": "PHIL",
        "courseCode": "11005",
        "instructor": [
            "Javier Gomez-Lavin"
        ],
        "description": "This course uses video games to demonstrate many of the fundamental problems of philosophy. To better understand the philosophical problems presented in text, students will watch online walkthroughs and live demonstrations of video games in class. Students will also engage with these problems through active learning by occasionally playing video games.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Ethics",
        "subjectCode": "PHIL",
        "courseCode": "11100",
        "instructor": [
            "Daniel H Frank"
        ],
        "description": "A study of the nature of moral value and obligation. Topics such as the following will be considered: different conceptions of the good life and standards of right conduct; the relation of nonmoral and moral goodness; determinism, free will, and the problem of moral responsibility; the political and social dimensions of ethics; the principles and methods of moral judgment. Readings will be drawn both from contemporary sources and from the works of such philosophers as Plato, Aristotle, Aquinas, Butler, Hume, Kant, and J. S. Mill. CTL:ISH 1051 Ethics",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Global Moral Issues",
        "subjectCode": "PHIL",
        "courseCode": "11400",
        "instructor": [
            "Maria Rose Waggoner"
        ],
        "description": "A systematic and representative examination of significant contemporary moral problems with a focus on global issues such as international justice, poverty and foreign aid, nationalism and patriotism, just war, population and the environment, human rights, gender equality, and national self-determination.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Principles Of Logic",
        "subjectCode": "PHIL",
        "courseCode": "15000",
        "instructor": [
            "Dana Tulodziecki"
        ],
        "description": "A first course in formal deductive logic; mechanical and other procedures for distinguishing good arguments from bad. Truth-tables and proofs for sentential (Boolean) connectives, followed by quantificational logic with relations. Although metatheoretic topics are treated, the emphasis is on methods.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Philosophy Of Religion",
        "subjectCode": "PHIL",
        "courseCode": "20600",
        "instructor": [
            "Paul R Draper"
        ],
        "description": "The course encourages critical reflection on traditional and contemporary views about God and other religious ideas. Topics include arguments for God's existence, the problem of evil, understanding the divine attributes, miracles, religious pluralism, and life after death.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Ethics For Technology, Engineering, And Design",
        "subjectCode": "PHIL",
        "courseCode": "20700",
        "instructor": [
            "Maria Rose Waggoner"
        ],
        "description": "This course is designed to increase your understanding of professional and ethical responsibilities in national, international and cross-cultural environments, helping you to anticipate, understand, and navigate issues that will likely arise in your working life as an engineer or designer. The focus of the course is on developing the ability to apply a general ethical framework to new and unique situations, including those arising from the global cultural context of modern engineering. The course covers how this ethical framework should be constituted, and provides practice in applying this framework to specific, concrete cases. Together, these components work toward your development as a better engineer and more responsible global citizen. The readings, case studies and exercises are geared towards the development of a well-researched original case study that you will present to the class, which is informed by your past experiences and future aspirations related to engineering.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Ethics Of Data Science",
        "subjectCode": "PHIL",
        "courseCode": "20800",
        "instructor": [
            "James Paul Messina"
        ],
        "description": "As applications of data science permeate more aspects of our lives, new and important ethical issues are arising. However, especially because we are entering uncharted territory, reasoning clearly about the ethical implications of data science isn't easy. This course provides students with the tools for doing so, including a conceptual framework for ethical reasoning in professional settings, as well as a procedure for case-study analysis that allows students to practice employing this conceptual framework. Together, these components help prepare students to be ethical professionals and responsible global citizens.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Philosophy And The Meaning Of Life",
        "subjectCode": "PHIL",
        "courseCode": "21900",
        "instructor": [
            "James Paul Messina"
        ],
        "description": "  Does life have meaning? If so, in what sense? If not, does this matter? Does the answer depend on the existence of God and an afterlife? What, if anything, makes existence worthwhile? Might the question - 'does life have meaning?' - be malformed? This course explores these and related questions, as well as answers to them, with the aim of teaching students to think critically and rigorously about matters of perennial existential importance. In previous iterations of this course, readings have been chosen from the following writers: Kierkegaard, Nietzsche, Dostoevsky, Kafka, Marcel, Heidegger, Camus, Sartre, Jaspers, de Beauvoir, Ortega, and Merleau-Ponty.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Philosophy Of Science",
        "subjectCode": "PHIL",
        "courseCode": "22100",
        "instructor": [
            "Dana Tulodziecki"
        ],
        "description": "An introduction to the scope and methods of science and to theories of its historical development. Topics include scientific revolutions, theories of scientific method, the nature of scientific discovery, explanation, and the role of values in scientific change.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Religions Of The East",
        "subjectCode": "PHIL",
        "courseCode": "23000",
        "instructor": [
            "Thomas W Ryba"
        ],
        "description": "(REL 23000) A study of the history, teachings, and present institutions of the religions of India, Southeast Asia, China, and Japan. This will include Hinduism, Jainism, Sikhism, Buddhism, Confucianism, Taoism, Shintoism, and Zoroastrianism.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Religions Of The West",
        "subjectCode": "PHIL",
        "courseCode": "23100",
        "instructor": [
            "Thomas W Ryba"
        ],
        "description": "(REL 23100) A comparative study of the origins, institutions, and theologies of the three major Western religions, Judaism, Christianity, and Islam.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Social And Political Philosophy",
        "subjectCode": "PHIL",
        "courseCode": "24000",
        "instructor": [
            "Leonard Harris"
        ],
        "description": "A study of some major social and political philosophers from Plato to contemporary authors. Issues such as justice, rights and freedom, community, and the \"globalized\" future will be considered.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Philosophy And Law",
        "subjectCode": "PHIL",
        "courseCode": "26000",
        "instructor": [
            "Michael L Jacovides"
        ],
        "description": "A discussion of philosophical issues in the law: a critical examination of such basic concepts in law as property, civil liberty, punishment, right, contract, crime and responsibility; and a survey of some main philosophical theories about the nature and justification of legal systems. Readings will be drawn from both law and philosophy.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Biomedical Ethics",
        "subjectCode": "PHIL",
        "courseCode": "27000",
        "instructor": [
            "Lynn Parrish"
        ],
        "description": "An examination of the moral problems raised by developments in medicine and the biomedical sciences. Topics include abortion, reproductive technologies, euthanasia and physician-assisted suicide, experiments involving human subjects, and health care delivery.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Philosophy Of AI",
        "subjectCode": "PHIL",
        "courseCode": "29300",
        "instructor": [
            "Corey John Maley"
        ],
        "description": "A critical examination of some special topic or topics in philosophy. Details concerning topics selected for treatment in a given semester may be obtained in advance from the Department of Philosophy. Sections of this course may sometimes be initiated by students upon petition to the department.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "History Of Ancient Philosophy",
        "subjectCode": "PHIL",
        "courseCode": "30100",
        "instructor": [
            "Lea Aurelia Schroeder",
            "Jacqueline Marina"
        ],
        "description": "A survey of Greek philosophy from its beginning in the Milesian school through the Presocratics to Plato and Aristotle.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "History Of Modern Philosophy",
        "subjectCode": "PHIL",
        "courseCode": "30300",
        "instructor": [
            "Jan A Cover",
            "Michael L Jacovides"
        ],
        "description": "Concentrates on the major philosophical writers from the Renaissance to the beginning of the nineteenth century: Descartes, Hobbes, Spinoza, Locke, Leibniz, Berkeley, Hume, Kant. Some in other areas, e.g., Galileo, Newton, Calvin, are also considered.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Nineteenth-Century Philosophy",
        "subjectCode": "PHIL",
        "courseCode": "30400",
        "instructor": [
            "Jacqueline Marina"
        ],
        "description": "A study of the major movements and directions of nineteenth-century philosophy, including such figures as Hegel, Comte, Mach, Schopenhauer, Nietzsche, Mill, Royce and Peirce.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Philosophy And Probability",
        "subjectCode": "PHIL",
        "courseCode": "35000",
        "instructor": [
            "Paul R Draper"
        ],
        "description": "This course introduces the student to mathematical probability and its philosophical applications. Topics may include theories of probability, Hume's problem of induction, Goodman's paradox, and the foundations of scientific reasoning.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Metaphysics",
        "subjectCode": "PHIL",
        "courseCode": "42500",
        "instructor": [
            "Jan A Cover"
        ],
        "description": "A concentrated investigation of some of the basic problems concerning essence, existence, time, space, substance, causality, permanence, and change. Readings and discussions will center on representative metaphysical thinkers.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Philosophy Of Mind",
        "subjectCode": "PHIL",
        "courseCode": "43500",
        "instructor": [
            "Daniel R Kelly"
        ],
        "description": "An examination of some central issues in the philosophy of mind. Attention is given to such topics as the knowledge of other minds, the relation between mind and body, the nature of persons, and the analysis of certain relevant concepts such as action, emotion, and perception. Readings are selected primarily from the writings of contemporary philosophers.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Philosophy Of Race",
        "subjectCode": "PHIL",
        "courseCode": "49000",
        "instructor": [
            "Leonard Harris"
        ],
        "description": "An advanced study of a significant topic in philosophy.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Studies In Greek Philosophy",
        "subjectCode": "PHIL",
        "courseCode": "50100",
        "instructor": [
            "Lea Aurelia Schroeder"
        ],
        "description": "The subject matter will alternate between the intensive study of some fairly specific topic in Greek philosophy (e.g., Plato's theory of knowledge, Aristotle's ethics, etc.) and a general study of either the philosophy of Plato or the philosophy of Aristotle.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Studies In Medieval Philosophy",
        "subjectCode": "PHIL",
        "courseCode": "50200",
        "instructor": [
            "Richard Jordan Lavender"
        ],
        "description": "An intensive study of some central topics in the thought of major medieval philosophers. Subject matter will vary. Philosophers most often studied are Augustine, Thomas Aquinas, Duns Scotus, and Ockham.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Reading Philosophy: Skills And Strategies",
        "subjectCode": "PHIL",
        "courseCode": "56100",
        "instructor": [
            "Gabriele Dillmann"
        ],
        "description": "Repeatable twice for a maximum of 9 credits. Academic philosophy demands both the ability to read large amounts of texts fluently, carefully, and closely. Furthermore, the abstract nature of philosophical discourse places a large cognitive demand upon readers. This course prepares non-native English speakers philosophy students for these intensive reading demands. The course has three major learning areas:  the language skills that students need to read fluently (i.e., the efficient processing of language for general comprehension of meaning); reading strategies that students can use to improve comprehension and learning; and communication about readings, as the close reading of texts is essential to communicating one's ideas both orally and in writing. Students are also supported in their regular philosophy courses. This course is linked to one or more 500+ level philosophy seminars that students in this course are enrolled in. Reading materials, writing activities, and projects for the course are designed to complement tasks and projects required in the linked philosophy seminar. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Writing To Learn",
        "subjectCode": "PHIL",
        "courseCode": "57100",
        "instructor": [
            "Gabriele Dillmann"
        ],
        "description": "Repeatable twice for a maximum of 9 credits. Writing on a higher academic level can be especially challenging for non-native English-writers. Thus, this course aims to develop students' graduate-level skillsets in philosophical practices in an English language environment to help them gain confidence and become productive members of the philosophical community. Students will learn writing processes that will aid their ability to effectively compose in English, including developing a thesis statement, outlining, drafting, formatting, and editing. As all four chief skillsets in second-language proficiency development work in tandem and enhance each other, the course will rely on writing, reading, speaking, listening, and presenting work for learning and further developing these advanced language skills. Students are also supported in their regular philosophy courses. This course is linked to one or more 500+ level philosophy seminars that students in this course are enrolled in. Reading materials, writing activities, and projects for the course are designed to complement tasks and projects required in the linked philosophy seminar. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Philosophy Of AI",
        "subjectCode": "PHIL",
        "courseCode": "58000",
        "instructor": [
            "Corey John Maley"
        ],
        "description": "Designed primarily for majors in philosophy who have already successfully completed six hours in philosophy. Other students may be admitted to the course with the special consent of the instructor in charge. Topic to be selected by the department.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Seminar In Recent Continental Philosophy",
        "subjectCode": "PHIL",
        "courseCode": "61000",
        "instructor": [
            "Daniel W Smith"
        ],
        "description": "An intensive, critical examination of some of the current modes of thought in recent continental philosophy, including phenomenology, critical theory, hermeneutics, deconstruction, and postmodernism. Selected writings from representative figures. Topics and texts will vary from semester to semester. Prerequisite: PHIL 51000 or 52000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Reason And Cognition",
        "subjectCode": "PHIL",
        "courseCode": "68000",
        "instructor": [
            "Javier Gomez-Lavin"
        ],
        "description": "An intensive course for graduate students majoring or minoring in philosophy. The content of the seminar will be determined in accordance with the needs and interests of the students. Prerequisite: 6 credit hours at the graduate level in Philosophy.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    }
]