[
    {
        "title": "Introduction To The Science And Fields Of Psychology",
        "subjectCode": "PSY",
        "courseCode": "10000",
        "instructor": [
            "Colin Thomas William"
        ],
        "description": "An introduction to psychology as a science and as a profession.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Elementary Psychology",
        "subjectCode": "PSY",
        "courseCode": "12000",
        "instructor": [
            "George J Hollich",
            "Jill E Gulker",
            "Colin Thomas William"
        ],
        "description": "Introduction to the fundamental principles of psychology, covering particularly the topics of personality, intelligence, emotion, abnormal behavior, attention, perception, learning, memory, and thinking. As part of their learning experience, students participate in psychological experiments. CTL:ISH 1020 Introduction To Psychology",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Beyond Mental Health: The Science Of Well-Being",
        "subjectCode": "PSY",
        "courseCode": "12300",
        "instructor": [
            "Sien Chieh Tay"
        ],
        "description": "This course seeks to provide a scientific and psychological account of well-being - its definition, determinants, and outcomes. We address questions such as: How do we go about measuring happiness? Can happiness enhance longevity and health? What interventions can promote happiness? What types of societies are happier? This course will engage and challenge students not only intellectually, but also experientially as we work on enhancing happiness in our lives and in the lives of others around us.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Cognitive Psychology",
        "subjectCode": "PSY",
        "courseCode": "20000",
        "instructor": [
            "Gregory S Francis",
            "Sebastien Helie"
        ],
        "description": "A survey of psychology as the science of mental life, covering theories and research in perception, reading, attention, consciousness, imagery, memory and its improvement, problem solving, creativity, decision-making, and artificial intelligence.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Statistics In Psychology",
        "subjectCode": "PSY",
        "courseCode": "20100",
        "instructor": [
            "Melissa J Swisher",
            "Gregory S Francis",
            "Corrinne C Lim-Kessler"
        ],
        "description": "An introduction to the development and application of statistical, quantitative, and measurement techniques pertinent to the psychological sciences. Fundamental concepts of numerical assignment, sampling theory, distribution functions, experimental design, inferential procedures, and statistical control. Should be taken at Purdue University, West Lafayette.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Research Methods In Psychology",
        "subjectCode": "PSY",
        "courseCode": "20300",
        "instructor": [
            "Melissa J Swisher"
        ],
        "description": "The use of scientific method in psychology. Lecture covers principles of collecting and interpreting data, using examples of research from many areas of psychology. In the laboratory portion, the student uses many different techniques from various areas of psychology. Should be taken at Purdue University, West Lafayette.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Behavioral Neuroscience",
        "subjectCode": "PSY",
        "courseCode": "22200",
        "instructor": [
            "Corrinne C Lim-Kessler"
        ],
        "description": "An introduction to how the nervous system controls behavior. Topics include evolution and comparative psychobiology, the neuroscience of sensation and perception, the neuroscience of motivation, neuropsychology, and cognitive neuroscience.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Child Psychology",
        "subjectCode": "PSY",
        "courseCode": "23500",
        "instructor": [
            "George J Hollich"
        ],
        "description": "Not open to students with credit in PSY 36000. General principles of children's behavior and development, from conception to adolescence, including sensory and motor development, and basic psychological processes such as learning, motivation, and socialization.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Social Psychology",
        "subjectCode": "PSY",
        "courseCode": "24000",
        "instructor": [
            "Teri Ann Kirby"
        ],
        "description": "Not open to students with credit in SOC 34000. A broad survey in current knowledge about human social behavior. Topics covered include aggression, attraction and love, social influence, attitudes and attitude change, nonverbal communication, leadership, prejudice and discrimination, and application of social psychology to law, medicine, and other fields. CTL:ISH 1024 Social Psychology",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Industrial-Organizational Psychology",
        "subjectCode": "PSY",
        "courseCode": "27200",
        "instructor": [
            "Jerod Cody White"
        ],
        "description": "Survey of psychological principles and research methods relevant to organizations and industry. Topics covered include research methodology, individual differences, personnel selection, performance measurement, training, motivation, job satisfaction, emotions, work stress, and leadership.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Sensory And Perceptual Processes",
        "subjectCode": "PSY",
        "courseCode": "31000",
        "instructor": [
            "Yu-Chin Chiu"
        ],
        "description": "A survey of the study of psychological experiences caused by stimulation to the senses. Topics include theory and research in seeing, hearing, touching, smelling, and tasting as experienced by humans and other animals.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Learning",
        "subjectCode": "PSY",
        "courseCode": "31400",
        "instructor": [
            "Sydney Marie Trask"
        ],
        "description": "This course attempts to make clear the theoretical and practical implications of learning principles and findings. Various theories of learning are examined and the implications of these theories, and the learning approach generally, for a variety of practical problems are emphasized.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction Cognitive Neuroscience",
        "subjectCode": "PSY",
        "courseCode": "32400",
        "instructor": [
            "Hongmi Lee"
        ],
        "description": "(SLHS 30100) Introduction to the neural bases of complex human mental abilities. Emphasis on integrating research from cognitive science, brain-scanning techniques, and the lesion technique. Topics include perception, attention, memory, language, motor control, planning/decision-making and consciousness.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Stereotyping And Prejudice",
        "subjectCode": "PSY",
        "courseCode": "33500",
        "instructor": [
            "Erin Sparks Ward"
        ],
        "description": "This course examines the topics of stereotyping, prejudice, and discrimination from a social psychological perspective. Relying on empirical findings and relevant theoretical approaches, the course moves beyond lay opinions to explore the social psychological foundations and forms of stereotyping and prejudice, and to examine various strategies for reducing intergroup biases.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Issues In Developmental Psychology",
        "subjectCode": "PSY",
        "courseCode": "33600",
        "instructor": [
            "George J Hollich"
        ],
        "description": "Survey of current issues in developmental psychology and methods for studying these problems. The topics selected for intensive examination reflect contemporary developmental research issues and may involve different-aged children or adults.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Social Cognition",
        "subjectCode": "PSY",
        "courseCode": "33700",
        "instructor": [
            "Jill E Gulker"
        ],
        "description": "A survey of theory and research on the role of thought processes in social behavior (a combination of social and cognitive psychologies). Topics include causal attribution, person perception, stereotyping, impression formation, event memory, and social judgment.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Psychology Of Personality",
        "subjectCode": "PSY",
        "courseCode": "34200",
        "instructor": [
            "William G Graziano"
        ],
        "description": "This course integrates empirical studies (observational, correlational, experimental) with classical and current personality theories. Topics include the biological foundations of personality, self-esteem, extraversion, sex role orientation, authoritarianism, and personality disorders. Minimum competence is assumed in basic experimental design and correlations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Abnormal Psychology",
        "subjectCode": "PSY",
        "courseCode": "35000",
        "instructor": [
            "Christopher I Eckhardt",
            "Colin Thomas William"
        ],
        "description": "Various forms of mental disorders from the standpoint of their origin, treatment, prevention, social significance, and relation to problems of normal human adjustment. CTL:ISH 1023 Abnormal Psychology",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Close Relationships",
        "subjectCode": "PSY",
        "courseCode": "35400",
        "instructor": [
            "Christopher R Agnew"
        ],
        "description": "This course introduces undergraduate college students to major topics in psychological research on intimate relationships. There are many types of close relationships. This primarily focuses on relationships that currently are, will be soon, or at one point were, romantic involvements. A goal is to educate students on current research findings concerning intimate relationships.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Eating Disorders & Obesity",
        "subjectCode": "PSY",
        "courseCode": "39200",
        "instructor": [
            "Corrinne C Lim-Kessler",
            "Kimberly P Kinzig",
            "Jennifer Lynn Brown",
            "Thekla Morgenroth",
            "Thomas S Redick"
        ],
        "description": "Various topics that may change from semester to semester are presented by Psychological Sciences department faculty.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Language And The Brain",
        "subjectCode": "PSY",
        "courseCode": "40100",
        "instructor": [
            "David L Kemmerer"
        ],
        "description": "(SLHS 40100) This course is an overview of the neutral systems that underlie the core components of language, including speech perception and production, reading and writing, morphology, syntax, semantics, and discourse. During the past few decades, there has been an unprecedented increase in studies on these topics, due in large part to the widespread use of highly sensitive brain mapping techniques that enable researchers to identify relationships between particular brain areas and particular language functions. The findings that have been emerged from this recent explosion of research are exciting and important for several reasons. They provide fresh insights into the nature of the uniquely human capacity for language, and they have significant implications for understanding and treating language disorders that result from brain injury.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Honors Research Seminar II",
        "subjectCode": "PSY",
        "courseCode": "40500",
        "instructor": [
            "Thomas S Redick"
        ],
        "description": "Part two of a research series aimed at providing a structured learning experience to help students develop the basic research skills needed in order to conduct psychological research. Students will be expected to develop a research plan to be completed in concert with PSY 40400. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Understanding Autism",
        "subjectCode": "PSY",
        "courseCode": "41800",
        "instructor": [
            "Brandon M Keehn"
        ],
        "description": "(HDFS 41800, SLHS 41800) This course will explore the etiology, neuroscience, diagnosis, and treatment of autism spectrum disorder (ASD). Approached from a multi-disciplinary perspective this course brings together gene, brain, and behavioral sciences with the aim of developing a better understanding of autism. The course will begin with an overview of ASD as a complex behavioral phenotype. This will include discussion of the history of ASD and the expansion of the diagnostic criteria associated with the disorder. This introduction will be followed by several classes in which we will examine some of the key domains of impairment in ASD: reciprocal social interaction, language and communication, and restricted and repetitive behaviors. We will also consider the deficits associated with, but not defining of ASD, and examine co-morbid conditions frequently present in individuals with ASD. We will then address the topics of brain architecture, neurochemistry, and genetics and gene expression, all of which we will attempt to relate back to the behavioral features of autism. We will end the course with a review of treatment practices and their efficacy and an examination of impact of ASD on the family and society.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Genes and Behavior",
        "subjectCode": "PSY",
        "courseCode": "42200",
        "instructor": [
            "Edward A Fox"
        ],
        "description": "An examination of genetic influences on behavior, including the mechanisms of genetic influence, methods of gene manipulation, and the role of genes in development and evolution. Genetic influences on mental illness, learning, memory, and intelligence are considered.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Language Development",
        "subjectCode": "PSY",
        "courseCode": "42600",
        "instructor": [
            "Amanda Rose Yuile"
        ],
        "description": "(SLHS 30900) Specific nature, sequence, and pattern of oral language development from birth through adolescence. Nature of language acquisition and approaches to the study of children's language are presented. Linguistic and psychological explanations of the sequence of development are discussed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Clinical Psychology",
        "subjectCode": "PSY",
        "courseCode": "43800",
        "instructor": [
            "David Rollock"
        ],
        "description": "This course introduces students to the field of clinical psychology and will provide a broad overview of the roles and responsibilities that fall under the rubric of clinical psychology, with a particular emphasis on psychological assessment and intervention. Focus is on the professional responsibilities of a clinical psychologist (i.e., how clinical psychology is applied in practice), rather than the study of psychopathology per se.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Research Ethics In Psychological Sciences",
        "subjectCode": "PSY",
        "courseCode": "46400",
        "instructor": [
            "Julia A Chester"
        ],
        "description": "Research Ethics broadly refers to the application of everyday values, such as fairness, honesty, and objectivity to scientific research. This course is designed to provide broad coverage of the ethical standards that research scientists must follow and allow exploration of various real-world ethical issues in the psychological sciences.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Professional Issues And Trends In Social Psychology",
        "subjectCode": "PSY",
        "courseCode": "50600",
        "instructor": [
            "Margo J Monteith"
        ],
        "description": "This course is designed to help students acculturate to and acquire a broad knowledge of social psychological research. Topics to be covered include but are not limited to: how to apply for academic jobs, how to present your program of research, how to network at conferences, how to develop a website presence, how to approach potential collaborators, and how to structure your research questions in an appropriate manner for grant applications. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Current Readings In Social Psychology",
        "subjectCode": "PSY",
        "courseCode": "50700",
        "instructor": [
            "Thekla Morgenroth"
        ],
        "description": "This course is designed to expose students to a variety of readings, discussions, and presentations. The seminar examines a diverse assortment of social psychological topics. Students benefit from exposure to current research and methods in the field. Students also benefit from becoming increasingly conversant regarding the latest empirical advances in the field. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Human Factors In Engineering",
        "subjectCode": "PSY",
        "courseCode": "57700",
        "instructor": [
            "Robert W Proctor"
        ],
        "description": "(IE 57700) Survey of human factors in engineering, with particular reference to human functions in human-machine systems, and consideration of human abilities and limitations in relation to design of equipment and work environments. Primarily for engineers and other non-psychology majors.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Diversity Science",
        "subjectCode": "PSY",
        "courseCode": "59100",
        "instructor": [
            "Teri Ann Kirby"
        ],
        "description": "Various topics that may change from semester to semester are presented by faculty in the Department of Psychological Sciences.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Psychopharmacology",
        "subjectCode": "PSY",
        "courseCode": "60300",
        "instructor": [
            "Julia A Chester"
        ],
        "description": "This course will cover core pharmacology concepts and principles, such as neurotransmitters, receptors, drug classes, and mechanisms of drug action, while highlighting recent findings related to pharmacogenetics and sex/gender differences in psychopharmacology. There will also be a primary focus on drug therapy for major psychiatric disorders including addiction, depression, anxiety and schizophrenia. Prerequisites: (BIOL 56200 and PSY 51200) or PSY 61500 or MCMP 57000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "ANOVA For The Behavioral Sciences",
        "subjectCode": "PSY",
        "courseCode": "60601",
        "instructor": [
            "Stephen B Broomell"
        ],
        "description": "This course is a first-semester graduate statistics course for students in psychology and related fields who conduct quantitative research. The course involves an accelerated review of fundamental concepts (e.g., data visualization, central limit theorem probability), after which the course will focus on statistical techniques for between- and within-person designs that include categorical independent variables (e.g., t-tests, ANOVA). Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Pro Seminar Cognitive/ MCP",
        "subjectCode": "PSY",
        "courseCode": "63300",
        "instructor": [
            "Yu-Chin Chiu"
        ],
        "description": "Critical analysis of current problems in experimental psychology. Emphasis upon reviewing literature, preparing and presenting papers. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Human Information Processing",
        "subjectCode": "PSY",
        "courseCode": "63700",
        "instructor": [
            "Darryl W Schneider"
        ],
        "description": "This course develops the methodological tools required for an information processing approach to human behavior. These techniques are applied to such topics as reaction time, signal detection, attention, and skilled behavior, with emphasis upon unifying empirical findings. Prerequisite: PSY 60000, 60100.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Survey Of Social Psychology I",
        "subjectCode": "PSY",
        "courseCode": "64000",
        "instructor": [
            "Ximena B Arriaga"
        ],
        "description": "An extensive survey of methods, research, and theory in social psychology.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Clinical Assessment I",
        "subjectCode": "PSY",
        "courseCode": "66700",
        "instructor": [
            "Douglas B Samuel"
        ],
        "description": "Presentation of general assessment principles and methods. Supervised practice in general diagnostic and treatment procedures as applied to both children and adults. Emphasis is placed on laboratory practice in the administration and interpretation of intelligence tests; behavioral observation techniques and operant remediation procedures. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Prosocial Behavior",
        "subjectCode": "PSY",
        "courseCode": "66900",
        "instructor": [
            "William G Graziano"
        ],
        "description": "This course is designed to provide a broad and rigorous, graduate-level overview of contemporary scientific research on prosocial processes from the perspective of personality and social psychology. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Principles And Techniques Of Psychotherapy",
        "subjectCode": "PSY",
        "courseCode": "67000",
        "instructor": [
            "James P Noll"
        ],
        "description": "Discussion and elaboration of the main theories and techniques of psychotherapy, the application of these techniques to the change of behavior, and the analysis of clinical cases for therapy planning.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Psychology Of Behavior Disorders",
        "subjectCode": "PSY",
        "courseCode": "67300",
        "instructor": [
            "Daniel J Foti"
        ],
        "description": "Advanced abnormal psychology. Consideration will be given to research and theory of psychopathology.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Structural Equation Modeling",
        "subjectCode": "PSY",
        "courseCode": "67400",
        "instructor": [
            "Susan C South"
        ],
        "description": "This is an advanced course in structural equation modeling (SEM), intended to provide doctoral students with an introductory treatment of the theory and methods of SEM. SEM is a statistical methodology that encompasses a wide variety of models, including path models, exploratory and confirmatory factor models, structural regression models, and latent growth models, among others. Prerequisites: PSY 61000 is highly recommended but not required. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Assessment Prac",
        "subjectCode": "PSY",
        "courseCode": "67900",
        "instructor": [
            "James P Noll",
            "Heather A Ciesielski"
        ],
        "description": "This is a practicum in clinical psychology, whereby students see individuals for therapy. These cases are supervised by faculty in clinical psychology. This is a requirement for the graduate program, and students must do both adult and child practicum. Students enrolled in this program must register for this course a minimum of four times. Prerequisite: Master's student standing and Psychology majors only. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Survey Of Industrial Psych",
        "subjectCode": "PSY",
        "courseCode": "68000",
        "instructor": [
            "Sien Chieh Tay"
        ],
        "description": "This two-semester sequence extensively surveys the various areas of industrial/organizational psychology. The first semester surveys those topics generally classified as dealing with industrial psychology (e.g., selection, placement, training, performance appraisal), and the second semester surveys organizational psychology topics (e.g., job satisfaction, motivation, leadership, decision making, role making). Course provides a critical and up-to-date review of recent and classical research in these areas. Prerequisite: Any undergraduate Statistics course and any undergraduate Social Science Research Methods course.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Pro-Sem Clinical Psy",
        "subjectCode": "PSY",
        "courseCode": "69200",
        "instructor": [
            "Anne B Sereno",
            "Susan C South",
            "Yk Hei Franki Kung",
            "Sebastien Helie"
        ],
        "description": "Various topics which may change from semester to semester are presented by faculty in the Department of Psychological Sciences.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Seminar In Neuroscience",
        "subjectCode": "PSY",
        "courseCode": "69600",
        "instructor": [
            "Susan E Swithers"
        ],
        "description": "The course is designed to expose graduate students to diverse areas of most up to-date research and hone their skills in understanding conceptual issues and tools used to study neuroscience. The students help host speakers and introduce speakers before their colloquium talk. The students will also formally present their own research to the area faculty and students once each year, at a level appropriate to their years in the program. Lastly, each student will write a \"journal club\" style paper on a recently published empirical study. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    }
]