[
    {
        "title": "Introduction To Public Health",
        "subjectCode": "PUBH",
        "courseCode": "10001",
        "instructor": [
            "Randolph Duane Hubach"
        ],
        "description": "This course serves as an introduction to the field of public health. Topics include identification of the principal determinants of health and how they affect individuals and populations, the role of government and public health professionals in health and healthcare, and critical and emerging issues in public health in the US and around the world.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Basic Public Health Studies",
        "subjectCode": "PUBH",
        "courseCode": "20500",
        "instructor": [
            "Beth Ann Walker"
        ],
        "description": "Examination of basic scientific concepts as applied to the problems and issues in selected areas of human health behavior with particular attention to their influence on population and individual health. Restricted to students enrolled in major degree programs for which this course is a requirement.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Contemporary Women's Health",
        "subjectCode": "PUBH",
        "courseCode": "22500",
        "instructor": [
            "Andrea DeMaria"
        ],
        "description": "Examines behavioral, psychological, and sociocultural aspects of women's experience in healthcare systems. Includes the influence of factors such as age, social class, and ethnicity on women's roles as recipients and providers of health care.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Community, Culture And Social Justice From A Public Health Perspective",
        "subjectCode": "PUBH",
        "courseCode": "23000",
        "instructor": [
            "Stewart C Chang Alexander"
        ],
        "description": "The course provides an introduction to the concepts of community, culture, and social justice. The interaction between community, cultural, ethical, social, economic, environmental, political and social justice dynamics that shape health will be explored.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Global Health",
        "subjectCode": "PUBH",
        "courseCode": "24000",
        "instructor": [
            "Afsan R Bhadelia"
        ],
        "description": "This course introduces students to current challenges, debates, and efforts at solutions in global public health with a focus on low-and middle-income countries. It provides an interdisciplinary overview of topics that include measures of health and disease, health disparities, communicable and non-communicable diseases, women's health, maternal and child health, food systems and nutrition, health systems, and global cooperation. It also highlights the central role of data in achieving the global health agenda. Permission of department required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Internship & Career Preparation",
        "subjectCode": "PUBH",
        "courseCode": "29500",
        "instructor": [
            "Beth Ann Walker"
        ],
        "description": "This course provides students with professional competencies in identification and development of professional resources that aid in a greater understanding and preparation for careers in public health. Upon completion of the course, students will be prepared to seek an internship and apply concepts learned to their professional development experiences.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Health Education In Elementary Schools",
        "subjectCode": "PUBH",
        "courseCode": "30500",
        "instructor": [
            "Kelley C Bailey"
        ],
        "description": "The problems of physical health, mental health, and safety of the school-aged child are considered, with emphasis on ways in which the elementary teacher meets his or her responsibilities and opportunities for promoting pupil health.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Health Behavior And Health Promotion",
        "subjectCode": "PUBH",
        "courseCode": "32000",
        "instructor": [
            "Monica Kasting"
        ],
        "description": "Introduces health behavior theory and practice in the context of health promotion and education. Examines individual, interpersonal, and community approaches to explaining and predicting health behavior and emphasizes their application to interventions in health promotion and education.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Public Health Research Methods",
        "subjectCode": "PUBH",
        "courseCode": "36500",
        "instructor": [
            "Kathryn Jean Laroche"
        ],
        "description": "The course is designed to help you (1) develop an understanding of the nature of research and the scientific method in public health, (2) acquire an appreciation for the different types of research conducted within public health, and (3) provide an overview of the ethical, conceptual, and logistical considerations involved in designing, conducting, and critically evaluating public health research in basic and applied settings.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Public Health Policy",
        "subjectCode": "PUBH",
        "courseCode": "38000",
        "instructor": [
            "Omobukola Otoise Usidame"
        ],
        "description": "This course will provide the opportunity to examine and analyze the financing, organization and delivery of health care in the U.S. and how these core elements are shaped and influenced by health care policy and decision-making.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Human Diseases And Disorders",
        "subjectCode": "PUBH",
        "courseCode": "40000",
        "instructor": [
            "Beth Ann Walker"
        ],
        "description": "The major communicable and noncommunicable diseases and disorders that afflict modern man, with particular emphasis upon the etiology, epidemiology, and ecology of these diseases and disorders.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Principles Of Epidemiology",
        "subjectCode": "PUBH",
        "courseCode": "40500",
        "instructor": [
            "Carlyn Marie Kimiecik"
        ],
        "description": "The study of the distribution of diseases in human populations and factors that influence these distributions.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Public Health",
        "subjectCode": "PUBH",
        "courseCode": "50000",
        "instructor": [
            "Carlos Cardell Mahaffey"
        ],
        "description": "This Public Health course covers a variety of issues related to the profession of public health. The Introduction to Public Health provides the graduate student with an overview of the history, science, mission, practice and future of public health. The core public health principles and services, and the expected competencies of the professional public health practitioner, are discussed. Current issues in public health are also presented for discussion and analysis.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Foundations Of Global Health",
        "subjectCode": "PUBH",
        "courseCode": "51100",
        "instructor": [
            "Natalia Maria Rodriguez"
        ],
        "description": "Global disparities in the health and well-being of diverse populations, across and within borders, has never been greater. Profound and rapid changes in demographics, from population growth to urbanization, along with unprecedented shifts in patterns of disease and risks, are coupled with game-changing advances in knowledge, technology, and innovation. This course will introduce students to current challenges and efforts at solutions in global health, with a focus on low- and middle-income countries. It will provide an interdisciplinary overview of topics that include measures of health and disease, communicable diseases such as HIV/AIDS and malaria, non-communicable diseases such as diabetes and cardiovascular disease, women's health, maternal and child health, food systems and nutrition, health systems, and health care delivery. In addition to lectures, the course will include interactive discussions of case studies and specific country examples, aimed at immersing students in the debates and challenges facing global health leaders and decision makers.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Child And Family Health Policy",
        "subjectCode": "PUBH",
        "courseCode": "54600",
        "instructor": [
            "Robert J Duncan"
        ],
        "description": "  The main goals of the course are to provide students with foundational knowledge related to research and policies that affect the health and well-being of children and families. Students will read and discuss policy-relevant research on current topics associated with child and family health. Students will read and discuss examples of researchers who have made an impact on child and family policies. Students will also write three papers that integrate research and policy perspectives.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Public Health Program And Policy Evaluation",
        "subjectCode": "PUBH",
        "courseCode": "54700",
        "instructor": [
            "Laura Schwab Reese"
        ],
        "description": "This course provides an overview of the methods required to evaluate the effectiveness of public health intervention or prevention programs and policies. The course introduces a range of quantitative, qualitative, and mixed methods research designs, and the process for applying and tailoring these designs to program and policy evaluations. In addition, we will focus on the process of engaging communities and stakeholders in program evaluation efforts. The course is intended for graduate students in public health; however, it may be of interest to students in social work, nursing, education, criminal justice, psychology, and other related fields. Recommend enrollment after PUBH 60600; permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Healthcare Policy & Admin",
        "subjectCode": "PUBH",
        "courseCode": "59000",
        "instructor": [
            "Jill Marie Inderstrodt",
            "Cody James Mullen",
            "Jennifer Maree Jabson Tree"
        ],
        "description": "Various public health topics that may change from semester to semester.",
        "capacity": 0,
        "credits": [
            0,
            9
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Professional Development In Public Health Seminar",
        "subjectCode": "PUBH",
        "courseCode": "60000",
        "instructor": [
            "Randolph Duane Hubach"
        ],
        "description": "  A professional development course designed to the meet the needs of MPH students in the Department of Public Health. ",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To The Quantitative Methods Of Public Health",
        "subjectCode": "PUBH",
        "courseCode": "60100",
        "instructor": [
            "Shandey Derisa Malcolm"
        ],
        "description": "Acquaints students with the basic concepts and methods of statistics, the applications, and their interpretation as used in public health. Students learn basic terminology and its meaning, how to calculate various statistical measures and indices, how to quantify health relationships, and how to compute and interpret inferential statistical techniques. Students will acquire the ability to utilize statistical software as a tool to facilitate the processing, editing, storing, displaying, analysis, and interpretation of health research-related data.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Theoretical Foundations Of Health Behavior",
        "subjectCode": "PUBH",
        "courseCode": "60200",
        "instructor": [
            "Yumary Ruiz"
        ],
        "description": "Examines the theoretical foundations of health behavior. Emphasizes the development of a conceptual framework for understanding and facilitating behavior enhancement, elimination, and/or maintenance in health promotion and education. Focuses on current theories regarding health-related behaviors. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Graduate Seminar In Public Health",
        "subjectCode": "PUBH",
        "courseCode": "69400",
        "instructor": [
            "Christine M Ladisch"
        ],
        "description": "  Seminar course covering a broad range of current research topics in public health and related fields of study. Seminar presentations by representatives from academia, industry, government, other external institutions and organizations, and members of the Purdue University community. Intensive analysis of application of various research and statistical methodologies to the study of public health.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2023"
    }
]