[
    {
        "title": "It's A Complex World",
        "subjectCode": "SYS",
        "courseCode": "30000",
        "instructor": [
            "Tugba Karabiyik"
        ],
        "description": "The main goal of this course is to address grand challenges that are of global concern - such as environmental sustainability and energy use, natural and human disasters, and political and economic development - using the ideas and tools of complex adaptive systems. The course addresses these challenges from diverse disciplinary perspectives, from the biological and physical sciences to the social sciences, to engineering. Through the experiments and computer simulations, students will analyze the features of these challenges which make them complex and seek to explain and find solutions to the problems that arise.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Systems Methods",
        "subjectCode": "SYS",
        "courseCode": "35000",
        "instructor": [
            "Tugba Karabiyik"
        ],
        "description": "Introduction to modeling tools and methods for understanding and designing systems. Topics include: defining the problem; defining and validating stakeholders' needs; system modeling and types of models; defining and modeling system behavior; defining and modeling functional, physical and allocated system architectures; and evaluating and modeling the tradeoffs between alternative system designs.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Systems Praxis",
        "subjectCode": "SYS",
        "courseCode": "40000",
        "instructor": [
            "Charles Robert Kenley"
        ],
        "description": "Engineers, social scientists, and managers frequently bring people and technology together to address complex problematic situations in an equitable way that benefits people and the environment. Multiple systems concepts and methods have been developed to address these situations, and typical courses in systems focus on a relatively small portion of the rich assortment of available approaches to addressing systems problems. This course introduces students to multiple systems concepts and methods via readings and class lecture. The students then apply these concepts and methods on team-based projects. The course will emphasize critical thinking about how the concepts and methods are applicable to the problematic situations of the projects and how well the project teams were able to perform the required activities.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Perspectives On Systems",
        "subjectCode": "SYS",
        "courseCode": "50000",
        "instructor": [
            "Tugba Karabiyik"
        ],
        "description": "This course provides an introduction to, and references for, each of four distinct approaches to SE concepts and tools. Individual assignments and team projects will be based on readings from these multiple approaches and selected case studies. Participants will be encouraged to bring their own prior expertise and examples to the discussions and projects. While the course will discuss quantitative topics (including cybernetics, feedback control systems, and statistical process control), the course itself will emphasize a more interdisciplinary conceptual integration rather than stand-alone analysis of these topics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Tools And Methodologies For Designing Systems",
        "subjectCode": "SYS",
        "courseCode": "51000",
        "instructor": [
            "Charles Robert Kenley"
        ],
        "description": "Introduction to modeling tools and methods for designing engineered systems. Topics include: defining the design problem; defining and validating stakeholders' and system requirements; discrete mathematics for system modeling; defining and modeling system operational scenarios; the system development life cycle; defining and modeling functional, physical, and allocated architectures; evaluating and modeling the tradeoffs between alternative architectures; and defining the system qualification process.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    }
]