[
    {
        "title": "Technology Freshman Seminar",
        "subjectCode": "TECH",
        "courseCode": "10000",
        "instructor": [
            "Benito Abraham Martinez"
        ],
        "description": "Technology Freshman Seminar.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Women In Technology: Exploring The Possibilities",
        "subjectCode": "TECH",
        "courseCode": "10100",
        "instructor": [
            "Antonia Munguia"
        ],
        "description": "An in-depth view of the emerging role of women in technology. Presentations by career professionals and faculty in a variety of technology disciplines will increase familiarity with the diversity of programs within the school. Academic and interpersonal skills and strategies needed to succeed in technology careers, and issues such as balancing work and family, will be addressed.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Design Thinking In Technology",
        "subjectCode": "TECH",
        "courseCode": "12000",
        "instructor": [
            "William M Bewley",
            "Rustin D Webster",
            "Andrea F Barber-Dansby",
            "Megan E Prygoski",
            "Kyle A Ochs",
            "Elizabeth D Kerns"
        ],
        "description": "Student will engage in critical analysis of real-world problems and global challenges. They will demonstrate the ability to recognize opportunity and to take initiative in developing solutions applying the principles of human centered design. Students will be able to communicate effectively and to work well on teams. Problems and solutions will be examined from societal, cultural, and ethical perspectives.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Living With Purpose",
        "subjectCode": "TECH",
        "courseCode": "19900",
        "instructor": [
            "Gary R Bertoline"
        ],
        "description": "Special topics in Technology; subject matter to be arranged.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Designing Technology For People",
        "subjectCode": "TECH",
        "courseCode": "22000",
        "instructor": [
            "Sherylyn H Briller",
            "Sarah R Renkert"
        ],
        "description": "Innovating in our complex world requires understanding people and the issues and challenges they face. This unique course brings together perspectives from technology and anthropology to address this by exploring ethnographic studies of people and technology interactions. Through this process, students will practice the problem scoping skills necessary to identify and define problems and begin to generate appropriate design solutions. In addition, students will learn how to observe and talk with people about technology and discuss a range of ways people use technology. Accordingly, the course will focus on human-centered design and how to empathize with people during the design process. This will allow students to learn how to identify opportunities for innovation that emerge when designers carefully observe and listen to humans using technology and/or experiencing problems with current technology. Note: This class engages the material in both the classroom and innovation labs.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Technology And The Global Society",
        "subjectCode": "TECH",
        "courseCode": "33000",
        "instructor": [
            "Abrar Hammoud"
        ],
        "description": "  The intersection of technology, globalization, and society is at the core of this course. Students examine socio-cultural issues related to the development and use of technology across intercultural contexts, explore perspectives and principles behind global technology influences, and examine the complexities and ethical nuances of technology and innovation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Prototyping Technology For People",
        "subjectCode": "TECH",
        "courseCode": "34000",
        "instructor": [
            "Douglas E Pruim"
        ],
        "description": "Innovating in our complex world requires us to think strategically and make the best decisions possible for both designing and business development. Accordingly, this unique course brings together perspectives from technology and business management to iteratively prototype innovative solutions to student-selected problems. This process will include creating prototypes in a variety of media, using the appropriate methods/tools, as well as exploring the processes and biases related to how people process information and make decisions. This type of work will help to guide the innovation process by gaining insights from testing prototypes and interacting with people to deepen one's understanding of customer needs, market segments, costs of goods, competitor operations, and market strategies. At the conclusion of the course, students will pitch a viable design solution and business model for a validated problem to a variety of potential investors and/or stakeholders. Note: This class engages the material in both the classroom and innovation labs. Students of all levels of experience will explore tools/programs related to computer aided design, 3D printing, app development, and digital prototyping.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Research Seminar In Technology",
        "subjectCode": "TECH",
        "courseCode": "60100",
        "instructor": [
            "Kathryne A Newton"
        ],
        "description": "This course provides an introduction to the field and scholarship of Technology and the skills necessary for success. Prerequisite: Doctoral student standing.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Qualitative Research Methods In Technology Studies",
        "subjectCode": "TECH",
        "courseCode": "69700",
        "instructor": [
            "Rua Mae Williams"
        ],
        "description": "In-depth examination of qualitative methods and frameworks used in technology research. Students learn by application a variety of methods from the qualitative research toolbox such as interviewing, focus groups, observation, and experience analysis. TECH 69700 prepares students to plan, pilot, and assess an original qualitative research study and to integrate qualitative research findings in the technology design and evaluation process. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2023"
    }
]