[
    {
        "title": "Veterinary Nursing Learning Community",
        "subjectCode": "VM",
        "courseCode": "10900",
        "instructor": [
            "Rachel Marie Kelly"
        ],
        "description": "  This Learning Community course is designed for freshman in the Veterinary Nursing Program and is focused on new student integration, providing resources available on campus to facilitate student success in the first year, creating community, and introduce students to Purdue and the Program. ",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Introduction To Veterinary Nursing",
        "subjectCode": "VM",
        "courseCode": "20100",
        "instructor": [
            "Holly Ann Mccalip"
        ],
        "description": "Credit Hours: 1.50.  A didactic course which presents the basic skills that will be used in all nursing courses and in the overall curriculum. The course will provide an introduction to the various opportunities within the veterinary healthcare profession as well as a general introduction to the attributes and traits of veterinary medical professionals. In addition, the course introduces medical math and terminology used in veterinary medicine. Students will complete exercises utilizing math concepts used for dosage calculations, conversions, proper notation, dispensing medications, fluid therapy calculations, and percent solutions. Students will use medical terminology including prefixes, roots, and suffixes of medical terms to complete exercises. This knowledge will be utilized in didactic courses and labs as well as in clinical rotations. Students will learn normal temperature, pulse and respiration values for various species. There will be both in-class and self-study components. This course combines content previously presented in VM 14000 and VM 25100.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Occupational & Public Health I",
        "subjectCode": "VM",
        "courseCode": "24100",
        "instructor": [
            "Jennifer R Smith"
        ],
        "description": "This course will cover selected zoonotic diseases, occupational hazards and safety issues, related to the veterinary health care team and veterinary facility.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Laboratory Animals & Exotic Pet Medicine-VN",
        "subjectCode": "VM",
        "courseCode": "32300",
        "instructor": [
            "Jennifer R Smith"
        ],
        "description": "This course will cover the proper methods of restraint, daily care, nursing techniques, and housing needs for the common species of laboratory animals.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Occupational & Public Health II-VN",
        "subjectCode": "VM",
        "courseCode": "44100",
        "instructor": [
            "Jennifer R Smith"
        ],
        "description": "The course covers selected aspects of public health and safety related to the veterinary health care team, patient, client and public.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Veterinary Management Topics II-VN",
        "subjectCode": "VM",
        "courseCode": "44200",
        "instructor": [
            "Holly Ann Mccalip"
        ],
        "description": "Credit Hours: 1.50.  This course is a continuation of the first veterinary practice management course. It will introduce students to concepts related to leading a veterinary medical team and managing the day-to-day management of the veterinary practice. Emphasis will be on human resources, marketing and financial management.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2023"
    },
    {
        "title": "Current Issues In Veterinary Medicine",
        "subjectCode": "VM",
        "courseCode": "82500",
        "instructor": [
            "Souvigny K Salisbury"
        ],
        "description": "This course provides a regular forum to bring PVM students and faculty together to discuss current issues facing the veterinary profession. Topics will vary depending upon current events and opportunities to feature guest lecturers. Time-shifting may be done to accommodate special events such as PVM Research Day.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2023"
    }
]