[
    {
        "title": "Introduction To African American Studies",
        "subjectCode": "AAS",
        "courseCode": "27100",
        "instructor": [
            "Veronica Lynette Coates Ahmed",
            "Mindy Hui Tan"
        ],
        "description": "Introduction to the philosophical and methodological principles underlying Afro-American studies. Dimensions of the black experience, including history, education, politics, psychology, economics, religion, social organization, and art, will be covered, and the requisite academic tools and sources will be examined.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "African American Popular Culture",
        "subjectCode": "AAS",
        "courseCode": "27700",
        "instructor": [
            "Mindy Hui Tan"
        ],
        "description": "This course focuses on the production of popular culture through African-based and non African-based traditions among African Americans in the United States. Pop culture forms covered include film, theatre, visual arts, literature, dance, sports, music and religious traditions.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Black Women Rising",
        "subjectCode": "AAS",
        "courseCode": "37000",
        "instructor": [
            "Dawn F Stinchcomb"
        ],
        "description": "This course examines the rise of black women and their impact on economic, social, and cultural issues.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Black Leisure & Recrtion",
        "subjectCode": "AAS",
        "courseCode": "37100",
        "instructor": [
            "Ronald J Stephens"
        ],
        "description": "Focus on specific topics of the personal experiences of blacks, in Africa and the diaspora, including black identity, black culture, and the relationships between blacks and society.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "The Black Community",
        "subjectCode": "AAS",
        "courseCode": "37300",
        "instructor": [
            "Ronald J Stephens"
        ],
        "description": "Focuses on a specific topic that relates to selected issues in the life, history, and culture of peoples of African ancestry.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": " Blck Civil Rights Move",
        "subjectCode": "AAS",
        "courseCode": "49100",
        "instructor": [
            "Cornelius L Bynum"
        ],
        "description": "Special Topics in African American Studies addresses special topics or projects under the direction of the instructor in the field of African American or African Diasporic Studies. The course may vary from 1-4 credit hours. It may be taught as a lecture or as a lecture with a lab.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Fall 2022"
    }
]