[
    {
        "title": "Introduction To Interior Design",
        "subjectCode": "AD",
        "courseCode": "12500",
        "instructor": [
            "Genell Wells Ebbini"
        ],
        "description": "Introductory survey of interior spaces and their impact upon the physical, social, psychological, and aesthetic needs of people. Critical evaluation of concepts in the interior design profession and related fields will be emphasized.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Art For Elementary School Teachers",
        "subjectCode": "AD",
        "courseCode": "20100",
        "instructor": [
            "Heather G Vickers"
        ],
        "description": "Art theory and experiences, curriculum theory, and materials preparatory for instruction of elementary school children. No undergraduate students may be enrolled in this course until they have been admitted to teacher education and a copy of this acceptance is on file.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Art Education",
        "subjectCode": "AD",
        "courseCode": "20200",
        "instructor": [
            "Frank Robert Sabol"
        ],
        "description": "Lectures, readings, and discussions covering the history, theory, and professional literature of art education.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "History Of Art To 1400",
        "subjectCode": "AD",
        "courseCode": "22600",
        "instructor": [
            "Arne Robert Flaten"
        ],
        "description": "Review of painting, sculpture, and architecture from their beginnings to the end of the Middle Ages. CTL:IFA 1311 Art History I",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "History Of Art Since 1400",
        "subjectCode": "AD",
        "courseCode": "22700",
        "instructor": [
            "Allie Kay Brandt"
        ],
        "description": "Review of painting, sculpture, and architecture from 1400 to present. CTL:IFA 1312 Art History II.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Visual Communication Design Computing I",
        "subjectCode": "AD",
        "courseCode": "22800",
        "instructor": [
            "James David Deal",
            "Felicia J Barrett"
        ],
        "description": "An introductory course in visual design computing programs used in the study and production of visual communication design.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Interior Drafting And Drawing",
        "subjectCode": "AD",
        "courseCode": "24000",
        "instructor": [
            "Stevi Marie Eggers"
        ],
        "description": "Basic drafting and drawing techniques used in residential and small commercial buildings. Emphasis on interior projects, on multi-view drawing, isometrics, perspective, and architectural construction drawings, and rendering techniques.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Design Drawing II",
        "subjectCode": "AD",
        "courseCode": "24600",
        "instructor": [
            "Raman Ghafari Harivand"
        ],
        "description": "Continuation of the work done in A&D 245. Emphasis on development of skills and presentation quality design drawing.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "History Of Photography I",
        "subjectCode": "AD",
        "courseCode": "25100",
        "instructor": [
            "Katherine Elizabeth Dean"
        ],
        "description": "An introduction of the history of photography from the medium's inception until 1950. Emphasis is placed on understanding photographs from a variety of aesthetic, social, and cultural perspectives, including those of race, class, and gender.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Art Appreciation",
        "subjectCode": "AD",
        "courseCode": "25500",
        "instructor": [
            "Laura Lucia Sanz Giraldo"
        ],
        "description": "Understanding and appreciation of the problems overcome by mankind in the origins and growth of art. CTL:IFA 1310 Art Appreciation",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Theory And Practice Of Elementary School Art",
        "subjectCode": "AD",
        "courseCode": "30200",
        "instructor": [
            "Frank Robert Sabol"
        ],
        "description": "Theory and practice of art education for elementary school from early childhood through middle childhood. Restricted to art education majors.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Industrial Design I",
        "subjectCode": "AD",
        "courseCode": "30500",
        "instructor": [
            "Jung Joo Sohn"
        ],
        "description": "Introduction to design principles in processes employing basic problem-solving techniques. Emphasis will be placed on man's interaction with form, thought processes, procedures, craftsmanship, and use of materials. Acceptance into professional industrial design concentration by successful performance in the mandatory portfolio review. Prerequisites: Passing mandatory portfolio review.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Ancient Greek Art",
        "subjectCode": "AD",
        "courseCode": "31100",
        "instructor": [
            "David C Parrish"
        ],
        "description": "The great variety of Greek art, which helped lay the foundation of Western artistic tradition, is presented in several different media and over a period of several centuries. The social context and cultural context of Greek art, especially its humanistic values, is emphasized. Offered every two years.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "New Media Culture",
        "subjectCode": "AD",
        "courseCode": "33400",
        "instructor": [
            "Shannon C Mcmullen"
        ],
        "description": "This lecture course provides a historical overview of the development of new media art. In their research, project papers, and practical assignments, students explore issues of media criticism, technology's impact on culture and society and visions of media utopias.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Advanced Interior Design Communication",
        "subjectCode": "AD",
        "courseCode": "33800",
        "instructor": [
            "Hannah K Bulow"
        ],
        "description": "Study of graphic design fundamentals and application of interior design visual presentation. To provide a foundation for developing proficiency in the use visual communication design in interior design presentation. Offered 3rd year in the Interior Design BFA program of study.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Lighting For Interior Environments",
        "subjectCode": "AD",
        "courseCode": "34700",
        "instructor": [
            "Laura E Bittner"
        ],
        "description": "The study of illuminating principles, design criteria, specifications and environmental systems applied to architectural interiors in public and private spaces. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Baroque Art",
        "subjectCode": "AD",
        "courseCode": "38000",
        "instructor": [
            "Allie Kay Brandt"
        ],
        "description": "A survey of European art and architecture during the 17th century, focused on Italy and the Netherlands, and emphasizing some of their leading painters. Works of art are seen in a broad social and cultural context, including the Counter-Reformation and the rise of capitalism.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Modern Art",
        "subjectCode": "AD",
        "courseCode": "38300",
        "instructor": [
            "Amanda Jade Kendrick"
        ],
        "description": "A comprehensive overview of Modern art from Impressionism to Surrealism, designed to help students understand the radical transformations art and society underwent in that period, and reflect upon the influence of new technologies, scientific discoveries, and world events on artistic creation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "History Of Design",
        "subjectCode": "AD",
        "courseCode": "39500",
        "instructor": [
            "Jennifer B Kaufmann-Buhler"
        ],
        "description": "A survey of the historical development of design from the industrial revolution to the present that examines the influence of new technologies, materials, and style on design practice as well as the role of design in shaping the technologies and things of everyday life. Throughout the course, students will analyze design within the broader social, cultural, and political context of production, consumption, and use.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Sustainability In The Built Environment",
        "subjectCode": "AD",
        "courseCode": "39700",
        "instructor": [
            "Genell Wells Ebbini"
        ],
        "description": "The study of philosophical concepts, principles, and theories of sustainability as they pertain to building methods, materials, systems, and occupants. To provide a foundation for evaluation of materials, processes, and applications of design components for environmentally responsible. Field trips will be required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Industrial Design III",
        "subjectCode": "AD",
        "courseCode": "40500",
        "instructor": [
            "Tong J Kim"
        ],
        "description": "Design projects emphasizing sophisticated problem-solving methods. Design projects will stress diversity of industrial design and will trace the development of products from initial concept, research, and development through production.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Interior Design V",
        "subjectCode": "AD",
        "courseCode": "43000",
        "instructor": [
            "Hannah K Bulow"
        ],
        "description": "Design of multi-use complex environments, emphasizing program and problem solving, facility planning, building systems, and materials technology. Application of alternative presentation technologies will be explored.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Professional Practice For Visual Communication Designers",
        "subjectCode": "AD",
        "courseCode": "43400",
        "instructor": [
            "James David Deal"
        ],
        "description": "Specific professional practice topics for the visual communication designer. Topics include contracts, professional associations, ethics, portfolio and resume preparation, self-promotion and exhibition of creative work, the job market and the future of the profession. Field trips may be required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Advanced Drawing",
        "subjectCode": "AD",
        "courseCode": "49000",
        "instructor": [
            "Tong J Kim"
        ],
        "description": "Individual problems in art and design. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Curriculum Studies In Art Education",
        "subjectCode": "AD",
        "courseCode": "50200",
        "instructor": [
            "Frank Robert Sabol"
        ],
        "description": "(EDCI 52000) Study of selected theories of curriculum conception as they apply to constructing arts education curricula in the schools. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Cognition In Design",
        "subjectCode": "AD",
        "courseCode": "53200",
        "instructor": [
            "Zhen Yu Qian"
        ],
        "description": "This course focuses on understanding cognitive issues and theories in design. Students are exposed to different cognitive models and phases while they are designing interactive systems. They will develop the cognitive perspective, analyze user experience, and develop an interaction design.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Tch Asst Practicum:Fdn Draw",
        "subjectCode": "AD",
        "courseCode": "59100",
        "instructor": [
            "Christine L Wuenschel",
            "Brian Joseph Hitselberger"
        ],
        "description": "Seminar to train new Art and Design teaching assistants in the content, policies, and format of the courses they support in various roles, such as: primary instructor, primary studio technician, primary grader for the course, or primary student teacher supervisor. Topics include problem/project presentation, critique techniques, grading, and knowledge of materials and processes of the discipline. Subsequent semesters focus on improving and refining teaching and operational skills. Open only to Art and Design teaching assistants each semester they teach. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Painting",
        "subjectCode": "AD",
        "courseCode": "60000",
        "instructor": [
            "Brian Joseph Hitselberger"
        ],
        "description": "Painting. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            6
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Theory In Art Seminar",
        "subjectCode": "AD",
        "courseCode": "60300",
        "instructor": [
            "Jennifer B Kaufmann-Buhler"
        ],
        "description": "Study of critical issues in modern and postmodern art and relevant methodologies: formalism, iconography, biography and autobiography. Marxism (cultural studies), semiotics, and psychoanalyses. Elements of contemporary professional art practice discussed, including writing of artists' and designers' statements, biographies, and resumes. Prerequisite: Admission to the M.F.A. program in Art and Design. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Problems In Industrial Design",
        "subjectCode": "AD",
        "courseCode": "60500",
        "instructor": [
            "Jung Joo Sohn"
        ],
        "description": "Problems in product innovation, product design, product development, and environmental design. Emphasis is placed on the development of working prototypes.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Problems In Visual Design",
        "subjectCode": "AD",
        "courseCode": "60600",
        "instructor": [
            "Hyungjoo A Kim"
        ],
        "description": "Problems relating to printing and digital technology, motion design, computer graphics, perception, and the development of visual communication prototypes.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Drawing",
        "subjectCode": "AD",
        "courseCode": "61300",
        "instructor": [
            "Brian Joseph Hitselberger"
        ],
        "description": "Drawing. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            6
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Materials And Processes For The Studio Artist",
        "subjectCode": "AD",
        "courseCode": "66900",
        "instructor": [
            "Sigrid K Zahner"
        ],
        "description": "This course introduces graduate studio artists to various materials, methods and processes to supplement their current practical media of choice. Such methods include, but are not limited to, welding for the artist (MIG and arc), casting, cement, plaster, mold making, structural construction, using fabric for sculptural processes, sewing (machine and hand) printing on fabric. This is a survey course and exposes the student to the above allowing them to select one or multiple processes and materials to enhance and expand their practice. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            6
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Historical Problems In Art Education",
        "subjectCode": "AD",
        "courseCode": "69300",
        "instructor": [
            "Frank Robert Sabol"
        ],
        "description": "(EDCI 63000) Examination of methods used to investigate art education's history, past theory, and practices. Class work will include readings and discussion and will culminate in guided research and a short historical study. Permission of instructor required. Prerequisite: BA in art education.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Aesthetic Development In Children",
        "subjectCode": "AD",
        "courseCode": "69600",
        "instructor": [
            "Frank Robert Sabol"
        ],
        "description": "(EDCI 63100) Examination of historical and contemporary theory and research in children's aesthetic development (response and production) and analysis of the influences of such development on art education curricula and methodology. Permission of Instructor required. Prerequisite: BA in Art Education or an equivalent area.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    }
]