[
    {
        "title": "Introduction To The College Of Agriculture And Purdue University",
        "subjectCode": "AGR",
        "courseCode": "10100",
        "instructor": [
            "Timothy P Kerr"
        ],
        "description": "Credit Hours: 0.50.  Students are introduced to the College of Agriculture and Purdue University. Specific areas discussed include the diversity of career opportunities within agriculture, the relationships between different areas of agriculture, ethics, the impact of undergraduate coursework, including the core curriculum, on scholarship and career preparation, and the challenges facing the food, agricultural, and natural resource system. The use of guest lecturers provides a networking opportunity for students. Enrollment in this course is restricted to beginning freshmen students. Course meets weeks 1-8.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Pathway To Purdue",
        "subjectCode": "AGR",
        "courseCode": "10700",
        "instructor": [
            "Russell Charles Nelson"
        ],
        "description": "This course is a required one credit introductory course for students participating in the Pathway to Purdue program. Students will learn about the Pathway to Purdue programs, study skills and techniques, transfer policies and requirements, as well as hear from a variety of guest speakers who will discuss relevant topics. Permission of department required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Agriculture Technology And Innovation",
        "subjectCode": "AGR",
        "courseCode": "10800",
        "instructor": [
            "Dennis Rene Buckmaster"
        ],
        "description": "The course will cover a broad range of innovations and technologies involved in the agricultural industry. The broad topics covered in this class will discuss development of latest technologies assisting in increase in yield, production and efficiency of agricultural systems. This may include, but is not limited to topics regarding environmental protection, plant production, livestock systems, and agricultural machinery.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Agricultural And Biological Engineering Academic Programs",
        "subjectCode": "AGR",
        "courseCode": "11100",
        "instructor": [
            "Brenda J Schroeder"
        ],
        "description": "Credit Hours: 0.50.  An introduction to the academic programs offered in the Department of Agricultural and Biological Engineering which include Agricultural Systems Management, Agricultural and Natural Resources Engineering, and Biological and Food Process Engineering. Topics include, but are not limited to undergraduate plans of study, courses, experiential programs, internships, student organizations, career opportunities, academic policies, scholarships, and student services. Course meets during weeks 1-8.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Agricultural Economics Academic Programs",
        "subjectCode": "AGR",
        "courseCode": "11200",
        "instructor": [
            "Andrew E Oppy"
        ],
        "description": "Credit Hours: 0.50.  An introduction to the academic programs offered in the Department of Agricultural Economics. Topics include, but are not limited to undergraduate plans of study, courses, experiential programs, internships, student organizations, career opportunities, academic policies, scholarships, and student services. Course meets during weeks 1-8.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Agronomy Academic Programs",
        "subjectCode": "AGR",
        "courseCode": "11300",
        "instructor": [
            "Lee E Schweitzer"
        ],
        "description": "Credit Hours: 0.50.  An introduction to the academic programs offered in the Department of Agronomy, which includes Applied Meteorology, Agronomic Business and Marketing, Environmental Soil Science, International Agronomy, Plant Genetics and Plant Breeding, Soil and Crop Management, Soil and Crop Science, Turf Science, and associate degrees. Topics include, but are not limited to undergraduate plans of study, courses, experiential programs, internships, student organizations, career opportunities, academic policies, scholarships, and student services.  Course meets during weeks 1-8.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Animal Sciences Academic Programs",
        "subjectCode": "AGR",
        "courseCode": "11400",
        "instructor": [
            "Ashley R York"
        ],
        "description": "Credit Hours: 0.50.  An introduction to the academic programs offered in the Department of Animal Sciences. Topics include, but are not limited to undergraduate plans of study, courses, experiential programs, internships, student organizations, career opportunities, academic policies, scholarships, and student services. Course meets during weeks 1-8.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Biochemistry Academic Programs",
        "subjectCode": "AGR",
        "courseCode": "11500",
        "instructor": [
            "Heidi Marie Fornes"
        ],
        "description": "Credit Hours: 0.50.  An introduction to the academic programs offered in the Department of Biochemistry. Topics include, but are not limited to undergraduate plans of study, courses, experiential programs, internships, student organizations, career opportunities, academic policies, scholarships, and student services. Course meets during weeks 1-8.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Entomology Academic Programs",
        "subjectCode": "AGR",
        "courseCode": "11700",
        "instructor": [
            "Stephen L Cameron"
        ],
        "description": "Credit Hours: 0.50.  An introduction to the academic programs offered in the Department of Entomology. Topics include, but are not limited to undergraduate plans of study, courses, experiential programs, internships, student organizations, career opportunities, academic policies, scholarships, and student services. Course meets during weeks 1-8.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Food Science Academic Programs",
        "subjectCode": "AGR",
        "courseCode": "11800",
        "instructor": [
            "Caitlinn Brooke Hubbell"
        ],
        "description": "Credit Hours: 0.50.  An introduction to the academic programs offered in the Department of Food Science. Topics include, but are not limited to undergraduate plans of study, courses, experiential programs, internships, student organizations, career opportunities, academic policies, scholarships, and student services. Course meets during weeks 1-8.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Forestry And Natural Resources Academic Programs",
        "subjectCode": "AGR",
        "courseCode": "11900",
        "instructor": [
            "Casey L Doten"
        ],
        "description": "Credit Hours: 0.50.  An introduction to the academic programs offered in the Department of Forestry and Natural Resources. Topics include, but are not limited to undergraduate plans of study, courses, experiential programs, internships, student organizations, career opportunities, academic policies, scholarships, and student services. Course meets during weeks 1-8.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Horticulture And Landscape Architecture Academic Programs",
        "subjectCode": "AGR",
        "courseCode": "12000",
        "instructor": [
            "Michael N Dana"
        ],
        "description": "Credit Hours: 0.50.  An introduction to the academic programs offered in the Department of Horticulture and Landscape Architecture. Topics include, but are not limited to undergraduate plans of study, courses, experiential programs, internships, student organizations, career opportunities, academic policies, scholarships, and student services. Course meets during weeks 1-8.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Agricultural Sciences Education And Communication Academic Programs",
        "subjectCode": "AGR",
        "courseCode": "12100",
        "instructor": [
            "Amy K Conrad"
        ],
        "description": "Credit Hours: 0.50.  An introduction to the academic programs offered in the Department of Agricultural Sciences Education and Communication which includes Agricultural Communication and Agricultural Education. Topics include, but are not limited to undergraduate plans of study, courses, experiential programs, internships, student organizations, career opportunities, academic policies, scholarships, and student services. Course meets during weeks 1-8.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Natural Resources And Environmental Science Academic Programs",
        "subjectCode": "AGR",
        "courseCode": "12200",
        "instructor": [
            "Laura C Bowling"
        ],
        "description": "Credit Hours: 0.50.  An introduction to the academic programs offered in Pre-Environmental Studies and Natural Resources and Environmental Science. Topics include, but are not limited to undergraduate plans of study, courses, experiential programs, internships, student organizations, career opportunities, academic policies, scholarships, and student services. Course meets during weeks 1-8.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To College Of Agriculture Pre-Veterinary Medicine Academic Programs",
        "subjectCode": "AGR",
        "courseCode": "12400",
        "instructor": [
            "Timothy P Kerr"
        ],
        "description": "Credit Hours: 0.50.  An introduction to the academic programs offered in Pre-Veterinary Medicine. Topics include, but are not limited to undergraduate plans of study, courses, experiential programs, internships, student organizations, career opportunities, academic policies, scholarships, and student services. Course meets during weeks 1-8.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Plant Science",
        "subjectCode": "AGR",
        "courseCode": "12500",
        "instructor": [
            "Joseph M Anderson"
        ],
        "description": "An introduction to the academic programs offered in plant science. Topics include, but are not limited to, undergraduate plans of study, courses, and experiential programs including undergraduate research opportunities, internships, student organizations, career opportunities, academic policies, scholarships, and student services.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Woman In Agriculture I",
        "subjectCode": "AGR",
        "courseCode": "15000",
        "instructor": [
            "Amanda J Deering"
        ],
        "description": "Intended to expose first-year students to resources and their development of a network of students across campus. The course will support their transition to Purdue through a sense of community and increased engagement, and provide students access to faculty across the College of Agriculture in a small group setting. Activities include seminars to expose students to college and university resources, hands-on learning activity for team building, study halls, and group meals. Must be enrolled in the Women of Ag Learning Community.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Communicating Across Culture",
        "subjectCode": "AGR",
        "courseCode": "20100",
        "instructor": [
            "Pamala V Morris"
        ],
        "description": "This course will provide students with an opportunity to understand their place in a multicultural, multiethnic, multinational country, the United States. It is designed to provide an academic overview of the field of multicultural education as it evolved to this day. The course will offer an introductory overview of the many differences that exist within all human beings. Because the diversity among individuals is endless, we cannot study all differences, but will study a sampling such as race, ethnicity, gender identity, age, social class, disability, learning styles, and religion/spiritual orientation. Issues of poverty, language, and social justice may also be examined in relationship to the above major areas of emphasis.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Dean's Scholars Seminar",
        "subjectCode": "AGR",
        "courseCode": "20500",
        "instructor": [
            "Elizabeth A Byers-Doten"
        ],
        "description": "  Students are introduced to the breadth and mission of the College of Agriculture. Specific areas discussed include the diversity of career opportunities within agriculture, the relationships between different areas of agriculture, ethics, the opportunities within undergraduate research, and the challenges facing the food, agricultural, and natural resource system. Students will be exposed to a series of guest lecturers to gain an overview of the various fields within the college and undergraduate research or scholarly work opportunities. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Dean Schlr Peer Men Exp-Honors",
        "subjectCode": "AGR",
        "courseCode": "29000",
        "instructor": [
            "Elizabeth A Byers-Doten"
        ],
        "description": "Presentation of subject matter not available in other courses offered by the college. The specific topic that is offered will be indicated on the student's academic record.",
        "capacity": 0,
        "credits": [
            0,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Drctd Read Habitude Transition",
        "subjectCode": "AGR",
        "courseCode": "29400",
        "instructor": [
            "Jacqueline I Boudreaux"
        ],
        "description": "Presentation of subject matter not available in other courses offered by the college. Directed reading and discussion of books and other documents of significant importance and current interest in agriculture, food systems, renewable natural resources, and the environment. The specific topic that is covered will be indicated on the student's academic record. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            3
        ],
        "term": "Fall 2022"
    }
]