[
    {
        "title": "America And The World",
        "subjectCode": "AMST",
        "courseCode": "10100",
        "instructor": [
            "Kathleen G Burnham",
            "Rachel Lauren Ramlawi",
            "Araba Fobin Dennis"
        ],
        "description": "This course examines the evolution of American culture as the United States transitioned from a relatively isolated country at the end of the 19th century to an active shaper of a global community by the 21st century. We will examine ways in which American Culture shaped and was shaped by international relationships that transcend nation states. We will explore reactions to, and the results of, the spread of American culture both inside and outside the United States. By studying traditional cultural forms like art, music, design, literature, film, and technology the course will build a foundation from which to understand the configuration of American culture. Yet the course will also emphasize American culture expression, that in the forms of television, advertising, sport, cartoons, social media, video games, fashion, food, drugs, and automobiles, have transcended the geographical boundaries of the United States to engage in global interplays of material cultural exchange.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Interpreting America",
        "subjectCode": "AMST",
        "courseCode": "20100",
        "instructor": [
            "Ahmed Idrissi Alami",
            "David Javier Williams Tortolini"
        ],
        "description": "Introduction to the interdisciplinary study of American culture, history, and society in its national and global contexts.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Intro Asian American Studies",
        "subjectCode": "AMST",
        "courseCode": "30100",
        "instructor": [
            "Melvin Earl Villaver",
            "Sharra L Vostral",
            "Monica Mong Trieu",
            "Shannon C Mcmullen"
        ],
        "description": "Advanced interdisciplinary study of American culture, history, and society in their national and global contexts.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Understanding The National Football League",
        "subjectCode": "AMST",
        "courseCode": "32000",
        "instructor": [
            "Cheryl A Cooky"
        ],
        "description": "This course counters the cultural myth that sports are \"simply a form of entertainment\" or an \"escape from reality\" and takes seriously the notion that sports matter as a social, cultural, and political force. Students will use academically informed inquiry and investigation to examine broader cultural dynamics through a critical examination of the National Football League. Course topics include how the NFL shapes social identities including race, gender, sexuality, and American identity, the connection between football and militarism, the relationship between the NFL and commercialism, the role the NFL plays in the triad of men's violence, among other topics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To American Studies",
        "subjectCode": "AMST",
        "courseCode": "60100",
        "instructor": [
            "Monica Mong Trieu"
        ],
        "description": "An exploration of the cultural and institutional history of American Studies designed to acquaint students with the interdisciplinary concepts of American Studies by focusing on major canonical texts associated with that history. Prerequisite: Master's student standing and American Studies majors only.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Visual Theory & Culture",
        "subjectCode": "AMST",
        "courseCode": "65000",
        "instructor": [
            "Christopher J Lukasik",
            "Patricia A Boling"
        ],
        "description": "A reading seminar on a selected topic in American Studies, taught by two faculty members from different disciplines, usually one from the humanities and one from the social sciences. Prerequisite: AMST 60100.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    }
]