[
    {
        "title": "American Sign Language I",
        "subjectCode": "ASL",
        "courseCode": "10100",
        "instructor": [
            "Robin A Shay"
        ],
        "description": "A basic introduction to American Sign Language. This course introduces students to the tools for mastering the grammar at a basic expressive and receptive level. Introduction to cultural and historical aspects of ASL and the deaf community.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "American Sign Language II",
        "subjectCode": "ASL",
        "courseCode": "10200",
        "instructor": [
            "Michael Alben Barrett"
        ],
        "description": "A continuation of ASL 10100. Further study of the language with more emphasis on receptive and expressive conversational skills. Includes readings of research studies relevant to lectures.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "American Sign Language III",
        "subjectCode": "ASL",
        "courseCode": "20100",
        "instructor": [
            "Sharon L Borkowski"
        ],
        "description": "A more advanced study of American Sign Language. Further development of receptive and expressive skills using more advanced material. Continued emphasis on cultural and historical aspects in relation to the evolution of the language and language usage.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "American Sign Language IV",
        "subjectCode": "ASL",
        "courseCode": "20200",
        "instructor": [
            "Robin A Shay"
        ],
        "description": "A continuation of ASL 20100. Includes some introduction to linguistic structure, especially classifiers, temporal sequencing and aspect, and conversational regulators.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "American Sign Language V",
        "subjectCode": "ASL",
        "courseCode": "30100",
        "instructor": [
            "Michael Alben Barrett"
        ],
        "description": "This course is a continuation of ASL 20200 (5th in sequence of courses in ASL). Features of Level 5 are expanded student discourse, advanced ASL structure and vocabulary, role shift variations, formal storytelling, text analysis and formal/informal presentations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "The Structure Of American Sign Language I: Phonology And Morphology",
        "subjectCode": "ASL",
        "courseCode": "36100",
        "instructor": [
            "Christine Marie Multra Kraft"
        ],
        "description": "Linguistic study of ASL, including the following: phonological features of individual signs (hand shape, orientation, location, movement) and how those features shift when placed in a stream of signs; morphological features of signs, including compounding and lexicalization of finger spelled words; grammar, focusing on typical word orders found in ASL sentences; meaning of signs and how those meanings have shifted over time (as well as how those meanings shift for particular dialects); and typical pragmatic features of conversation in ASL. Knowledge of ASL is required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    }
]