[
    {
        "title": "Introduction To Aviation Technology",
        "subjectCode": "AT",
        "courseCode": "10000",
        "instructor": [
            "Jason E Cutter"
        ],
        "description": "An introduction to the Department of Aviation Technology and its curricula as well as an overview of the aviation industry and associated careers. Aviation safety practices and human factors issues are discussed. An overview of aviation regulations and the regulatory process is included.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Aviation Business",
        "subjectCode": "AT",
        "courseCode": "10200",
        "instructor": [
            "Sen Wang",
            "Volodymyr Bilotkach"
        ],
        "description": "A discussion of the financial structure and operation of the aviation industry including aircraft and aerospace design parameters, as well as aviation financial and industrial processes. The course will cover material relevant to the overall structure of the aviation industry including history, current status of aerospace manufacturers, commercial airlines, and general aviation as well as governmental aviation agencies and international aviation. Commercialization of space and current issues in aviation will also be covered.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Aerospace Vehicle Propulsion And Tracking Systems",
        "subjectCode": "AT",
        "courseCode": "10300",
        "instructor": [
            "Jonathon D Ziulkowski"
        ],
        "description": "This course is an introduction to propulsion systems used in aerospace vehicles. The student will learn terminology, component parts, and operational theory of propulsion systems. Course topics covered are reciprocating and turbine engine operation theory as well as rocket propulsion systems. including electrical, fuel, fire, ignition and lubrication. Operational and regulatory fuel requirements are discussed. Emerging technologies and environmental practices will be explored.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Basic Aircraft Science",
        "subjectCode": "AT",
        "courseCode": "10600",
        "instructor": [
            "Jonathon D Ziulkowski"
        ],
        "description": "An introduction to federal regulatory systems and associated publications. Includes aircraft nomenclature, theory of flight, and fundamentals of the aviation industry. Introduces weight and balance procedures. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Unmanned Aerial System Operations",
        "subjectCode": "AT",
        "courseCode": "10901",
        "instructor": [
            "Nathan Tyler Rose"
        ],
        "description": "This course will provide students the aeronautical knowledge required to operate a small UAS in the National Airspace. Students are introduced to various aspects of unmanned aviation operations, which includes UAS system types and components, regulations and operational approvals, and indoctrination to the civil and commercial applications of UAS. Through the use of UAS simulation technology, students will develop basic small UAS flight skills and successfully complete various UAS operational scenarios. Upon successful completion of the course students will be prepared to obtain a Federal Aviation Administration (FAA) Remote Pilot Certificate with a Small UAS Rating. Department of permission is required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Aircraft Science For Engineering Technology",
        "subjectCode": "AT",
        "courseCode": "11600",
        "instructor": [
            "George Gerard Mitchell"
        ],
        "description": "Required for AET. This course is an introduction to theory of flight, aircraft nomenclature, aircraft configurations, high speed flight, and helicopter configurations and rotor dynamics. Covers lift/drag and concepts for flight at an engineering technology level beyond that of flight ground school. Federal regulatory systems for aircraft design and persons other than flight personnel and associated technical documents are covered. Introduces center of gravity theory, defines how to locate centers of gravity, and introduces weight and balance procedures for engineering technology, not covered by flight ground school. This course teaches topics in the curriculum required by 14 CFR Part 147 as outlined in the School of Aviation and Transportation Technology's Part 147 Operations Manual approved by the FAA, and provides specific knowledge and skills needed for FAA certification examinations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Publications Records And Regulations",
        "subjectCode": "AT",
        "courseCode": "12700",
        "instructor": [
            "David W Gouwens"
        ],
        "description": "Required for AET. This course provides students with the concepts, and information to understand the regulations and publications specific to aviation and aerospace vehicle repair and maintenance. The privileges and limitations of the 14 CFR Part 65 airmen certificates are covered, as well as the regulations governing repair facilities and repair stations. The specific forms and records, and the proper disposition of those records are covered. In addition, aircraft technical drawings and prints are examined and the student is to develop the ability to read and comprehend aircraft drawings, as well as make drawings/sketches for vehicle repair and/or alteration. Precision measuring equipment is covered as is the hardware specific to aviation and aerospace. Inspection procedures and conformity checks are covered. Engine run up operations for inspection purpose are covered. This course teaches topics in the curriculum required by 14 CFR Part 147 as outlined in the School of Aviation and Transportation Technology's Part 147 Operations Manual approved by the FAA, and provides specific knowledge and skills needed for FAA certification examinations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Private Pilot Lectures",
        "subjectCode": "AT",
        "courseCode": "14400",
        "instructor": [
            "Abner Del Cid Flores"
        ],
        "description": "A study of the subject areas and information needed to operate as a private pilot in the aviation environment. The FAA private pilot written exam will be offered to those who qualify after taking the lecture course offering.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Aerospace Vehicle Systems Design, Analysis And Operations",
        "subjectCode": "AT",
        "courseCode": "20200",
        "instructor": [
            "Abner Del Cid Flores"
        ],
        "description": "Introduction to the design and engineering analysis of various systems found on modern aircraft and aerospace vehicles. Operational theory will also be presented for specific aircraft. Systems include electric power distribution, digital data, instrumentation, hydraulic, pneumatic, environmental, flight management, and autoflight.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Aviation Operations Management",
        "subjectCode": "AT",
        "courseCode": "20300",
        "instructor": [
            "Fecri Karanki"
        ],
        "description": "<a href=\"javascript:history.go(-1)\" onmouseover=\"window.status='Return to Previous';  return true\" onfocus=\"window.status='Return to Previous';  return true\" onmouseout=\"window.status='';  return true\" onblur=\"window.status='';  return true\">Return to Previous</a>",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Statics For Aerostructures",
        "subjectCode": "AT",
        "courseCode": "20501",
        "instructor": [
            "Sergey I Dubikovsky"
        ],
        "description": "This course provides an introduction to the static analysis of aerostructures. Force systems, resultants and equilibrium, moments, distributed loads, and centroids as they relate to aeronautical structures are studied. CAD software is introduced.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Aircraft Systems",
        "subjectCode": "AT",
        "courseCode": "20700",
        "instructor": [
            "George Gerard Mitchell"
        ],
        "description": "Principles and design concepts of aircraft operating systems are covered. Emphasis is given to flight control, electrical, environmental, hydraulic, pneumatic, pressurization, oxygen, heating, cooling, fire protection, and ice and rain protection systems. Also included are theory of operation and design of aircraft instruments and associate systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Aircraft Materials",
        "subjectCode": "AT",
        "courseCode": "20802",
        "instructor": [
            "Ashley E Habig"
        ],
        "description": "In this course students study aluminum and composite materials used in aircraft. The course covers elements of design, fabrication, final assembly, and testing. Students also study the practical application of statics for airframe loads.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Civilian Unmanned Aerial Systems",
        "subjectCode": "AT",
        "courseCode": "20900",
        "instructor": [
            "Nathan Tyler Rose"
        ],
        "description": "This course introduces fundamental concepts of unmanned aerial vehicles. Topics include: history, airframe and powerplant selection, regulations governing unmanned systems, airspace descriptions, safety, autonomous system programming and calibration, data package options, weather, system maintenance and repair, manual flight training, first person viewer flight (FPV), flight simulator use, as well as aerodynamics and flight controls for autonomous aircraft.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Human Factors For Flight Crews",
        "subjectCode": "AT",
        "courseCode": "22300",
        "instructor": [
            "Abner Del Cid Flores"
        ],
        "description": "This course explores the fundamental concepts  of single pilot and multi-crew human factors issues. The first part of the course focuses on the physiological factors that affect single pilot aeronautical decision-making. The second part examines human error, threat and error management, and domains of crew resources management. The third segment utilizes team-building exercises, case study presentations, and a formal assignment to emphasis course learning outcomes.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Instrument Flight Lectures",
        "subjectCode": "AT",
        "courseCode": "24900",
        "instructor": [
            "Timothy James Goudie",
            "Ronda E Cassens"
        ],
        "description": "A study of the operation of flight instruments and radio navigation aids, federal aviation regulations pertinent to instrument flight, meteorology, instrument charts, instrument flight planning, and air traffic control procedures. Preparation for the FAA Instrument Rating written examination.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Aviation Projects",
        "subjectCode": "AT",
        "courseCode": "25200",
        "instructor": [
            "Caroline Kathure Marete"
        ],
        "description": "This course will introduce the students to group projects in collaboration with industrial partners in aviation. A new project will be conducted each semester. Students will participate in the development of project goals, conducting field research, and developing a final course document and presentation. Travel outside of the normal assigned classroom time might be required. Permission of Department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Commercial Flight Lectures",
        "subjectCode": "AT",
        "courseCode": "25400",
        "instructor": [
            "Ronda E Cassens"
        ],
        "description": "The course is designed to review the principles of flight, aircraft systems, pertinent federal aviation regulations, and airman publications and service in order to prepare the student for the FAA Commercial Pilot written examination.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Basic Aircraft Powerplant Technology",
        "subjectCode": "AT",
        "courseCode": "26200",
        "instructor": [
            "Keegan C Pullen"
        ],
        "description": "A study of the design, construction, and operating practices of aircraft reciprocating and small gas turbine engines. Laboratory exercises emphasize airworthiness evaluation, fault-isolation techniques, and standard service/maintenance practices.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Aircraft Electrical Systems",
        "subjectCode": "AT",
        "courseCode": "26502",
        "instructor": [
            "Donald Keith Barnes"
        ],
        "description": "An in-depth study of aircraft electrical components, both individually and as systems in the aircraft. DC electrical circuits, series and parallel circuits, magnetism, and electromagnetism are covered, as are DC power systems, schematics, and aircraft wiring practices. Aircraft charging systems, main power distribution, solid state electronics, batteries, and motors are also discussed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Fixed And Rotary Wing Assemblies",
        "subjectCode": "AT",
        "courseCode": "26700",
        "instructor": [
            "James Mark Thom"
        ],
        "description": "An overview of various fixed and rotary wing components and systems. Flight control systems, landing gear, fuel systems, wheels, brakes, and rotor systems are among the subjects studied.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Composite Technology",
        "subjectCode": "AT",
        "courseCode": "27200",
        "instructor": [
            "Garam Kim",
            "Ronald Sterkenburg"
        ],
        "description": "An introduction to basic composite materials, processes, construction, testing, and repair. Students will work with a variety of wet and pre-impregnated fiber and matrix systems including glass, aramid fiber, and carbon-graphite.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Nondestructive Testing For Aircraft",
        "subjectCode": "AT",
        "courseCode": "27800",
        "instructor": [
            "Thomas C Hagovsky"
        ],
        "description": "A study of nondestructive testing methods used to evaluate the structural integrity of airframes, engines, and components. Magnetic particle, liquid penetrant, electromagnetic, ultrasonic, and radiographic inspection are covered.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Career Resource Seminar",
        "subjectCode": "AT",
        "courseCode": "29000",
        "instructor": [
            "Vicki L Gilbert",
            "James Mark Thom",
            "Todd A Brewer"
        ],
        "description": "Independent study primarily for sophomore students who wish to pursue study and development work in special areas. Subject material must be arranged with the instructor before enrolling in the course. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Advanced Aircraft Systems",
        "subjectCode": "AT",
        "courseCode": "30702",
        "instructor": [
            "Keegan C Pullen"
        ],
        "description": "An in-depth study of aircraft components and operation with an emphasis on transport-category aircraft. Systems covered include fuel, environmental, fluid-power, flight control, fire protection, ice-control, warning, and auxiliary power. Practical projects utilize small ad transport-category aircraft.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Aircraft Materials Processes",
        "subjectCode": "AT",
        "courseCode": "30802",
        "instructor": [
            "Sergey I Dubikovsky"
        ],
        "description": "A study of the processes by which aircraft materials are converted into usable components. Laboratory activities include machining, welding, and analysis of material properties.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To UAS Sensor Technology",
        "subjectCode": "AT",
        "courseCode": "30901",
        "instructor": [
            "Joseph P Hupy"
        ],
        "description": "This course introduces students to multiple forms of UAS sensors and core fundamentals of Remote Sensing and Geospatial Technology. Students will be introduced to basic data capture and processing techniques and to effectively apply different forms of UAS sensors to real-world applications.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Advanced Aviation Operations",
        "subjectCode": "AT",
        "courseCode": "32001",
        "instructor": [
            "Ashley E Habig"
        ],
        "description": "This course covers modern principles for managing complex global aviation maintenance, ground and aerospace manufacturing operations. Particular emphasis is placed on \"system-of-systems\" and organizational resilience concepts in air vehicle lifecycle maintenance, aerospace manufacturing and airport surface/gate operations. Principles of Data Science, systems-thinking, process visualization, emerging technologies and modern workforce challenges and their impact on global sustainable airworthiness, safety, quality and performance reliability are covered in-depth.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Advanced Aviation Meteorology",
        "subjectCode": "AT",
        "courseCode": "32501",
        "instructor": [
            "Nathan Tyler Rose"
        ],
        "description": "This course is designed for students who are preparing for careers as professional pilots or dispatchers and require an advanced knowledge of the impact of weather on aviation operations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Advanced Transport Flight Operations",
        "subjectCode": "AT",
        "courseCode": "32700",
        "instructor": [
            "Julius C Keller"
        ],
        "description": "This course addresses advanced aviation topics to include high speed aerodynamics, automated cockpit instrumentation, domestic/international flight operations, and global navigation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Avionics Systems",
        "subjectCode": "AT",
        "courseCode": "33502",
        "instructor": [
            "Donald Keith Barnes"
        ],
        "description": "This course covers the theory of operation and applications of common electrical components used in various aircraft circuits.  The theory and mathematical relationships of alternating current, reactance, impedance, and phase shift are examined. Operational theory, installation practices, and troubleshooting concepts of common aircraft communication and navigation systems are investigated.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Airline Management",
        "subjectCode": "AT",
        "courseCode": "33800",
        "instructor": [
            "Volodymyr Bilotkach"
        ],
        "description": "This course is a detailed study of airline management principles and processes. Topics include airline, economics, organization, forecasting, marketing, alliances, pricing, scheduling, finance, fleet planning, labor relations and air freight. Business ethics pertaining to airlines are introduced.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Turbine Flight Operations Lecture",
        "subjectCode": "AT",
        "courseCode": "35400",
        "instructor": [
            "Raymond F Gephart"
        ],
        "description": "A study of corporate aircraft systems and operations and an orientation to operational procedures.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Airport Management",
        "subjectCode": "AT",
        "courseCode": "35900",
        "instructor": [
            "Stewart W Schreckengast"
        ],
        "description": "This course is a study of the history and development of contemporary airport facilities. Areas of study will include FAA airport design requirements, master plans, and airport operations. Field trips may be required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Aviation Operations",
        "subjectCode": "AT",
        "courseCode": "36201",
        "instructor": [
            "Caroline Kathure Marete",
            "Laurent Claude Rouaud"
        ],
        "description": "This course introduces students to the principles of managing a complex aviation operation. Students will be assigned active roles in monitoring and reporting on aircraft flight and maintenance practices. Every student will be assigned a role as part of a small group whose responsibility is to gather appropriate information, develop reports, and conduct practical research tasks as assigned. Weekly and monthly group meetings will be conducted similar to those found in the airline industry with students playing an active role in these meetings.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Fundamentals Of Powerplant Systems",
        "subjectCode": "AT",
        "courseCode": "36302",
        "instructor": [
            "Tracy L Yother"
        ],
        "description": "This course covers powerplant systems, including fuel metering devices, ignition systems, and propeller and propeller-related systems. Students learn to use the special tools required for these systems, and the processes for inspection, repair, and overhaul. Airworthiness evaluation and determination is stressed, as are testing and fault diagnosis procedures. The properties and operating characteristics of aircraft fuels are also covered.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Advanced Aircraft Powerplants",
        "subjectCode": "AT",
        "courseCode": "37002",
        "instructor": [
            "Keegan C Pullen"
        ],
        "description": "This course covers the design, construction, operation, and overhaul practices of aircraft reciprocating and small gas-turbine engines. Airworthiness evaluation, fault-isolation techniques, and standard service and maintenance practices are emphasized. Dimensional and visual inspection and testing of engines following overhaul are stressed, as well.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Aircraft Maintenance Practices",
        "subjectCode": "AT",
        "courseCode": "37200",
        "instructor": [
            "David W Gouwens"
        ],
        "description": "An in-depth study of practices and procedures used to ensure that an aircraft is maintained in an airworthy state. Aircraft publications and maintenance methodology are emphasized.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Aircraft Gas Turbine Engine Technology I",
        "subjectCode": "AT",
        "courseCode": "37600",
        "instructor": [
            "John M Davis"
        ],
        "description": "Basic aircraft gas turbine engine theory, nomenclature, component design, turbine engine systems, operation, and fault isolation techniques are emphasized. Turbine engine maintenance, overhaul, operation, and inspection procedures are studied in detail.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Design Support Analysis",
        "subjectCode": "AT",
        "courseCode": "38500",
        "instructor": [
            "James Mark Thom"
        ],
        "description": "This course is designed to teach students interested in engineering design, design support, customer support, or aerospace manufacturing, the elements of product support and the analysis of design as related to the manufacturability, maintainability, and supportability of aerospace products. The students will be expected to complete a life cycle cost analysis and logistics plan for a design.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Large Aircraft Systems",
        "subjectCode": "AT",
        "courseCode": "38800",
        "instructor": [
            "Dimitrios Ziakkas"
        ],
        "description": "This course introduces transport aircraft limitations, systems, and systems operation. Topics include turbojet aircraft powerplants, flight instruments, electrical power, air-conditioning, pressurization, hydraulic, and flight control systems. Emphasis is aircraft and systems manufacturer's design and operational philosophies.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Unmanned Aerial Systems Project Planning And Management",
        "subjectCode": "AT",
        "courseCode": "40900",
        "instructor": [
            "Damon J Lercel"
        ],
        "description": "  UAS capstone course. Application of UAS technologies across multiple commercial type scenarios. A demonstration of the cumulative knowledge and skills learned in previous UAS courses. Requires current FAA Part 107 Remote Pilot Certificate.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Aviation Finance",
        "subjectCode": "AT",
        "courseCode": "41200",
        "instructor": [
            "Fecri Karanki",
            "Shantanu Gupta"
        ],
        "description": "The course will focus on the financial knowledge needed to operate and evaluate aviation businesses. Content will cover the impact of financial decisions on operational outcomes that add/decrease value to an aviation company's bottom line. Case studies will be utilized to demonstrate practical aspects of financial decisions as they relate to organizational performance and profitability.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Airline Indoctrination",
        "subjectCode": "AT",
        "courseCode": "41600",
        "instructor": [
            "Paul B Strickland"
        ],
        "description": "This course provides the background knowledge required to serve as a crewmember operating a transport-category airplane. Topics include aircraft systems, airline operations, and FAR Part 121 regulations.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Airline Operations",
        "subjectCode": "AT",
        "courseCode": "43800",
        "instructor": [
            "Michael Wayne Suckow"
        ],
        "description": "Students in this course study airline operations in depth. Topics include marketing, route analysis, aircraft selection, financial analysis, federal regulations, and scheduling. Currently industry problems are discussed as well.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Aircraft Electronics",
        "subjectCode": "AT",
        "courseCode": "44502",
        "instructor": [
            "Donald Keith Barnes"
        ],
        "description": "A study of the computer-based electronic systems used to control both flight and engine parameters on modern aircraft. The course examines the various systems with an emphasis on how each component integrates into the electronic structure of the aircraft.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Airport Operations",
        "subjectCode": "AT",
        "courseCode": "45100",
        "instructor": [
            "Adam W Baxmeyer"
        ],
        "description": "This course is an in-depth examination of airport operations for air carrier and general aviation airports, with a strong emphasis on practical problem solving of current operational issues facing local and area airports.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Advanced Composite Technology",
        "subjectCode": "AT",
        "courseCode": "47200",
        "instructor": [
            "Garam Kim"
        ],
        "description": "Students will perform a variety of fabrication, testing, and repair tasks using specialized composite fibers, matrices, and core materials.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Aviation Law",
        "subjectCode": "AT",
        "courseCode": "47500",
        "instructor": [
            "Stewart W Schreckengast"
        ],
        "description": "A study of the fundamental legal and aviation law principles as they apply to the various participants in the aviation industry. Special emphasis is placed on contemporary aviation law issues such as pilot, flight instructor, and mechanic liability; product liability; and aviation insurance.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Aircraft Gas Turbine Engine Technology II",
        "subjectCode": "AT",
        "courseCode": "47600",
        "instructor": [
            "John M Davis"
        ],
        "description": "This is a study of turbofan engines and systems. Engine installation, testing, and operational procedures are stressed. Emphasis is placed on performance evaluation, data calculations, and predictions of operational properties. Turbofan design theory, operational efficiencies, and fault isolation are discussed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Aviation Safety Problems",
        "subjectCode": "AT",
        "courseCode": "48100",
        "instructor": [
            "Chien-Tsung Lu",
            "John H Mott"
        ],
        "description": "This course provides the opportunity for students to study problems associated with aviation safety. Particular attention will be given to the formulation of specific recommendations for improvements in aviation safety.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Aviation Project",
        "subjectCode": "AT",
        "courseCode": "49000",
        "instructor": [
            "Thomas C Hagovsky"
        ],
        "description": "Independent study for junior and senior students who wish to pursue study and developmental work in special areas. Subject matter must be arranged with the instructor before enrolling in the course. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Aircraft Airworthiness Assurance",
        "subjectCode": "AT",
        "courseCode": "49200",
        "instructor": [
            "Timothy D Ropp"
        ],
        "description": "Practicum in performing aircraft maintenance and inspection to airworthiness standards for large aircraft, incorporating Quality and Safety Management Systems into maintenance operations, planning and executing maintenance on large aircraft and managing technical teams.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Capstone Project Proposal",
        "subjectCode": "AT",
        "courseCode": "49401",
        "instructor": [
            "Michael Wayne Suckow"
        ],
        "description": "Students will study all aspects of a possible capstone project and will develop a proposal for conducting an applied research project.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Applied Capstone Research Project",
        "subjectCode": "AT",
        "courseCode": "49501",
        "instructor": [
            "Michael Wayne Suckow"
        ],
        "description": "Students will complete the applied capstone project defined in AT 49401.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Applied Research Proposal",
        "subjectCode": "AT",
        "courseCode": "49600",
        "instructor": [
            "Timothy D Ropp"
        ],
        "description": "Students will study all aspects of performing a product or process design review and life-cycle management analysis. Topics include reliability, supportability, life cycle management, and performance analysis. Each student will select their capstone research area and development a proposal for conducting a product or process analysis for their applied research project.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Applied Research Project",
        "subjectCode": "AT",
        "courseCode": "49700",
        "instructor": [
            "Timothy D Ropp"
        ],
        "description": "This capstone course requires students to conduct an in-depth product or process evaluation. The evaluation includes analyzing product or process performance against design criteria to complete their applied research project.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Aviation Technology Capstone",
        "subjectCode": "AT",
        "courseCode": "49800",
        "instructor": [
            "Chien-Tsung Lu"
        ],
        "description": "The Aviation Technology Capstone course encourages teamwork in small groups on a substantial project. The intent of this course is to provide a capstone experience that integrates the material and previous experience of the student's curriculum. It also provides an opportunity for students to recognize and evaluate the interrelationship of their general education courses with the courses taken for their major.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Research Methods In Aviation",
        "subjectCode": "AT",
        "courseCode": "50500",
        "instructor": [
            "Volodymyr Bilotkach"
        ],
        "description": "This course explores the practical approach to research as it applies to identifying and exploring pragmatic problems in aviation industry settings. Industry based problems and issues often require a diversity of research skills, both quantitative and qualitative, in order to effectively address dynamic problems in complex and often high-risk work environments. This course offers an overview of mixed research methods which lends itself well to practical problem solving in industry. This course may also be offered in an online format. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Quantitative Research Methodologies In Transportation",
        "subjectCode": "AT",
        "courseCode": "50700",
        "instructor": [
            "Laurent Claude Rouaud"
        ],
        "description": "This course provides an introduction to business statistics with a specific focus on data analyses and managerial decision making in the transportation industry. Topics include descriptive statistics, probability models, estimation, hypothesis testing, and regression analysis. Students use software to perform their own analyses. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Quality And Productivity In Industry And Technology",
        "subjectCode": "AT",
        "courseCode": "50800",
        "instructor": [
            "Fecri Karanki"
        ],
        "description": "<a href=\"javascript:history.go(-1)\" onmouseover=\"window.status='Return to Previous';  return true\" onfocus=\"window.status='Return to Previous';  return true\" onmouseout=\"window.status='';  return true\" onblur=\"window.status='';  return true\">Return to Previous</a>",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Operational Assessment And Improvement",
        "subjectCode": "AT",
        "courseCode": "52000",
        "instructor": [
            "Tracy L Yother"
        ],
        "description": "This course focuses on developing the skills to analyze, formulate, and apply techniques for work task improvement. Concepts to be studied include workflow enhancement, critical element streamlining, and value added analysis. Students will explore process map construction, process ownership, measurement system validation, standards creation, and decision factors. An industry project will be assigned and used to facilitate course objectives. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Aviation Leadership",
        "subjectCode": "AT",
        "courseCode": "52600",
        "instructor": [
            "John H Mott"
        ],
        "description": "This course is intended for future aviation and aerospace managers. Using foundational readings, case studies, and critical analysis techniques, the contribution of past and contemporary aviation leaders will be reviewed. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "International Civil Aviation Regulatory Systems",
        "subjectCode": "AT",
        "courseCode": "53100",
        "instructor": [
            "Dimitrios Ziakkas"
        ],
        "description": "This course provides extensive multi-modal transportation security experience. Students will receive detailed information on air, maritime, rail, mass transit, trucking and oil pipeline security programs, as well as applicable threat mitigation processes. Completion of an undergraduate course in either aviation law or aviation security is recommended. This course may be applicable to undergraduates with appropriate experience and background in aviation or other transportation systems. There are no citizenship or security clearance requirements for this course.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Aviation Financial Instruments And Operations",
        "subjectCode": "AT",
        "courseCode": "54600",
        "instructor": [
            "Yi Gao"
        ],
        "description": "The course concentrates on increasing the understanding of financial expertise in analyzing trading and hedging programs for application in reducing aviation operational risk exposure. The studies include research into the development and use of operational indexes and their possible relation to hedging with commodity and security instruments. Emphasis will be placed on the understanding of current operational measurements and correlations to trading and hedging financial instruments in providing improved risk management in operational environments.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Aircraft Asset Management",
        "subjectCode": "AT",
        "courseCode": "54800",
        "instructor": [
            "John M Davis"
        ],
        "description": "This course provides the student with a detailed exploration of aircraft asset management programs in both airlines and business aviation organizations. Students analyze and study the critical components of an asset management program, the financial methods in aircraft asset management, acquisition proposals, and development plans of aircraft acquisitions in this course. An airline industry-relevant project is used to improve student reasoning and application of industry standard aircraft asset management analysis procedures to include forecasting techniques, present value calculations, and benefit-cost analyses. This course serves as the foundational knowledge required for AT 54900.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Critical Systems Thinking",
        "subjectCode": "AT",
        "courseCode": "55000",
        "instructor": [
            "Shantanu Gupta"
        ],
        "description": "This course explores the application of critical systems thinking to complex problems. Using systems theory and case studies developed by technology visionaries, students will investigate alternative solutions to difficult industrial problems with global impact. Outcomes for this course include written assignments, oral presentations, and a final project that addresses a major industrial problem.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Human Error And Safety",
        "subjectCode": "AT",
        "courseCode": "57200",
        "instructor": [
            "Julius C Keller"
        ],
        "description": "Explores the definition and nature of human error, error chains, and causal factors in error generation. Error taxonomies are reviewed in order to provide a classification scheme for grouping errors and assessing error criticality. Methods for assessing risk and predicting error generation potentials are learned, as well as strategies for controlling or eliminating errors. Case studies are utilized throughout the course to illustrate course concepts. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Exploratory Studies In Aviation Human Factors",
        "subjectCode": "AT",
        "courseCode": "57400",
        "instructor": [
            "Dimitrios Ziakkas"
        ],
        "description": "Exploration of contemporary issues and research related to human factors theory and program strategies as they relate to the aviation industry. The course ventures beyond ergonomic issues into more diverse human factors considerations, while discussing an industry-wide and organizational perspective. The course utilizes a combination of lecture, group discussion, and independent study into issues relevant to student interests and career goals. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Aviation Applications Of GIS",
        "subjectCode": "AT",
        "courseCode": "58100",
        "instructor": [
            "Joseph P Hupy"
        ],
        "description": "Advanced study of technical and professional topics. Emphasis is on new developments relating to technical, operational, and training aspects of industry and technology education.",
        "capacity": 0,
        "credits": [
            0,
            8
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Aviation Safety Program Development",
        "subjectCode": "AT",
        "courseCode": "67500",
        "instructor": [
            "Chien-Tsung Lu"
        ],
        "description": "This course is designed to provide graduate students with essential information and practical activities necessary to develop and manage effective and comprehensive safety programs for a wide variety of aviation operations. Students will conduct safety research, analyze data, and make presentations based on developed safety systems. Instructor permission required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    }
]