[
    {
        "title": "Fundamentals Of Biology I",
        "subjectCode": "BIOL",
        "courseCode": "11000",
        "instructor": [
            "Sean E Humphrey"
        ],
        "description": "This course is designed primarily to provide an introduction to the principles of biology for students in agriculture and health sciences. Principles of biology, focusing on diversity, ecology, evolution, and the development, structure, and function of organisms.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Fundamentals Of Biology II",
        "subjectCode": "BIOL",
        "courseCode": "11100",
        "instructor": [
            "Denise L Zielinski"
        ],
        "description": "This course is designed primarily to provide an introduction to the principles of biology for students in agriculture and health sciences. Continuation of BIOL 11000. Principles of biology, focusing on cell structure and function, molecular biology, and genetics.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Fundamentals Of Biology",
        "subjectCode": "BIOL",
        "courseCode": "11200",
        "instructor": [
            "Sean E Humphrey"
        ],
        "description": "This course is designed primarily to provide an introduction to the principles of biology. BIOL 11200, 11300 is a two-semester principles of biology sequence that introduces students to the major concepts of the discipline, with emphasis on the experimental and logical basis of the information presented. BIOL 11200/11300 includes lectures on diversity and evolution, and on the development, structure, and function of organisms, cell structure, cell function, ecology, genetics, biochemistry, and molecular biology.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Fundamentals Of Biology",
        "subjectCode": "BIOL",
        "courseCode": "11300",
        "instructor": [
            "Denise L Zielinski"
        ],
        "description": "This course is designed primarily to provide an introduction to the principles of biology. BIOL 11200, 11300 is a two-semester principles of biology sequence that introduces students to the major concepts of the discipline, with emphasis on the experimental and logical basis of the information presented. BIOL 11200/11300 includes lectures on diversity and evolution, and on the development, structure, and function of organisms, cell structure, cell function, ecology, genetics, biochemistry, and molecular biology.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Biology I: Diversity, Ecology, And Behavior",
        "subjectCode": "BIOL",
        "courseCode": "12100",
        "instructor": [
            "Dennis J Minchella"
        ],
        "description": "Creates a framework for ordering biology by examining the unity and diversity of life on earth with an emphasis on ecology, genetics, population biology, evolution, and behavior.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Biology Freshman Honors Seminar",
        "subjectCode": "BIOL",
        "courseCode": "19700",
        "instructor": [
            "Christie L Sahley"
        ],
        "description": "Discussion meetings with Freshman Honors students to cover various aspects of freshman biology, research opportunities in biology, and career choices in biology. Open only to students in the Biological Sciences Honors Program. The credit may be used only toward free electives. Permission of department required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Human Anatomy And Physiology",
        "subjectCode": "BIOL",
        "courseCode": "20300",
        "instructor": [
            "Brent A Branstetter"
        ],
        "description": "A survey of normal structure and function of the human organism. The human is treated as an open system with the capacity to transport material, transform energy, and maintain a homeostatic state. The capacities and limitations of the human to cope with changes in the environment are emphasized. All major systems of the human body and their functions are examined in relation to the living organism. Integrated into the study of the human organism are laboratory exercises that emphasize the essentials of human anatomy and physiology. Not available for credit toward graduation for majors in the Department of Biological Sciences.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Biology For Elementary School Teachers",
        "subjectCode": "BIOL",
        "courseCode": "20500",
        "instructor": [
            "Stuart K White"
        ],
        "description": "Unifying concepts of biology taught with materials appropriate for future elementary school teachers. Does not satisfy requirements for College of Science Majors. Not available for credit toward graduation for majors in the Department of Biological Sciences.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Microbiology",
        "subjectCode": "BIOL",
        "courseCode": "22100",
        "instructor": [
            "Donald Lewis Pappas"
        ],
        "description": "The isolation, growth, structure, function, heredity, identification, classification, and ecology of microorganisms; their role in nature; and significance to man. Not available for credit toward graduation for majors in the Department of Biological Sciences. CTL: ILS 1505 Microbiology for the Health Sciences",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Biology Of The Living Cell",
        "subjectCode": "BIOL",
        "courseCode": "23000",
        "instructor": [
            "Edward L Bartlett"
        ],
        "description": "An introduction to modern cell biology for students who may not have taken a previous college course in biology. All students with the appropriate prerequisites are welcome, and this course will be of special interest to students from engineering, chemistry, physics and computer science. This course will provide a solid foundation in modern cell biology concepts for engineers and students from other disciplines.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Biology III: Cell Structure And Function",
        "subjectCode": "BIOL",
        "courseCode": "23100",
        "instructor": [
            "Andrea L Kasinski"
        ],
        "description": "An introduction to modern cell biology through an examination of the physical and chemical properties that lead to an understanding of the molecular basis for cell function.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "The COVID-19 Pandemic",
        "subjectCode": "BIOL",
        "courseCode": "39500",
        "instructor": [
            "Wen Jiang",
            "David A Sanders"
        ],
        "description": "Reading, discussions, written reports, seminar presentations, and field or laboratory work provided for enrichment in special areas of the biological sciences. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            18
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Premedical Planning Seminar",
        "subjectCode": "BIOL",
        "courseCode": "39600",
        "instructor": [
            "Caralynn S Hines-Pham"
        ],
        "description": "This course is designed for sophomore and junior students who are planning to attend medical school. The course offers information and advice on the MCAT, the application process, the personal statement, the interview, and letters of recommendation. Students in the course will also formulate an alternative career plan. The course meets the first 10 weeks of the semester.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Eukaryotic Cell Biology",
        "subjectCode": "BIOL",
        "courseCode": "42000",
        "instructor": [
            "Ruben C Aguilar"
        ],
        "description": "Composition, structure, regulation, and growth of eukaryotic cells.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Neurobiology",
        "subjectCode": "BIOL",
        "courseCode": "43600",
        "instructor": [
            "Daniel M Suter"
        ],
        "description": "This course will cover key aspects in molecular, cellular, and developmental neurobiology. Topics include: Cell biology of neurons and glia, electrophysiological properties of neurons, electrical and chemical signaling between neurons, synaptic integration and plasticity, development and regeneration of the nervous system, nervous system diseases. Up-to-date research findings and techniques will be included.  A basic knowledge of cell biology and protein structure and function is strongly recommended.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "General Microbiology",
        "subjectCode": "BIOL",
        "courseCode": "43800",
        "instructor": [
            "Bruce M Applegate"
        ],
        "description": "An examination of microbial diversity that emphasizes the interrelationship of bacteria and their environments. This includes aspects of cell composition, metabolism, and growth of microorganisms.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Biology Senior Seminar In Genetics",
        "subjectCode": "BIOL",
        "courseCode": "44100",
        "instructor": [
            "Jason A Hanna"
        ],
        "description": "This is a required course for genetics majors. It provides exposure to current research in genetics and molecular biology via invited faculty speakers. Students enrolled in the course who have actively participated in research also give a presentation on their own work. Other students are assigned to review current literature in one aspect of the semester's topic. The topic selected for review is in an area of current research in genetics and may vary from year to year.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Bioinformatics",
        "subjectCode": "BIOL",
        "courseCode": "47800",
        "instructor": [
            "Michael R Gribskov"
        ],
        "description": "(CS 47800) Bioinformatics is broadly defined as the study of molecular biological information, targeting particularly the enormous volume of DNA sequence and functional complexity embedded in entire genomes. Topics will include understanding the evolutionary organization of genes (genomics), the structure and function of gene products (proteomics), and the dynamics of gene expression in biological processes (transcriptomics). Inherently, bioinformatics is interdisciplinary, melding various applications of computational science with biology. This jointly taught course introduces analytical methods from biology, statistics and computer science that are necessary for bioinformatics investigations. The course is intended for junior and senior undergraduates from various science backgrounds. Our objective is to develop the skills of both tool users and tool designers in this important new field of research.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Biodiversity & Museum Research",
        "subjectCode": "BIOL",
        "courseCode": "49500",
        "instructor": [
            "Qixin He",
            "Daniel Park"
        ],
        "description": "Readings, discussions, written reports, seminar presentations, and field or laboratory work provided for enrichment in special areas of the biological sciences. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            18
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Medical Microbiology",
        "subjectCode": "BIOL",
        "courseCode": "53300",
        "instructor": [
            "Seema Mattoo"
        ],
        "description": "Host-parasite relationships. Immunology. Bacteria and viruses associated with infectious diseases.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Immunobiology",
        "subjectCode": "BIOL",
        "courseCode": "53700",
        "instructor": [
            "Qing Deng"
        ],
        "description": "Readings and discussion in the structural, cellular, and genetic basis of the immune response. Biology 420 recommended as a prerequisite.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Molecular Genetics Of Bacteria",
        "subjectCode": "BIOL",
        "courseCode": "54100",
        "instructor": [
            "Leslie N Csonka"
        ],
        "description": "Advanced bacterial genetics, with emphasis on the use of genetics as a powerful and creative intellectual activity that enables us to discover biological functions and to construct new organisms by the manipulation of DNA. Major topics include: mutations, genetic selections, recombination, regulatory mechanisms, and genomic evolution.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Ecological Statistics",
        "subjectCode": "BIOL",
        "courseCode": "58210",
        "instructor": [
            "Esteban Fernandez-Juricic"
        ],
        "description": "This course covers topics that are useful for successfully designing and analyzing statistically observational and experimental studies in ecology, animal behavior, evolutionary biology, forestry, wildlife sciences, fisheries, etc. Some topics are: differences between hypotheses and predictions, design of an ecological study, general linear models, assumptions, different types of designs (factorial, nested, repeated measures, blocks, split-plots, etc.), fitting models to data, etc. The course will focus on the conceptual understanding of these topics (e.g., interpreting the results of statistical tests) and practice with statistical programs and real datasets.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Animal Communication",
        "subjectCode": "BIOL",
        "courseCode": "58705",
        "instructor": [
            "Jeffrey R Lucas"
        ],
        "description": "This course will be a broad-scaled analysis of animal communication. Topics will include the physics of sound- and light-signal production, propagation and reception of signals, the use of communication as a means of information transfer, and the evolution of signaling systems. Mathematical principles are covered (e.g. in the evolution of signals), so some background in mathematics (e.g. calculus or algebra and introductory physics) is helpful.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Meth Meas Biophys Chem",
        "subjectCode": "BIOL",
        "courseCode": "59500",
        "instructor": [
            "Wen Jiang",
            "Michael R Gribskov",
            "Cynthia V Stauffacher",
            "Christopher J Staiger",
            "Ximena Bernal"
        ],
        "description": "Special work, such as directed reading, independent study or research, supervised library, laboratory, or field work, or presentation of material not available in the formal courses of the department. The field in which work is offered will be indicated in the student's record. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            18
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Cellular Neurobiology",
        "subjectCode": "BIOL",
        "courseCode": "60200",
        "instructor": [
            "Alexander A Chubykin"
        ],
        "description": "This course covers principles of neurophysiology and cell, molecular and developmental neurobiology for graduate students from a wide range of disciplines. Course material will involve lectures and assigned textbook readings, homework problems and in-class discussions based on selected readings of the primary literature, and computer-based simulations of neurophysiology. Grades will be based on participation in class discussions, graded homework sets and exams (a midterm and a final exam).",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Advanced Ecology Discussion",
        "subjectCode": "BIOL",
        "courseCode": "65200",
        "instructor": [
            "Jeffrey R Lucas"
        ],
        "description": "Weekly meetings to discuss and evaluate seminal papers in the fields of evolutionary, population, and community ecology. During the last week, students will critically evaluate a contemporary paper on a topic related to the \"classic\" papers discussed during the semester. Students will have a choice among papers submitted by participating faculty members; their critique will be assessed on content, originality, rigor, and clarity.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Seminar Methods And Professional Development I",
        "subjectCode": "BIOL",
        "courseCode": "66200",
        "instructor": [
            "Seema Mattoo"
        ],
        "description": "An introduction for incoming graduate students to methods of seminar presentation and critique and to various guidelines for professional development during their graduate school experience. Topics include research laboratory safety (REM), how to give a talk, acclimating to graduate studies (especially time management), how to select a major professor and an advisory committee, how to prepare for qualifying exams, Purdue University guidelines for responsible conduct of research, how to organize a poster presentation, how to negotiate with mentors, and expectations for success. The course also serves to socialize the incoming cohort of students among themselves and with more senior students in the broad range of research disciplines available.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Structural Biol Rsrch Seminar",
        "subjectCode": "BIOL",
        "courseCode": "69500",
        "instructor": [
            "Qixin He",
            "Nicholas Noinaj",
            "Angeline M Lyon",
            "John Joseph Tesmer",
            "Stephanie M Gardner"
        ],
        "description": "Special work, such as directed reading; independent study or research; supervised library, laboratory, or field work; or presentation of material not available in the formal courses of the department. The field in which work is offered will be indicated in the student's record. Primarily for Ph.D. candidates. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            18
        ],
        "term": "Fall 2022"
    }
]