[
    {
        "title": "Introduction To Plant Science",
        "subjectCode": "BTNY",
        "courseCode": "11000",
        "instructor": [
            "Jeneen S Fields"
        ],
        "description": "An introduction to the major groups in the plant kingdom, their origin, classification, and economic importance. The areas of anatomy, morphology, cytology, physiology, biochemistry, molecular biology, genetics, and ecology will be explored as they relate to plant sciences and agriculture. Course may also be offered for dual credit with cooperating Indiana high schools upon documented approval by the Department of Botany and Plant Pathology.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Principles Of Plant Biology I",
        "subjectCode": "BTNY",
        "courseCode": "12000",
        "instructor": [
            "Leonor Maria de Fatima Chagas Boavida"
        ],
        "description": "This course is the first of a two-semester series that provides an introduction to fundamental biological concepts as they relate to plant biology to better prepare students for more specialized study. Lectures and laboratory exercises will cover mechanisms and processes of plant diversity, anatomy, morphology, cell biology, growth and development. Our goal is to convey how these levels of organization and processes contribute to the relative success of plants within and across environments. Throughout the course, an emphasis will be placed on how scientific data are collected and interpreted, and key experiments performed in the lab component will be used to illustrate this process.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Plant Science Research",
        "subjectCode": "BTNY",
        "courseCode": "20800",
        "instructor": [
            "Leonor Maria de Fatima Chagas Boavida"
        ],
        "description": "The course is designed to expose students to the diversity of Plant Science research at Purdue and help students to get started in research and in the fantastic world of scientific discovery. Students will learn the importance of Plant Science research in society and how to become active participants of Purdue research discoveries. Students will learn about the scientific method and how discoveries are made to find answers to world problems. The students will explore department and campus resources to identify areas of research interest, learn how to search and apply for research/internship opportunities and find faculty that can serve as professional models and mentors. We will provide opportunities for students to interact and network with faculty members, professionals from industry and students involved in diverse research areas.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Plant Structure And Tissue Biology",
        "subjectCode": "BTNY",
        "courseCode": "26200",
        "instructor": [
            "Yun Zhou"
        ],
        "description": "This course focuses on fundamental knowledge of the internal structure of plants, including distinct cell types, tissues, tissue systems, and organs that make up a plant. Lectures and laboratories will cover the structural parts that comprise the plant body including three major vegetative organs (roots, stems, and leaves) and a set of reproductive organs (flowers, fruits, and seeds). The goal of this course is to understand the internal organization of plants, to learn multiple lab techniques critical for plant science research, and to develop critical thinking and problem solving skills.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Plants And Civilization",
        "subjectCode": "BTNY",
        "courseCode": "28500",
        "instructor": [
            "Gyeong Mee Yoon"
        ],
        "description": "This course, intended primarily for non-majors, covers the history of agriculture, with focus on the centers of origin of our major food, fiber, and medicinal plants, and their historical, cultural, and economic relevance. The course also surveys the biology of crop plants, with respect to taxonomy, anatomy, cell structure, physiology, development, and genetics. Discussions also center on the roles plant biotechnology may play in sustainable agriculture and in helping to alleviate problems caused by overpopulation and ecological stress.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introductory Plant Pathology",
        "subjectCode": "BTNY",
        "courseCode": "30100",
        "instructor": [
            "Loretta Sue Loesch-Fries"
        ],
        "description": "Basic principles of plant pathology, including etiology, symptomatology, control, and epidemiology of representative diseases of plants.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introductory Weed Science",
        "subjectCode": "BTNY",
        "courseCode": "30400",
        "instructor": [
            "Bryan G Young"
        ],
        "description": "A survey of the scientific principles underlying weed control practices; emphasis is on the ecology of weeds and control in crop associations. It is recommended that this course be followed by BTNY 50400.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Plant Evolution And Taxonomy",
        "subjectCode": "BTNY",
        "courseCode": "30500",
        "instructor": [
            "Scott Mcadam"
        ],
        "description": "The principles of classification of seed plants, with emphasis on methods of identification in laboratory and field. Requires class trips. Students will pay individual lodging or meal expenses when necessary.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Undergraduate Seminar",
        "subjectCode": "BTNY",
        "courseCode": "49700",
        "instructor": [
            "William G Johnson"
        ],
        "description": "Professional preparation for careers in plant sciences. Career development activities including resume and cover letter preparation, job search and interview preparation, and participation in career fairs. In addition, the student will polish skills in preparation of seminar, extension publications, press releases and communicating science to lay personnel based on current issues in pest management and crop protection.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Advanced Biology Of Weeds",
        "subjectCode": "BTNY",
        "courseCode": "50500",
        "instructor": [
            "Kevin D Gibson"
        ],
        "description": "Principles of weed biology and ecology, with focus on reproduction and ecophysiology, population dynamics, community ecology, and ecosystem level phenomena. Instruction will emphasize the development and refinement of critical thinking skills.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Pathogens Of Plants",
        "subjectCode": "BTNY",
        "courseCode": "55800",
        "instructor": [
            "Zhixiang Chen"
        ],
        "description": "Plant pathology is the science of plant diseases and of the microorganisms that cause them and of our attempts to manage plant diseases. The ultimate goal of plant pathologists is to reduce the losses caused by diseases, thereby, increasing both the quality and quantity of the world food supply. Plant diseases are caused by the same types of microorganisms that cause disease in animals and humans and, as such, many of the principles that apply to human and animal medicine apply to plant diseases. It is the objective of this course to introduce students to the major types of plant pathogens (plant pathogenic bacteria, viruses, nematodes, and fungi), their basic biology and examples of the types of diseases they cause. It will be expected that students have knowledge in plant pathology.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Preparing For Post-PhD Careers",
        "subjectCode": "BTNY",
        "courseCode": "59000",
        "instructor": [
            "Michael V Mickelbart",
            "Anjali S Iyer-Pascuzzi",
            "Christopher J Staiger",
            "Chao Cai"
        ],
        "description": "Open to graduate students and qualified undergraduates who desire to study special problems in plant science not covered in regular coursework. Credit dependent upon work done. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Skills For Success In Grad School",
        "subjectCode": "BTNY",
        "courseCode": "69100",
        "instructor": [
            "Sharon A Kessler"
        ],
        "description": "This course is aimed at first year graduate students in the Botany department. Its purpose is to introduce the students to the department, teach them what it takes to be a successful graduate students, and to help them develop effective written and oral communication skills.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    }
]