[
    {
        "title": "General Chemistry",
        "subjectCode": "CHM",
        "courseCode": "11100",
        "instructor": [
            "Cynthia A Harwood",
            "Richard M Hines"
        ],
        "description": "Not available for credit toward graduation in the School of Science. Required of all freshmen in the School of Agriculture who are not in CHM 11500 and required of students in the School of Consumer and Family Sciences in retailing, textile, RHIT, and dietetics options who are not in CHM 11500. Required of students in physical therapy who are not in CHM 11500. Not available for credit toward graduation in the School of Science. Metric and S.I. Units; dimensional analysis; density; the atomic concept; elements, compounds, and mixtures; the mole concept; equations and stoichiometry; atomic structure, spectra; the periodic table; chemical bonding, gases; descriptive chemistry of the common elements.  Prerequisite: two years of high school algebra. CTL:IPS 1721 General Chemistry I w/lab",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "General Chemistry",
        "subjectCode": "CHM",
        "courseCode": "11500",
        "instructor": [
            "John J Nash",
            "Mallory Kathleen Kern",
            "Gudrun Schmidt"
        ],
        "description": "Stoichiometry; atomic structure; periodic properties; ionic and covalent bonding; molecular geometry; gases, liquids, and solids; crystal structure; thermochemistry; descriptive chemistry of metals and non-metals. Required of students majoring in science and students in engineering who are not in CHM 12300. One year of high school chemistry or one semester of college chemistry required. CTL:IPS 1721 General Chemistry I w/lab",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "General Chemistry",
        "subjectCode": "CHM",
        "courseCode": "11600",
        "instructor": [
            "John J Nash"
        ],
        "description": "A continuation of CHM 11500. Solutions; quantitative equilibria in aqueous solution; introductory thermodynamics; oxidation-reduction and electrochemistry; chemical kinetics; qualitative analysis; further descriptive chemistry of metals and nonmetals. CTL:IPS 1722 General Chemistry II w/lab",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Chemistry I",
        "subjectCode": "CHM",
        "courseCode": "12500",
        "instructor": [
            "Jonathan C Rienstra-Kiracofe"
        ],
        "description": "Principles of chemistry including stoichiometry; atomic structure and chemical bonding; properties of gases, liquids, and solids; thermochemistry; descriptive inorganic chemistry. Recommended for entering students intending to major in chemistry. One year of high school chemistry or one semester of college chemistry required.",
        "capacity": 0,
        "credits": [
            5,
            5
        ],
        "term": "Fall 2022"
    },
    {
        "title": "General Chemistry With A Biological Focus",
        "subjectCode": "CHM",
        "courseCode": "12901",
        "instructor": [
            "Jeanine A Conklin"
        ],
        "description": "An accelerated and comprehensive one-semester general chemistry course that emphasizes principles that are important in biological systems. This course is designed to cover the essential elements of general chemistry traditionally covered in a two semester series. Topics to be covered include: Stoichiometry and chemical equations; atomic theory and structure; periodic properties; electronegativity; ionic and covalent bonding; non-covalent forces; bond energies; Lewis structures; molecular geometry; gases, liquids, and solids; solutions, quantitative equilibria in aqueous solution; acid/base chemistry and buffers; introductory thermodynamics; oxidation-reduction; electrochemical and membrane potential; colligative properties; chemical and enzyme kinetics; nuclear chemistry; coordination chemistry. One year of high school chemistry is required.",
        "capacity": 0,
        "credits": [
            5,
            5
        ],
        "term": "Fall 2022"
    },
    {
        "title": "General Chemistry Honors",
        "subjectCode": "CHM",
        "courseCode": "13600",
        "instructor": [
            "Adam Wasserman"
        ],
        "description": "A sophisticated treatment of the principles of chemistry. Atomic structure and bonding, spectroscopy, equilibria, thermodynamics and kinetics. Includes weekly laboratory experiments. Two years of high school chemistry recommended. Students with a grade of C or better in CHM 13600 who need 8 hours of credit in general chemistry may request credit for CHM 11500.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Freshman Chemistry Orientation",
        "subjectCode": "CHM",
        "courseCode": "19400",
        "instructor": [
            "Christine M Schertz"
        ],
        "description": "Designed to provide incoming chemistry majors with the academic, survival, and computational skills to make a successful transition from high school to college. Discussion of opportunities within the chemistry department including degree options, co-op program, undergraduate research, careers in chemistry, use of spreadsheet software, graphing packages, and drawing programs for chemical structures. Attendance and performance on assigned projects are the basis of the assigned grades.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Chemistry Freshman Honors Research",
        "subjectCode": "CHM",
        "courseCode": "19700",
        "instructor": [
            "Christine M Schertz"
        ],
        "description": "Supervised individual research performed by student.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Organic Chemistry",
        "subjectCode": "CHM",
        "courseCode": "25500",
        "instructor": [
            "Bryon Shane Drown",
            "Elizabeth I Parkinson"
        ],
        "description": "A study of aliphatic and aromatic hydrocarbons and their simple derivatives in terms of (a) structure, bonding, etc.; (b) general syntheses and reactions; and (c) a logical modern rationale for fundamental phenomena as supported by reactivity orders, orientation effects, stereochemistry, and relative rates. Recommended for biology majors.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Organic Chemistry",
        "subjectCode": "CHM",
        "courseCode": "25600",
        "instructor": [
            "Abram J Axelrod"
        ],
        "description": "A continuation of CHM 25500 with various functional groups such as the carboxyl, amino, etc., and including such polyfunctional natural products as carbohydrates and peptides.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Organic Chemistry",
        "subjectCode": "CHM",
        "courseCode": "25700",
        "instructor": [
            "Padinjaremadhom V Ramachandran"
        ],
        "description": "Introductory organic chemistry. Emphasis is on structure, nomenclature, reactions, and theory as applied to simple organic compounds. This course is designed for students who require a one semester overview in preparation for biochemistry. Not recommended for majors in the College of Science. Both CHM 25700 + 25701 = CTL:IPS 1723 Organic And Biochemistry w/lab.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Organic Chemistry I",
        "subjectCode": "CHM",
        "courseCode": "26100",
        "instructor": [
            "Paul G Wenthold"
        ],
        "description": "A comprehensive study of the chemical principles underlying aliphatic and aromatic compounds. The syntheses and reactions of these materials are discussed. Modern theory and stereochemistry are stressed to illustrate the logic inherent in the subject matter and to demonstrate the predictability of many chemical transformations. Recommended for students majoring in chemical engineering. If not a chemical engineering major, see CHM 26505 Organic Chemistry.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Organic Chemistry",
        "subjectCode": "CHM",
        "courseCode": "26505",
        "instructor": [
            "Mark A Lipton"
        ],
        "description": "A comprehensive study of the chemical principles underlying aliphatic and aromatic compounds. The syntheses and reactions of these materials are discussed. Modern theory and stereochemistry are stressed to illustrate the logic inherent in the subject matter and to demonstrate the predictability of many chemical transformations. Recommended for students majoring in chemistry.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Sophomore Chemistry Seminar",
        "subjectCode": "CHM",
        "courseCode": "29400",
        "instructor": [
            "Gudrun Schmidt"
        ],
        "description": "Discussion of undergraduate research opportunities, upper-division courses, career opportunities, laboratory safety, use of the library and chemical information, and topics of current interest in chemistry. Required of sophomores majoring in any chemistry curriculum.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Analytical Chemistry I",
        "subjectCode": "CHM",
        "courseCode": "32100",
        "instructor": [
            "Julia Laskin"
        ],
        "description": "Quantitative measurements on complex chemical systems that show matrix effects or require isolation of a component prior to its determination; general approaches to quantitative problems at the trace level; critical comparisons of competitive procedures with emphasis on principles of separation processes, including chromatography; recognition and evaluation of possible sources of error; approaches for optimizing conditions so as to minimize time and/or effort required to attain prescribed levels of accuracy and precision. Required of students majoring in chemistry.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Analytical Chemistry I Honors",
        "subjectCode": "CHM",
        "courseCode": "32300",
        "instructor": [
            "Julia Laskin"
        ],
        "description": "Open to students in the chemistry honors program. Topical coverage similar to CHM 32100. Laboratory will include a group of core experiments plus special experiments designed by students and staff to study original problems related to analytical chemistry.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Bioinorganic Chemistry",
        "subjectCode": "CHM",
        "courseCode": "34800",
        "instructor": [
            "Jonathan J Wilker"
        ],
        "description": "The fundamentals and applications of metals in biology.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Topics In Physical Chemistry",
        "subjectCode": "CHM",
        "courseCode": "37000",
        "instructor": [
            "Jonathan D Hood"
        ],
        "description": "Kinetic theory of gases; statistical thermodynamics; quantum mechanics; atomic and molecular structure and spectroscopy; properties of ionic phases. May not be used to satisfy requirements for graduation in chemistry.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Physical Chemistry",
        "subjectCode": "CHM",
        "courseCode": "37300",
        "instructor": [
            "Gaurav Chopra"
        ],
        "description": "Physical chemistry of matter. Properties of gases, liquids, and solids; equations of state; thermodynamics; energy, heat, and work; entropy; spontaneity and equilibrium; chemical potential; chemical equilibrium; phase diagrams; colligative properties.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Biochemistry",
        "subjectCode": "CHM",
        "courseCode": "43300",
        "instructor": [
            "Kavita Shah"
        ],
        "description": "A rigorous one-semester introduction to biochemistry, with in-depth coverage of biology at a molecular level. Topics covered include the classes of biological macromolecules, enzyme kinetics and inhibition, and significant metabolic pathways.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Environmental Chemistry",
        "subjectCode": "CHM",
        "courseCode": "48100",
        "instructor": [
            "Alexander Laskin"
        ],
        "description": "Survey of chemical aspects of environmental problems and the application of chemistry to their solution. Topics will include atmospheric pollution problems, groundwater pollution and waste disposal problems, inorganic water pollutants, and the occurrence and fate of toxic organic compounds and other substances in the environment.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Junior-Senior Chemistry Seminar",
        "subjectCode": "CHM",
        "courseCode": "49400",
        "instructor": [
            "Paul G Wenthold"
        ],
        "description": "Major emphasis on developing skills in oral and written presentations by students. The subject matter can be library material and/or accomplishments in undergraduate or co-op research. Department permission required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Modern Chemistry In The High School",
        "subjectCode": "CHM",
        "courseCode": "50200",
        "instructor": [
            "Nobel Sanjay Rebello"
        ],
        "description": "A critical discussion of the means by which the fundamentals of modern chemistry can best be introduced at the high school level. The laboratory will deal with the manufacture and use of lecture demonstration equipment, the use of films and film strips, and the problems involved in organizing and running a high school chemical laboratory.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Organic Spectroscopic Analysis",
        "subjectCode": "CHM",
        "courseCode": "56000",
        "instructor": [
            "Alexander Wei"
        ],
        "description": "Identification of organic compounds and characteristic groups by the use of mass spectrometry, infrared, nuclear magnetic resonance, and ultraviolet spectroscopy.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Atmospheric Chemistry",
        "subjectCode": "CHM",
        "courseCode": "58100",
        "instructor": [
            "Greg M Michalski"
        ],
        "description": "(EAPS 52100) An introduction to the chemistry of the earth's atmosphere. Covers evolution of the earth's atmosphere, its physical and chemical structure, its natural chemical composition and oxidative properties, and human impacts, including increasing tropospheric ozone, decreasing stratospheric ozone, climate change, and acidic deposition.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Teaching In Chemistry",
        "subjectCode": "CHM",
        "courseCode": "59900",
        "instructor": [
            "Ilayda Kelley"
        ],
        "description": "Directed reading or special work not included in other courses. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Safety In The Chemistry Laboratory",
        "subjectCode": "CHM",
        "courseCode": "60500",
        "instructor": [
            "Paul W Bower"
        ],
        "description": "Lectures on safe practices in the chemistry laboratory. Required of students doing research in chemistry.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Spectrochemical Instrumentation",
        "subjectCode": "CHM",
        "courseCode": "62000",
        "instructor": [
            "Shelley A Claridge"
        ],
        "description": "A critical review of instrumental methods of analysis, with particular emphasis on spectroscopic techniques. Topics include: methods of measurement; analog and digital electronics; optics and spectrophotometric modules; and instrumental methods in UV-visible, infrared, and NMR spectroscopies. Prerequisite: introductory analytical and two semesters of physical chemistry.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Chemical Aspects Of Mass Spectrometry",
        "subjectCode": "CHM",
        "courseCode": "62200",
        "instructor": [
            "Hilkka I Kenttamaa"
        ],
        "description": "A graduate-level treatment of chemical aspects of mass spectrometry. No prior knowledge in mass spectrometry is required. Prerequisite: Bachelor's degree in Chemistry.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Membranes: Structure And Function",
        "subjectCode": "CHM",
        "courseCode": "63200",
        "instructor": [
            "Angeline M Lyon"
        ],
        "description": "The structure and molecular properties of biological membranes and appropriate model systems. Offered in alternate years.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Biochemistry: Structural Aspects",
        "subjectCode": "CHM",
        "courseCode": "63400",
        "instructor": [
            "Chittaranjan Das"
        ],
        "description": "Chemistry of materials of biochemical interest; carbohydrates, lipids, proteins, amino acids, nucleic acids, porphyrins; biochemistry of blood. Prerequisite: CHM 26200, 32100, 37400.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Advanced Inorganic Chemistry",
        "subjectCode": "CHM",
        "courseCode": "64100",
        "instructor": [
            "Christina W Li"
        ],
        "description": "Survey of main group and transition metal chemistry. Main group special topics, bonding and structure of boron hydrides. Coordination chemistry, bonding models in coordination compounds. Transition metal organometallic chemistry, ligand types and reactivity patterns. Survey of inorganic NMR spectroscopy. Prerequisite: CHM 34200.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Bioinorganic Chemistry",
        "subjectCode": "CHM",
        "courseCode": "64800",
        "instructor": [
            "Shiliang Tian"
        ],
        "description": "Provides a detailed perspective on the roles of metals in biology. Emphasis is placed upon principles guiding the field. The basics of biochemistry and inorganic chemistry are provided such that students from diverse backgrounds may participate. Readings are from the research literature. Offered in alternate years.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Advanced Organic Chemistry",
        "subjectCode": "CHM",
        "courseCode": "65100",
        "instructor": [
            "Christopher H Uyeda"
        ],
        "description": "Modern structural organic chemistry, including introductions to molecular orbital theory and reaction mechanisms. Prerequisite: a year's course in organic chemistry.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Advanced Physical Chemistry",
        "subjectCode": "CHM",
        "courseCode": "67100",
        "instructor": [
            "Lyudmila V Slipchenko"
        ],
        "description": "Selected topics, including atomic and molecular structure and modern theories underlying thermodynamics and chemical kinetics. Prerequisite: CHM 57800.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Molecular Spectroscopy",
        "subjectCode": "CHM",
        "courseCode": "67605",
        "instructor": [
            "Michael Earl Reppert"
        ],
        "description": "Theoretical and experimental fundamentals of the interactions between molecules and electromagnetic waves. Topics include electronic, vibrational, and rotational spectroscopies, and laser-based methods. Prerequisites: CHM 67100.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Statistical Thermodynamics",
        "subjectCode": "CHM",
        "courseCode": "68200",
        "instructor": [
            "Ming Chen"
        ],
        "description": "Application of statistical mechanics to the description of imperfect gases, liquids, and solutions; to order-disorder phenomena in solids and surfaces; and to absolute reaction rate theory. Prerequisite: CHM 67100, 67900.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Sem Analytical Chem",
        "subjectCode": "CHM",
        "courseCode": "69500",
        "instructor": [
            "Jonathan D Hood",
            "Christina W Li",
            "Paul G Wenthold",
            "Shalini T Low-Nam",
            "Chi Zhang",
            "Shelley A Claridge",
            "Marcy H Towns"
        ],
        "description": "Groups meeting for review and discussion of important current literature in analytical, biological, inorganic, organic, and physical chemistry. Each graduate student is required to attend the seminar of his or her major subject.",
        "capacity": 0,
        "credits": [
            0,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Chemistry Of Polymers",
        "subjectCode": "CHM",
        "courseCode": "69600",
        "instructor": [
            "Chengde Mao",
            "Sabre Kais",
            "Chi Zhang",
            "Jeffrey Edward Dick",
            "Arun K Ghosh",
            "Jianguo Mei"
        ],
        "description": "Lectures on selected topics of current interest.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2022"
    }
]