[
    {
        "title": "Introduction To C Programming",
        "subjectCode": "CNIT",
        "courseCode": "10500",
        "instructor": [
            "Christopher B Davison",
            "Tawfiq M A Salem",
            "Kevin D Taylor"
        ],
        "description": "This course is an introduction to computer programming using the \"C\" language. The emphasis is on structured programming principles, and understanding the basic concepts that apply to engineering problems. Among topics covered in this course are: problem solving using top down design, using flowcharts to explain the program logic, selection structure, repetition structure, bitwise operations, arrays, pointers, strings, passing arguments, and sequential files.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Software Development Concepts",
        "subjectCode": "CNIT",
        "courseCode": "15501",
        "instructor": [
            "Tawfiq M A Salem"
        ],
        "description": "This course introduces fundamental software development concepts common to most programming languages. Topics include problem solving and algorithm development, debugging, programming standards, variables, data types, operators, decisions, repetitive structures, modularity, arrays, user interface construction, software testing and debugging. A broad range of examples will be used throughout the course to show how each programming concept applies to real life problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Visual Programming",
        "subjectCode": "CNIT",
        "courseCode": "17500",
        "instructor": [
            "Ahmad Esmaeili"
        ],
        "description": "This course introduces event-driven application development and programming using a visual programming environment. Topics include problem solving and program design, control structures, objects and events, user interface construction, documentation, and program testing. Credit may be established in only one of: CPT 15500 or CPT 17500 or CPT 25000. PC literacy required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Information Technology Architectures",
        "subjectCode": "CNIT",
        "courseCode": "17600",
        "instructor": [
            "Deepak Nadig Anantha"
        ],
        "description": "A conceptual and technological survey of information technology architectures inclusive of operating systems, network operating systems, distributed systems architectures, and distributed application architectures. Interoperability between these architectural components is explored. Current technology and trends in each architectural element are reviewed. PC literacy required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Systems Development",
        "subjectCode": "CNIT",
        "courseCode": "18000",
        "instructor": [
            "Joseph D Kintzel",
            "Dewey A Swanson",
            "Victor M Barlow"
        ],
        "description": "This course introduces information systems development. Topics include types of information systems, system development, database management systems, and problem solving. Students will read/create UML, ERD, and data flow diagrams to model information system objects, data, processes, and logic. Labs emphasize modeling and SQL/QBE querying to prepare students for later systems, programming, and database classes. Given user requirements students will design, construct, and test a personal computer information system. PC literacy required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "System And Organizational Security",
        "subjectCode": "CNIT",
        "courseCode": "18200",
        "instructor": [
            "Paul Josekutty Thomas"
        ],
        "description": "This class focuses on the security of the design, procurement, testing, analysis and maintenance of components that are integrated into larger systems. Protecting organizations from cybersecurity threats and managing risk to support the successful accomplishment of the organization's mission is also covered.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Data Communications And Networking",
        "subjectCode": "CNIT",
        "courseCode": "24000",
        "instructor": [
            "Robert C Deadman"
        ],
        "description": "This course provides a comprehensive introduction to data communications and networks. Topics include communication standards and concepts, protocols, the Open Systems Interconnect (OSI) model, point-to-point communication, and local area networks. Business issues from both provider and user perspectives are discussed. Current technology and trends in each architectural element are reviewed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "System Administration",
        "subjectCode": "CNIT",
        "courseCode": "24200",
        "instructor": [
            "Robert C Deadman"
        ],
        "description": "This course provides a comprehensive introduction to system administration. Topics include authentication and authorization, directory services, system management and system security. Emphasis is placed on enterprise level systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Object-Oriented Programming Introduction",
        "subjectCode": "CNIT",
        "courseCode": "25501",
        "instructor": [
            "Dominic Kao"
        ],
        "description": "This course introduces software development concepts common to modern object-oriented programming languages. Topics include: intermediate data types, decisions, repetitive structures; methods; arrays and collections; encapsulation, inheritance, and polymorphism; exception handling; data persistence; Database Management System (DBMS) connectivity; user interface construction; software testing and debugging; and working in teams.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Cybersecurity Fundamentals I",
        "subjectCode": "CNIT",
        "courseCode": "27000",
        "instructor": [
            "Nicole M Hands"
        ],
        "description": "This course introduces cybersecurity fundamentals and concepts. Security models that provide a basis for overarching security solutions are introduced to provide a basis for discussion. Risks and vulnerabilities are examined along with technical controls that can be used to mitigate them. The role of security policy and the incident management framework are examined. Emphasis is placed on building a strong foundation for further study in the field.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Cybersecurity Fundamentals II",
        "subjectCode": "CNIT",
        "courseCode": "27100",
        "instructor": [
            "Smriti Bhatt"
        ],
        "description": "Course will investigate additional foundational ideas in cybersecurity and serves as a survey course in the field. The course provides extended exposure to utilizing tools to secure/harden aspects of info systems such as mandatory access control, wireless security, hardware security, cloud security and others.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Database Fundamentals",
        "subjectCode": "CNIT",
        "courseCode": "27200",
        "instructor": [
            "Dewey A Swanson",
            "Sudip Vhaduri",
            "Jeffrey A Griffin"
        ],
        "description": "A study of relational database concepts. These concepts include data design, modeling, and normalization; the use of Structured Query Language (SQL) to define, manipulate, and test the database; programmatic access to a database and practical issues that database developers must handle.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Systems Analysis And Design Methods",
        "subjectCode": "CNIT",
        "courseCode": "28000",
        "instructor": [
            "Alejandra J Magana Deleon",
            "Melissa R Casner"
        ],
        "description": "Comprehensive introduction to information systems development. Topics include the systems analyst, the systems development life cycle, methodologies, development technology, systems planning, project management, systems analysis, systems design, systems implementation, and systems support. Introduction to tools and techniques for systems development.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Game Development I: Core Skills And Technologies",
        "subjectCode": "CNIT",
        "courseCode": "30600",
        "instructor": [
            "Alex Damarjian"
        ],
        "description": "(CGT 24500) This course introduces students to the fundamental technologies and skill sets required to develop video games. Students will be taught agile development methodologies in a team-based environment.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Systems Programming",
        "subjectCode": "CNIT",
        "courseCode": "31500",
        "instructor": [
            "Eric T Matson",
            "Joseph D Kintzel"
        ],
        "description": "This course introduces concepts of lower level systems programming in C/C++ on a UNIX/Linus operation system platform. Command level development, algorithms, data structures, iteration and recursion, algorithms and analysis will be covered.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Policy, Regulation, And Globalization In Information Technology",
        "subjectCode": "CNIT",
        "courseCode": "32000",
        "instructor": [
            "William Chase Ledbetter"
        ],
        "description": "This course provides students with opportunities to study how technology is intertwined with larger economic, social, cultural, and ethical dynamics in an era of intensified globalization. The course examines technology in a global environment. Students will explore concepts and issues related to law, policy, regulation, outsourcing, offshoring, globalization, global competitiveness, global communications, cultural differences and quality of life issues. Students will examine ethical situations that arise as a result of the impact of technology. In summary, the course is designed to help students understand what it means to identify as, and/or work with, technology in a global environment.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Research Methodology And Design",
        "subjectCode": "CNIT",
        "courseCode": "32200",
        "instructor": [
            "Dmitri A Gusev",
            "Tatiana Renae Ringenberg"
        ],
        "description": "This course will discuss scientific research versus pseudoscience, experimental vs. quasi-experimental designs, different research controls and validity issues, and how study designs are used to answer research questions. Students will gain hands-on experience conducting observational and experimental research designs, and the process of writing a formal research paper.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Object-Oriented Application Development",
        "subjectCode": "CNIT",
        "courseCode": "32500",
        "instructor": [
            "Eric T Matson",
            "Dmitri A Gusev"
        ],
        "description": "This course focuses on using object-oriented programming languages in the development of modern, business applications. Topics include object-oriented design, encapsulation, object interfaces, inheritance, aggregation, abstract classes, polymorphism, data structures, and exception handling.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "UNIX Administration",
        "subjectCode": "CNIT",
        "courseCode": "34000",
        "instructor": [
            "Baijian Yang",
            "Melissa R Casner"
        ],
        "description": "This course focuses on the tasks and issues involved in the administration of UNIX systems. Topics include installation, networking, software management, scripting, and user management. In the laboratory portion of the course, students implement and maintain UNIX systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "UNIX Fundamentals",
        "subjectCode": "CNIT",
        "courseCode": "34010",
        "instructor": [
            "Robert C Deadman"
        ],
        "description": "This course focuses on the use and basic administration of UNIX systems. Topics include installation, networking, software management, user management, and security of UNIX systems.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Network Engineering Fundamentals",
        "subjectCode": "CNIT",
        "courseCode": "34400",
        "instructor": [
            "Robert C Deadman"
        ],
        "description": "This course presents the foundations and intermediate levels of understanding required to effectively design, implement, and manage today's networked environments. Details of basic models; network addressing and operations; network protocol interactions; and enterprise-class hardware applications of both wired and wireless networks are provided. Students will gain experience with enterprise-class hardware through laboratory projects and assignments.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Internetwork Design And Implementation",
        "subjectCode": "CNIT",
        "courseCode": "34500",
        "instructor": [
            "Robert C Deadman"
        ],
        "description": "This is an advanced course in network architecture. Students learn to design and implement local and wide area networks capable of simultaneous transport of real-time traffic and multiprotocol data over packet-switched and circuit-switched networks. An emphasis is placed on the integration of diverse communications technologies, while considering the effects of engineering decisions on overall performance, from both business and technology perspectives.",
        "capacity": 0,
        "credits": [
            3,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Wireless Networks",
        "subjectCode": "CNIT",
        "courseCode": "34600",
        "instructor": [
            "Anthony H Smith"
        ],
        "description": "This course introduces wireless networking. Topics include fundamental wireless communication concepts, wireless local area networks (LANs), and cellular systems. Wireless specific protocol elements are addressed in typical application environments. Data communications in multiple wireless environments are emphasized. In the laboratory section, students implement wireless solutions and integrate them into wired LAN environments.",
        "capacity": 0,
        "credits": [
            3,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Software Development For Mobile Computers",
        "subjectCode": "CNIT",
        "courseCode": "35500",
        "instructor": [
            "Byung-Cheol Min"
        ],
        "description": "<a href=\"javascript:history.go(-1)\" onmouseover=\"window.status='Return to Previous';  return true\" onfocus=\"window.status='Return to Previous';  return true\" onmouseout=\"window.status='';  return true\" onblur=\"window.status='';  return true\">Return to Previous</a>",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Cryptography",
        "subjectCode": "CNIT",
        "courseCode": "37000",
        "instructor": [
            "Joseph D Kintzel",
            "Wenhai Sun"
        ],
        "description": "Cryptography is an essential component to protect information in cyber systems. This course introduces the inner workings of cryptographic primitives and how to correctly use them. Specifically, the course covers cryptographic algorithms, protocols and techniques. The algorithms illustrate the art of encryption and secure hashing. The cryptographic protocols will expose the students to the world of building trust in an untrusted environment. Cryptographic techniques used in key management and algorithm choice will be explored.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Database Programming",
        "subjectCode": "CNIT",
        "courseCode": "37200",
        "instructor": [
            "Tianyi Li"
        ],
        "description": "This course explores advanced database programming techniques for enterprise-wide databases and their implementation. It uses programmatic extensions to Structured Query Language (SQL) supported by today's enterprise-class Relational Database Management Systems (RDBMS). Topics include advanced data manipulation, storage considerations, data transformation techniques to enhance interoperability of data, stored procedure and trigger design and implementation, and query optimization.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Advanced Analysis And Design",
        "subjectCode": "CNIT",
        "courseCode": "38000",
        "instructor": [
            "Victor M Barlow"
        ],
        "description": "This course is an advanced study of system analysis and design methods and techniques used by systems analysts to develop information systems. Object-oriented tools and the Unified Modeling Language (UML) will be used for describing object structure and behavior, and use cases will be used for modeling functional processes. Topics include rapid development concepts, application architecture and system design, transition from object-oriented analysis and models to components and services, graphical user interface design, web interface design, prototyping, and commercial software package integration. Emphasis is also placed on the use of an object-oriented CASE tool. This course surveys other important skills for the systems analyst, such as fact-finding (requirements discovery), communications, project management, and cost-benefit analysis.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Enterprise Info Governance",
        "subjectCode": "CNIT",
        "courseCode": "38101",
        "instructor": [
            "Dawn D Laux"
        ],
        "description": "This variable title course is used to pilot new course offerings.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Software Development Methodologies",
        "subjectCode": "CNIT",
        "courseCode": "40500",
        "instructor": [
            "Dmitri A Gusev"
        ],
        "description": "This course explores methodologies and practices commonly used in contemporary software development projects. Topics include programming standards, code ownership and accountability, source code management and version control, productivity and quality metrics, software testing, and software process maturity models.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Advanced Coding Security",
        "subjectCode": "CNIT",
        "courseCode": "41500",
        "instructor": [
            "John A Springer"
        ],
        "description": "This course allows students to gain proficiency in secure coding principles. Security risks from common coding errors are examined. Techniques for integrating secure coding practices into the development process is detailed with an emphasis on ensuring that applications are designed and implemented with proper security requirements.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Basic Cyber Forensics",
        "subjectCode": "CNIT",
        "courseCode": "42000",
        "instructor": [
            "Tahir Mehmood Khan"
        ],
        "description": "This course introduces students to the fundamentals of cyber forensics and cyber-crime scene analysis. The various laws and regulations dealing with computer forensic analysis are discussed. Students are introduced to the emerging international standards for cyber forensic analysis, as well as a formal methodology for conducting computer forensic investigations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Mobile Forensics",
        "subjectCode": "CNIT",
        "courseCode": "42100",
        "instructor": [
            "Umit Karabiyik"
        ],
        "description": "This course will help students understand the issues, techniques, and vulnerabilities of small scale digital device forensics. Emphasis will be placed on the forensically sound acquisition, preservation, analysis and presentation of small scale digital devices as evidence. Specific investigations will cover devices such as Personal Digital Assistants (PDA's), Cell Phones, and Smart Phones.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Cyber Criminology",
        "subjectCode": "CNIT",
        "courseCode": "42200",
        "instructor": [
            "Marcus K Rogers"
        ],
        "description": "This course examines both the traditional and contemporary forms of cybercrime, including hacking, insider threat, Internet child pornography, cyberbullying, hacktivism, and cyberterrorism. Students will learn how computers can be either the target (e.g., hacking) or the tool (e.g., child pornography) for committing cybercrimes. In addition, this course will apply a variety of sociological, psychological, and criminological theories to help explain, \"Why do some people engage in cybercrimes when others do not?\" Theories discussed include: social learning theory, space transition theory, routine activity theory, social cognitive theory, techniques of neutralization, and personality characteristics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Network Security",
        "subjectCode": "CNIT",
        "courseCode": "45500",
        "instructor": [
            "Phillip Troy Rawles"
        ],
        "description": "This course explores business, conceptual, and technological aspects of network security for voice and data networks. The course deals with the analysis, design, implementation, and management issues surrounding effective network security. Key concepts and technology include virus protection, firewalls, authentication, encryption, wireless security, security protocols, physical security, and network security architecture and policy development.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Biomedical Informatics",
        "subjectCode": "CNIT",
        "courseCode": "45800",
        "instructor": [
            "Michael D Kane"
        ],
        "description": "This course explores the tools and objectives of research in the medical and life sciences industry relevant to the skills of information technology. The driving outcome of this course is for students to understand the domain demands inherent to information systems in healthcare, bioinformatics and computational life sciences, with respect to their role in commercialism, therapeutic decision support and discovery support systems. Topics include information technology application in support of health care delivery, a brief overview of healthcare delivery, the history of healthcare informatics, an overview of the state of current systems and the professional opportunities in Health Informatics. In bioinformatics, introduce the concepts of genomics and proteomics, biotechnology, biological databases and file structures, common computational methods for exploiting biological databases, integrating computational methods within the life sciences industry, and a survey of successful computational life science applications.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Incident Response Management",
        "subjectCode": "CNIT",
        "courseCode": "47000",
        "instructor": [
            "Nicole M Hands"
        ],
        "description": "This course will bridge business operations to IT support of the critical systems that support day-to-day operations. Techniques to detect anomalous behaviors through the configuration and monitoring of modern Intrusion Detection systems, analyzing and decoding network flows, system logs, and reports is covered along with appropriate remediation actions. Multiple approaches, theories, standards, and suggestions for incident response handling will be examined.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Vulnerability Analysis And Testing",
        "subjectCode": "CNIT",
        "courseCode": "47100",
        "instructor": [
            "Tahir Mehmood Khan"
        ],
        "description": "This course will focus on advanced security techniques often referred to as vulnerability analysis or network penetration testing (pen testing). Students will learn the methods, techniques, and tools to test the security of computer networks, infrastructure and applications. The activities will be based in an environment that allows testing and \"hacking\" that does not risk possible legal, ethical, and network availability issues.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Managing Information Technology Projects",
        "subjectCode": "CNIT",
        "courseCode": "48000",
        "instructor": [
            "Kevin C Dittman"
        ],
        "description": "This course introduces the application of knowledge, skills, tools, and techniques that project managers use to plan, staff, estimate, and manage information technology projects. Special emphasis is placed on learning and applying the concepts of managing scope, risk, budget, time, expectations, quality, people, communications, procurement, and externally provided services. Students will apply project management technology and techniques to business problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Cloud Computing Infrastructure",
        "subjectCode": "CNIT",
        "courseCode": "48101",
        "instructor": [
            "Deepak Nadig Anantha"
        ],
        "description": "This variable title course is used to pilot new course offerings.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Six Sigma Data Quality For Continuous Improvement",
        "subjectCode": "CNIT",
        "courseCode": "48200",
        "instructor": [
            "Chad Matthew Laux"
        ],
        "description": "A study of data quality for Six Sigma level of improvement, applying a Six Sigma DMAIC (Define, Measure, Analyze, Improve and Control) improvement methodology, utilizing information tools and techniques. The course addresses advanced topics in statistical based continuous improvement, data quality; and Big Data Analytics concepts, as pertains to systematic problems. An embedded certificate in SS is included in the body of knowledge.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Applied Machine Learning",
        "subjectCode": "CNIT",
        "courseCode": "48300",
        "instructor": [
            "Jin Kocsis"
        ],
        "description": "In the past decade, we have observed the expeditious evolution and tremendous applications of machine learning, such as unmanned vehicle, autonomous language translation, and smart healthcare. This course will introduce both the fundamental knowledge and design/application insights of machine learning techniques via a series of hands-on real-world examples. The overall aim is to provide the students with a good understanding of machine learning technologies, building machine learning models, and applying machine-learning technologies to address real-world problems. In this course, students will also have an opportunity to explore the cutting-edge machine learning technologies, such as deep learning, adversarial attacks, and meta learning, and develop their own machine learning-based solutions.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Database Administration",
        "subjectCode": "CNIT",
        "courseCode": "48700",
        "instructor": [
            "Romila Pradhan"
        ],
        "description": "This course explores tools and techniques for managing an organization's database technology. Topics include database architecture, database technology installation, database creation and maintenance, Database Management System (DBMS) operation and troubleshooting, and database performance tuning. In the laboratory, students engage in activities performed by a typical database administrator.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Foundations In Homeland Security Studies",
        "subjectCode": "CNIT",
        "courseCode": "51100",
        "instructor": [
            "James Eric Dietz"
        ],
        "description": "An interdisciplinary course addressing prevention, mitigation, preparation, response, and recovery from catastrophic events that threaten private and public sector resources and infrastructures. Course contents will include: characteristics of security; personal/corporate perspectives; identification of assets; assessing cost/benefits of protecting assets; risk assessment and risk management; crisis decision making; emergency management resources and response infrastructures; best practices in emergency management and risk and crisis communication; business continuity; and the importance of a collaborative response. Case studies include the 9-11 attacks and Hurricane Katrina. External experts will present and career opportunities will be discussed. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Natural Language Technologies",
        "subjectCode": "CNIT",
        "courseCode": "51900",
        "instructor": [
            "Julia M Rayz"
        ],
        "description": "This course serves as an introduction to natural language processing with the focus on current and emerging technologies and applications. The topics will review the state of the art of natural language processing, discuss their advantages and disadvantages for computational language processing, and look at some case studies. The assignments will range from pen and paper analysis to actual computational implementation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "File System Forensics",
        "subjectCode": "CNIT",
        "courseCode": "52300",
        "instructor": [
            "Tahir Mehmood Khan"
        ],
        "description": "The plethora of strategies to store information in different formats continues to expand. This course examines the various media and strategies of storing information and the processes of documenting the collection, imaging, and processing of forensic evidence. Topics include file formats, file systems, hardware, and software involved in forensic investigation. The overall pattern of forensic evidence in file systems will be examine along with the acquisition, analysis, and reporting of evidence artifacts found in file systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Cyberlearning Research And Development",
        "subjectCode": "CNIT",
        "courseCode": "54100",
        "instructor": [
            "Alejandra J Magana Deleon"
        ],
        "description": "This design-based research course explores and applies methodological and theoretical perspectives to the research, design, and evaluation of learning experiences and environments that integrate computational thinking or cyberlearning within a certain STEM discipline. Design-based research seeks to shape and even engineer learning environments and experiences \"in the wild.\" Is a series of approaches with the intent of producing new theories, artifacts, and practices that account for and potentially impact learning and teaching in naturalistic settings.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Information Technology Project Management",
        "subjectCode": "CNIT",
        "courseCode": "55200",
        "instructor": [
            "Jeffrey L Brewer"
        ],
        "description": "Explores the necessary skills and knowledge to successfully initiate, plan, manage, control, and report on information technology projects. Special emphasis is placed on learning the PMBOK and its practices concerning integration management, scope management, time management, cost management, quality management, human resource management, communications management, risk management, and procurement management. Practical examples are used to demonstrate the concepts and techniques, plus hands-on experience is received by working on a case study. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Quality Management In Information Technology",
        "subjectCode": "CNIT",
        "courseCode": "55300",
        "instructor": [
            "Kevin C Dittman"
        ],
        "description": "This course explores quality and productivity models used to ensure quality in information technology systems development processes. Special emphasis is on learning and understanding process metrics and measurement, as well as initiatives such as Total Quality Management, Continuous Process Improvement, Six Sigma, and the Software Engineering Institute Capability Maturity Model. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Advanced Research Topics In Cyber Forensics",
        "subjectCode": "CNIT",
        "courseCode": "55700",
        "instructor": [
            "Umit Karabiyik"
        ],
        "description": "Provides students at the advanced degree level the opportunity to expand their knowledge of cyber forensics. Students are expected to have fundamental understanding of cyber forensics and digital forensic science. The emphasis is on directed learning and scholarly inquiry. Possible research topics range from law and public policy to software and/or hardware development. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Bioinformatics Computing And Systems Integration",
        "subjectCode": "CNIT",
        "courseCode": "55800",
        "instructor": [
            "Michael D Kane"
        ],
        "description": "This is a graduate-level course for students interested in the application of computational methods and information technology in the pharmaceutical, biotechnology, and life sciences arena. An overall understanding of information technology and systems is assumed, as well as an in-depth knowledge of one or more areas of information technology. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Adv Res Tpc In Blockchain Tech",
        "subjectCode": "CNIT",
        "courseCode": "58100",
        "instructor": [
            "Romila Pradhan",
            "Sudip Vhaduri",
            "Dominic Kao",
            "Abdul Salam",
            "Byung-Cheol Min",
            "Tianyi Li",
            "Wenhai Sun",
            "Anthony H Smith"
        ],
        "description": "Advanced study of technical and professional topics. Emphasis is on new developments relating to technical, operational, and training aspects of industry and technology education.",
        "capacity": 0,
        "credits": [
            0,
            8
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Cyberphysical Security Seminar: Research Topics In Cyberphysical Security",
        "subjectCode": "CNIT",
        "courseCode": "61700",
        "instructor": [
            "James Eric Dietz"
        ],
        "description": "This course meets the requirements of a research seminar for the CIT graduate program. Students focusing on homeland security and related research areas are encouraged to take this course to expand their knowledge of the field in general and in their specific research areas. The students will present their research to one another to gain knowledge of topics in the subject area. The student numbers will include PHSI student research assistants, interns, and students focused on homeland security research topics. The creation of this course will provide these students more structure for engagement, learning and research. Students taking the course will construct a research paper formatted for publication in a homeland security research journal. This course will also promote the interdisciplinary nature of homeland security from information technology to public policy generation and agent-based computer modeling. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Deep Learn Sec & Priv",
        "subjectCode": "CNIT",
        "courseCode": "62300",
        "instructor": [
            "Jin Kocsis",
            "Baijian Yang",
            "Chad Matthew Laux",
            "Marcus K Rogers"
        ],
        "description": "Theory and practice in the development of comprehensive solutions to problems in industrial, technical, and human resource development environments. Solutions based on emerging procedures will be emphasized. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    }
]