[
    {
        "title": "Clinical Toxicology For Veterinary Technology",
        "subjectCode": "CPB",
        "courseCode": "46400",
        "instructor": [
            "Christina R Wilson-Frank"
        ],
        "description": "The common toxicants and advanced topics on the drugs most commonly encountered in veterinary medicine. Emphasis is on mechanisms, indications, contraindications, and proper applications and handling of these drugs. Permission of department required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Seminar In Animal Welfare And Human-Animal Interaction",
        "subjectCode": "CPB",
        "courseCode": "48000",
        "instructor": [
            "Alan M Beck"
        ],
        "description": "This course will be required for students involved in the interdisciplinary Animal Welfare and Societal Concerns program of study. Seminar in Animal Welfare and Human-Animal Interaction is for discussion of current topics in animal welfare and other areas involving the interaction of humans and animals. Outside speakers will present their perspectives in various areas. Journal articles will also be presented and discussed.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Seminar In Comparative Medicine",
        "subjectCode": "CPB",
        "courseCode": "57900",
        "instructor": [
            "Debra Lynn Hickman-Miller"
        ],
        "description": "A discussion course focusing on current issues of laboratory animal medicine. Review of current activities, health surveillance reports, etc. Selected cases are presented in detail, including clinical presentation, interpretation of diagnostic tests, and gross and microscopic pathology. In addition, this seminar includes discussions on animal resource management; surgery; animal experimentation; current journal reports; zoonoses; and clinical animal disease diagnosis, prevention, treatment, and control, and other species and topics not formally covered in other core courses.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Cancer Genetics/Gnomics",
        "subjectCode": "CPB",
        "courseCode": "58000",
        "instructor": [
            "Guangjun Zhang"
        ],
        "description": "Directed readings, discussions, and other intensive studies in specialized topics of the disciplines of the department. The topic of study will be selected and announced prior to the semester offered and will be indicated in the student's record. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Design And Analysis Of Epidemiologic Studies",
        "subjectCode": "CPB",
        "courseCode": "62600",
        "instructor": [
            "Hsin-Yi Weng"
        ],
        "description": "Focuses on epidemiologic study design and applications of statistical software to the analysis of data derived from health research. Includes an overview of epidemiologic study designs, frequency and association measures, generalized linear models and survival analysis. Hands-on computer laboratories are provided using data derived from field studies. Prerequisites: One graduate level course in biostatistics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Avian Immunology",
        "subjectCode": "CPB",
        "courseCode": "63100",
        "instructor": [
            "Geoffrey Alan Lossie"
        ],
        "description": "The avian immune system is significantly different than the mammalian immune system. This course compares and contrasts mammalian and avian immune systems. Prerequisites: At least one graduate or undergraduate course in biology or poultry science. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Avian Medicine",
        "subjectCode": "CPB",
        "courseCode": "63200",
        "instructor": [
            "Geoffrey Alan Lossie"
        ],
        "description": "This disease-based course is designed to introduce students to poultry medicine. It covers all the major diseases and conditions that affect poultry. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Int Animal Experiment",
        "subjectCode": "CPB",
        "courseCode": "68000",
        "instructor": [
            "Amanda K Darbyshire"
        ],
        "description": "Directed readings, discussions, and other intensive studies in specialized topics of the disciplines of the department. The topic of study will be selected and announced prior to the semester offered and will be indicated in the student's record. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Seminar In Veterinary Pathology",
        "subjectCode": "CPB",
        "courseCode": "69100",
        "instructor": [
            "Nobuko Wakamatsu Utsuki"
        ],
        "description": "Discussions of selected current disease problems with emphasis on gross and microscopic tissue changes and pathogenesis. Required of all graduate students in veterinary pathology each semester in residence.",
        "capacity": 0,
        "credits": [
            0,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Research Seminar",
        "subjectCode": "CPB",
        "courseCode": "69700",
        "instructor": [
            "Susan M Mendrysa"
        ],
        "description": "Discussion of current concepts and research results in epidemiology, immunology, microbiology, parasitology, pathology, virology, host-parasite relationships, and other aspects of veterinary pathobiology. Each graduate student is expected to register each semester and to make one oral presentation per year. A grade of pass/not-pass and one credit will be awarded for the semester the presentation is given. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "General Pathology",
        "subjectCode": "CPB",
        "courseCode": "85100",
        "instructor": [
            "Abigail D Cox"
        ],
        "description": "An overview of the basic cellular reactions that develop in response to injurious agents. Focuses on the gross and microscopic alterations in tissues, events leading to the development of those alterations, and the consequences of those changes on the health of animals. Includes degenerative, necrotic, inflammatory, and neoplastic changes in various animal species.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Veterinary Parasitology",
        "subjectCode": "CPB",
        "courseCode": "85204",
        "instructor": [
            "Sriveny Dangoudoubiyam"
        ],
        "description": "Covers the important helminth, protozoal and arthropod diseases of animals. Emphasis is placed on the pathogenesis, epidemiology, clinical features, diagnosis, control, and zoonotic implications of protozoal and arthropod infections in this semester of the course.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Veterinary Hematology And Cytology",
        "subjectCode": "CPB",
        "courseCode": "85500",
        "instructor": [
            "Joanne B Messick"
        ],
        "description": "Provides an overview of veterinary hematology and cytology. Normal morphology and function of the cells of the hematopoietic system are reviewed. Laboratory analyses of the different cell types are discussed. The responses of the hematopoietic cells that can be seen during different disease processes are presented. Fundamentals of veterinary diagnostic cytology are introduced.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Veterinary Bacteriology And Mycology",
        "subjectCode": "CPB",
        "courseCode": "85603",
        "instructor": [
            "Gena K Hammac"
        ],
        "description": "  An overview of bacterial and fungal pathogens of veterinary species.  Topics will include discriminating features of the organisms, the pathogenesis of diseases caused by these agents, diagnostics, management and therapeutics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    }
]