[
    {
        "title": "Planet Earth",
        "subjectCode": "EAPS",
        "courseCode": "10000",
        "instructor": [
            "Michael Patterson Eddy"
        ],
        "description": "An introduction to the Geosciences-Earth science, oceanography, atmospheric science and astronomy. The course emphasizes topics (earthquakes, volcanoes, ocean pollution, climate change, severe weather, etc.) that are of general interest and relevance, and the interconnections between various Earth processes. CTL:IPS 1730 Earth Science",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "The Planets",
        "subjectCode": "EAPS",
        "courseCode": "10500",
        "instructor": [
            "Andrew M Freed"
        ],
        "description": "  This course is designed for science and non-science majors alike to learn about the origin and characteristics of the bodies in our Solar System, including planets, moons, asteroids, comets, exoplanets beyond, and the search for extraterrestrial life. We'll discuss how solar systems form and die, the origin of the terrestrial versus giant planets and their orbits, the evolution of planetary surfaces due to asteroid impacts and volcanism, the development of atmospheres, the formation of planetary rings, the origin of moons, the hazards of space travel, and why Pluto IS a planet.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Geosciences In The Cinema",
        "subjectCode": "EAPS",
        "courseCode": "10600",
        "instructor": [
            "Andrew M Freed"
        ],
        "description": "  This course is designed for science and non-science majors alike to learn about natural hazards based on the depictions of such hazards in movies. Topics include earthquakes, tsunamis, volcanoes, tornadoes, hurricanes, climate change, asteroid impacts, space exploration, and wildfires. The course focuses on the accuracy of the depiction of natural hazards in the movies, the underlying processes that control their formation and the dangers they represent, how they influence society, and how students can prepare for them and keep themselves safe.   ",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Physical Geology",
        "subjectCode": "EAPS",
        "courseCode": "11100",
        "instructor": [
            "Saad S B Haq"
        ],
        "description": "Geologic processes and the development of land forms. Laboratory covers the study of minerals and rocks, the interpretations of topographic and geologic maps, and field investigations. CTL: Physical Geology.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Earth Through Time",
        "subjectCode": "EAPS",
        "courseCode": "11200",
        "instructor": [
            "Jennifer Ann Nelson"
        ],
        "description": "The history of the planet Earth from its beginnings to the present. This course will explore the causes and effects of processes that have changed the Earth's surface and subsurface through time, the impacts of these changes on the evolution of life, and how scientist interpret Earth history from the geologic record. The laboratory will provide hands-on experience in interpreting various geologic and fossil records. This course may be taken on its own, or as a year-long lab series with EAPS 11100.  EAPS 11100 and EAPS 11200 will fulfill the two course sequence laboratory experience outside the major department.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Earthquakes And Volcanoes",
        "subjectCode": "EAPS",
        "courseCode": "11600",
        "instructor": [
            "Jonathan Robert Delph"
        ],
        "description": "A survey class on earthquakes and volcanoes. Topics include earthquake hazards and forecasting, the use of seismic waves to investigate the earth's interior, volcanoes and tectonics, volcanic hazards, and the influence of volcanoes on climate. Examples of recent and historic earthquakes and volcanic eruptions are presented.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Atmospheric Science",
        "subjectCode": "EAPS",
        "courseCode": "11700",
        "instructor": [
            "Matthew Huber"
        ],
        "description": "The weather/climate system. Solar variability and Milankovitch Theory. Atmospheric scales of motion. Chemistry of greenhouse gases and aerosols. Fundamental laws of meteorological dynamics and radiation. Weather systems, air masses and fronts. Severe storms, hurricanes and tornadoes. (Required for atmospheric sciences majors.)",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Earth Sciences",
        "subjectCode": "EAPS",
        "courseCode": "11800",
        "instructor": [
            "Douglas R Schmitt"
        ],
        "description": "<a href=\"javascript:history.go(-1)\" onmouseover=\"window.status='Return to Previous';  return true\" onfocus=\"window.status='Return to Previous';  return true\" onmouseout=\"window.status='';  return true\" onblur=\"window.status='';  return true\">Return to Previous</a>",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Environmental Science And Conservation",
        "subjectCode": "EAPS",
        "courseCode": "12500",
        "instructor": [
            "John B Dunning"
        ],
        "description": "(AGRY 12500, FNR 12500, NRES 12500) Introduction to environmental science and conservation includes topics in ecological principles, conservation and natural resource management, human impacts on the environment, toxic waste disposal, climate change, energy, air and water pollution, environmental geology and geologic hazards.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Freshman Seminar In Earth, Atmospheric, And Planetary Sciences",
        "subjectCode": "EAPS",
        "courseCode": "13700",
        "instructor": [
            "Jennifer L Montes"
        ],
        "description": "Seminar presented by guests in different fields of the Earth and Atmospheric Sciences to expose students to the range of topics included in the department and in possible career paths.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Science Of The Atmosphere",
        "subjectCode": "EAPS",
        "courseCode": "22500",
        "instructor": [
            "Daniel R Chavas"
        ],
        "description": "An overview of the physics and dynamics of the atmosphere. Quantitative study of the energy balance of the atmosphere, condensation and precipitation processes, atmospheric motion and global circulation, severe storms, atmospheric chemistry. Contemporary issues such as human impact on climate, ozone depletion, numerical weather prediction and climate simulation, and modern measurement systems. Not available to students with credit in EAPS 22100. Intended for Science and Engineering majors only.  Prior course work in calculus is required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Atmospheric Observation And Measurements",
        "subjectCode": "EAPS",
        "courseCode": "22700",
        "instructor": [
            "Robin L Tanamachi"
        ],
        "description": "Survey of principal techniques, tool, and instruments used in atmospheric science research. Students work on research projects designed in coordination with EAPS faculty. Topics are complimentary to those covered in EAPS 22500 and may include either observational analysis, numerical modeling, or both. Topics to be covered include hypothesis formulation, literature search, training on the necessary instruments and numerical modeling tools, experiment design and execution, statistical analysis, student-designed experiment revision, scientific writing, and presentation of findings to the class and interested EAPS faculty.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Mineralogy",
        "subjectCode": "EAPS",
        "courseCode": "24300",
        "instructor": [
            "Michelle S Thompson"
        ],
        "description": "Elements of crystallography, physical and chemical properties of rock-forming minerals, and minerals of economic importance. Origin and occurrence of minerals. Prior course work in dynamic earth or physical geology is required.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Earth Systems Science For Elementary Teachers",
        "subjectCode": "EAPS",
        "courseCode": "31201",
        "instructor": [
            "Dean M Ballotti"
        ],
        "description": "An Earth Systems Science perspective draws upon the wealth of Earth systems science research in both content and pedagogy. This approach ahs served as a guiding framework for how students learn, engage in, and develop deep understandings of the interconnections among Earth's many different systems of geosphere, hydrosphere, atmosphere, and biosphere and the important role that human civilization plays in affecting Earth's other systems. This course takes an Earth Systems Science approach - an emerging transdisciplinary endeavor - to build students' understanding of the structure and functioning of the Earth as a complex, adaptive system.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Biogeochemistry",
        "subjectCode": "EAPS",
        "courseCode": "31500",
        "instructor": [
            "Cliff T Johnston"
        ],
        "description": "The course examines the main element cycles of Earth: carbon, oxygen/hydrogen, nitrogen, sulfur, phosphorous, and trace metals, and how they are interconnected from terrestrial, aquatic/ocean, and atmospheric perspectives. General chemistry concepts such as equilibrium, free energy, electrochemistry are used to understand the energetics of the cycles. Connection between the cycles and environmental problems, such as climate change and air pollution will be emphasized.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Earth And Planetary Surface Processes",
        "subjectCode": "EAPS",
        "courseCode": "35300",
        "instructor": [
            "Ali Bramson"
        ],
        "description": "  Introduction to a variety of topics in sediment transport and deposition, emphasizing linkages between active processes, landscape evolution, and the rock record. Comparisons will be made between surface processes occurring on Earth and other planetary bodies in the Solar System. Topics include: introductory fluid mechanics; sediment transport by water, ice, and wind, and the development of fluvial bed forms, glacial landscapes, and sand dunes; groundwater geochemistry and the development of karst and caves; impact cratering; comparative planetology. Each major topic is accompanied by field projects that emphasize local geologic history.  ",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Great Issues In Science And Society",
        "subjectCode": "EAPS",
        "courseCode": "36000",
        "instructor": [
            "Daniel P Shepardson",
            "Gouri Prabhakar"
        ],
        "description": "This course develops basic skills and knowledge critical to analyze issues of energy use, climate change, and sustainability that incorporate both societal and scientific perspectives. The goal of this course is not to arrive at particular consensus solutions to the problems associated with these issues but instead to foster an informed (through information literacy) debate that will ultimately be waged as solutions are sought. Working in teams the students work throughout the semester to complete a capstone teamwork project and a group presentation. Counts for Great Issues course in College of Science.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Great Issues",
        "subjectCode": "EAPS",
        "courseCode": "37500",
        "instructor": [
            "Dean M Ballotti"
        ],
        "description": "Prosperity of the 20th century was based on abundant and cheap energy; during the 21st century we will be faced with difficult challenges. Our society will face higher energy prices, decline of petroleum based fuels supplies, increased environmental effects of fossil fuels usage, and the challenge of solving the technological problems of developing alternative fuels. This course will review the structure, economics, and geopolitical issues faced by fossil fuel industries and the mitigation strategies that will be needed to change to low fossil fuel use society based on low polluting renewable energy sources. Counts for Great Issues course in College of Science for Juniors and Seniors.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": " Environmental Chem",
        "subjectCode": "EAPS",
        "courseCode": "39100",
        "instructor": [
            "Alexander Laskin"
        ],
        "description": "Intermediate special topics in the earth and atmospheric sciences. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Atmospheric Thermodynamics",
        "subjectCode": "EAPS",
        "courseCode": "42100",
        "instructor": [
            "Alexandria Vincenza Johnson"
        ],
        "description": "(AGRY 43100) Structure and composition of the atmosphere. Thermodynamics of dry and moist air, including adiabatic and pseudo-adiabatic processes, hydrostatic stability, and air mass determination. Prior course work in introductory atmospheric science, second semester physics or thermodynamics is required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Atmospheric Dynamics II",
        "subjectCode": "EAPS",
        "courseCode": "42300",
        "instructor": [
            "Andrea Elise Orton"
        ],
        "description": "(AGRY 43300) An extension of EAPS 42200, with emphasis on perturbation theory and hydrodynamics stability, air mass and frontal theory, barotropic and baroclinic models, wave cyclone theory, and numerical weather prediction.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Sedimentary Geology",
        "subjectCode": "EAPS",
        "courseCode": "47400",
        "instructor": [
            "Kenneth D Ridgway"
        ],
        "description": "Systematic study of continental and marine depositional environments. Interpretation of sedimentary facies, structures, and microfacies. Principles and applications of stratigraphy, including applications of paleontology, field relations, paleomagnetism, well logs, seismic reflections, and chemistry. Field investigations may be required.  Prior course work in earth materials, mineralogy and petrology is required.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Theory Of Climate",
        "subjectCode": "EAPS",
        "courseCode": "52000",
        "instructor": [
            "Lei Wang"
        ],
        "description": "A general introduction to the theory of climate at an intermediate level. A brief survey of physical climatology and paleoclimates. Theoretical development of climate models. Theories of climatic stability and climatic change.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Atmospheric Chemistry",
        "subjectCode": "EAPS",
        "courseCode": "52100",
        "instructor": [
            "Greg M Michalski"
        ],
        "description": "An introduction to the chemistry of the earth's atmosphere. Covers evolution of the earth's atmosphere, its physical and chemical structure, its natural chemical composition and oxidative properties, and human impacts, including increasing tropospheric ozone, decreasing stratospheric ozone, climate change, and acidic deposition.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introductory Geofluid Dynamics",
        "subjectCode": "EAPS",
        "courseCode": "52600",
        "instructor": [
            "Andrea Elise Orton"
        ],
        "description": "Provides a fluid dynamics background for graduate students interested in atmospheric sciences, oceanography, mantle convection, hydrology, turbulence, or pollution. Topics covered include: basic assumptions and deviations of Navier Stokes equations, conservation laws, vorticity, divergence, waves, and applications in atmosphere, ocean, and geophysics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Modeling Ecosystems And Biogeochemical Cycles",
        "subjectCode": "EAPS",
        "courseCode": "52900",
        "instructor": [
            "Qianlai Zhuang"
        ],
        "description": "Process-based models are powerful tools for studying ecosystem dynamics and geochemical cycles in Earth System Sciences. In this course, we will explore how various components of ecosystems can be modeled following principles of biology, physics, and chemistry. We will also examine techniques for using modeling to study: 1) responses of the structure and functioning of ecosystems to changing climate, atmospheric composition, environmental conditions, and human activities; and 2) exchanges of major greenhouse gases (e.g., CO2, CH4, and N2O) between the atmosphere and the biosphere. During the course, we will go through the whole cycle of system modeling approach including model conceptualization, formulation, parameterization, sensitivity and uncertainty analysis, verification, and application.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Mesoscale Meteorology",
        "subjectCode": "EAPS",
        "courseCode": "53900",
        "instructor": [
            "Daniel T Dawson"
        ],
        "description": "Review of the theories applied in mesoscale meteorology, including semi-geostrophic systems and frontogenesis, symmetric instability, rainbands and inertia-gravity waves, sea-breeze, terrain effects, mountain waves, lee-vortices and cyclogenesis, convection, convective instability, low-level jets, drylines, and squall lines.  Prior course work in synoptic labs and vector calculus is required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Planetary Surface Processes",
        "subjectCode": "EAPS",
        "courseCode": "55600",
        "instructor": [
            "Briony H Horgan"
        ],
        "description": "The application of petrology and structural geology to other planets. Topics include: theories of star and solar system formation, orbital dynamics and Kepler's laws, petrology and geochemistry of meteorites, age dating techniques, structure and composition of the terrestrial, giant, and icy planets, planetary surfaces, planetary atmospheres, and theories of the formation of the moon. Offered in alternate years. Prior course work in earth materials is required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Seismology",
        "subjectCode": "EAPS",
        "courseCode": "55700",
        "instructor": [
            "Robert L Nowack"
        ],
        "description": "Theory of propagation to seismic waves in elastic media. Solution of wave equations for compressional, shear, and surface waves. Analysis of travel-times, amplitudes, and attenuation of seismic waves in terms of ray and wave theory. Principles of the seismograph. Structure of the earth as determined by seismological studies. Investigation of the causes, effects, distribution, and characteristics of earthquakes. Earthquake prediction.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "GeoData Science Seminar",
        "subjectCode": "EAPS",
        "courseCode": "59100",
        "instructor": [
            "Xiaotao Yang",
            "David A Minton",
            "Michael Manuel Sori",
            "Yunyue Li",
            "Roger Craig Wiens",
            "Wen-Wen Tung"
        ],
        "description": "Specialized study offered on an individual basis or through specially arranged courses. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            18
        ],
        "term": "Fall 2022"
    },
    {
        "title": "New Graduate Student Seminar",
        "subjectCode": "EAPS",
        "courseCode": "60200",
        "instructor": [
            "Brandon Charles Johnson"
        ],
        "description": "This course will provide students with the tools to succeed as a graduate student in the Department of Earth, Atmospheric, and Planetary Sciences, which include good communication with their advisors, graduate fellowship proposal writing, giving good talks and posters, review of regulations and graduate timelines, formulating a plan of study, and resources available to help gradate students succeed. Permission of Instructor.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Contaminant Hydrogeology",
        "subjectCode": "EAPS",
        "courseCode": "68000",
        "instructor": [
            "Marty D Frisbee"
        ],
        "description": "Covers the basic theory and applications of problem-solving exercises in hydrogeology, fluid mechanics, and chemistry of contaminated sites; flow and transport equations and models; investigational methods; remediation methods; case studies; and pertinent environmental laws. Prior course work in chemistry, computer programming, differential equations, and hydrogeology is required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Colloquium In Earth, Atmospheric, And Planetary Sciences",
        "subjectCode": "EAPS",
        "courseCode": "69100",
        "instructor": [
            "Alexandria Vincenza Johnson"
        ],
        "description": "This course is intended to expose students to the wide range of topics studied throughout the Department of Earth, Atmospheric, and Planetary Sciences, allows for interactions with outside experts and networking, and provides the opportunity for students to synthesize high level topics that may not be directly related to their scientific endeavors.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    }
]