[
    {
        "title": "Principles Of Economics",
        "subjectCode": "ECON",
        "courseCode": "21000",
        "instructor": [
            "Benjamin J Van Kammen"
        ],
        "description": "This course presents the principles upon which the social science of economics is based. Specifically, it examines how individuals, firms, and the government interact through markets. It also examines several important macroeconomic issues including unemployment, inflation, international trade, and economic growth.  Students are expected to be able to apply these economic principles to analyze current events, work decisions, and personal choices. CTL: ISH 1040 Introduction To Economics",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Microeconomics",
        "subjectCode": "ECON",
        "courseCode": "25100",
        "instructor": [
            "Jacob Alan Brindley",
            "Melanie Elizabeth Fox"
        ],
        "description": "Microeconomics studies the choices individuals make and the incentives that influence those choices.  Emphasis is on the incentives that determine market prices and resource allocation. The role of public policy in influencing incentives and efficiency is also addressed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Macroeconomics",
        "subjectCode": "ECON",
        "courseCode": "25200",
        "instructor": [
            "Andres J Vargas"
        ],
        "description": "This course examines how the US economy functions and provides an overview of important macroeconomic issues including: unemployment, inflation, social security, national debt, international trade, the sub-prime crisis, and business cycles. Emphasis is placed upon the role and limits of government fiscal and monetary policy in promoting economic growth and stable prices. CTL: ISH 1041 Macroeconomics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Data Visualization And Inference",
        "subjectCode": "ECON",
        "courseCode": "26000",
        "instructor": [
            "Andres J Vargas"
        ],
        "description": "This is a self-contained introduction to statistics with economic applications. The goals of this course are to help students develop a working knowledge of data production and interpretation in an economics context, recognize the fundamental interconnectedness of economics and data, and introduce the basic concepts in statistics needed for further study of econometrics and provide basic preparation for ECON 36000. Topics include the organization, analysis, and interpretation of data; descriptive statistics; probability theory; sampling distributions; inference and hypothesis testing; and simple linear regression analysis. The approach of the class includes both learning the concepts behind basic statistics and also how to apply these concepts to make data-informed, real-world economic decisions. Students will become familiar with the common statistical techniques and databases for analyzing data by using both hand-calculations and STATA to analyze data.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Econ Sch Crime",
        "subjectCode": "ECON",
        "courseCode": "29000",
        "instructor": [
            "Jillian B Carr"
        ],
        "description": "Arrange with instructor before enrolling. Investigation in a specific economics field.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Managerial Economics",
        "subjectCode": "ECON",
        "courseCode": "30100",
        "instructor": [
            "Robert L Holland"
        ],
        "description": "This course provides a practical and business-focused approach to microeconomic theory. The course covers topics from consumer behavior and demand, decision under uncertainty, production and cost, factor demand, market structure, pricing strategies, and strategic behavior. Emphasis is placed on the tools used to analyze decisions made by managers at firms. This is a required course for several majors in the School of Management and for the business economics minor, but is not intended for economics majors.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Economics Of Public Policy",
        "subjectCode": "ECON",
        "courseCode": "32200",
        "instructor": [
            "Jillian B Carr"
        ],
        "description": "The examination and analysis of public finance practices and problems in the federal fiscal system. Government activities that involve spending and taxation are analyzed applying basic principles of economics. Topics include public education, social security, healthcare, environment and tax systems. State and local government issues are also addressed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Intermediate Microeconomic Theory",
        "subjectCode": "ECON",
        "courseCode": "34000",
        "instructor": [
            "Bettina S Klose",
            "Elchin Suleymanov"
        ],
        "description": "This course provides students with the techniques needed to model and analyze the behavior of individual economic agents. It introduces a variety of techniques that will allow students to solve business problems and make informed personal economic decisions. The course covers topics from consumer behavior and demand, decisions under uncertainty, production and cost, factor demand, market structure, pricing strategies, and strategic behavior. This is an upper-division economics course required for all economics majors and it serves as a foundation for higher level elective courses in economics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Intermediate Macroeconomics",
        "subjectCode": "ECON",
        "courseCode": "35200",
        "instructor": [
            "Cathy M Zhang",
            "Trevor S Gallen"
        ],
        "description": "This course offers a rigorous introduction to macroeconomic theory and empirics with real-world applications. We examine longstanding stylized facts about long-run economic growth, short-run economic fluctuations (booms and recessions), and the aggregate effects of government policy. We study determinants of equilibrium in labor, consumption, investment, and money markets as well as the role of fiscal and monetary policies in closed and open economies.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Econometrics",
        "subjectCode": "ECON",
        "courseCode": "36000",
        "instructor": [
            "Benjamin J Van Kammen"
        ],
        "description": "This course examines the statistical techniques economists use to analyze data, estimate causal effects, make predictions, and test economic theory. It emphasizes estimating multiple regression models including models of firm output, product prices, and wages. Students learn to make statistical and practical inferences about the true causal relationships. The course covers the data analysis skills required for careers as a consultant, financial analyst, researcher, or economist in the private and public sectors. The skills practiced in the course include using statistical software to analyze data.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Health Economics",
        "subjectCode": "ECON",
        "courseCode": "36200",
        "instructor": [
            "Timothy John Moore"
        ],
        "description": "This course is designed to introduce upper level undergraduate students in economics to the field of health economics. We will analyze health and health care theories, institutions, and key policy issues using tools from intermediate microeconomic theory. The course begins with an analysis of health care as a commodity and why health is different from other consumer goods. The course then examines the demand for and the production of health and health care, and the behavior and organization of health care providers. The discussion then switches to information asymmetries and the functioning of health insurance markets. Afterwards, the course turns to the analysis of government involvement in the health care system. The class concludes with an examination of medical care systems around the world, paying particular attention to the U.S. health care system.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "International Trade",
        "subjectCode": "ECON",
        "courseCode": "37000",
        "instructor": [
            "Anson Soderbery"
        ],
        "description": "Develops an understanding of the economics of globalization, including the movement of goods, people, capital, and ideas across countries. Using the tools of intermediate economic theory, we discuss the benefits and costs of globalization, the implications of globalization for wages, earnings, and national welfare, and their intersection with government policies.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Computational Economics",
        "subjectCode": "ECON",
        "courseCode": "37300",
        "instructor": [
            "Yaroslav Rosokha"
        ],
        "description": "The main goal of this course is to introduce economics students to the computation, programming, and data analysis in Python. In the first part of the course, we will cover basic programming techniques  and the use of popular Python packages for data analysis. In the second part of the course, we will consider more advanced programming techniques including numerical methods, dynamic programming, and simulation-based methods. Throughout the course we will consider a number applications related to microeconomics, macroeconomics, and econometrics covered in the Economics program curriculum.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Money And Banking",
        "subjectCode": "ECON",
        "courseCode": "38000",
        "instructor": [
            "Robert L Holland"
        ],
        "description": "The course analyzes the economics of money, monetary systems, investments, and financial intermediaries in modern industrial economies. Topics considered include the origin of money and the banking industry, financial asset markets, the role of central banks, and the effects of various monetary policies. The theory will be presented side by side with current economic and financial news, and the students will learn how to track financial and economic data via The Wall Street Journal.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Game Theory",
        "subjectCode": "ECON",
        "courseCode": "45100",
        "instructor": [
            "Brian A Roberson",
            "Yaroslav Rosokha"
        ],
        "description": "In the course, economic, political, and social interactions are represented as games, in which strategies and resulting outcomes can be analyzed. The analysis of these interactions is then used to demonstrate how one can make optimal decisions under uncertainty. This course uses Calculus.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Urban Economics",
        "subjectCode": "ECON",
        "courseCode": "45600",
        "instructor": [
            "Ben Zou"
        ],
        "description": "Examines the market forces that lead to the development, growth, and size of cities. In addition, this course covers the theory of location and land use, principles of local public finance, policy problems in the areas of urban housing, transportation, crime, and pollution.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Industrial Organization",
        "subjectCode": "ECON",
        "courseCode": "46100",
        "instructor": [
            "Lawrence Joseph Mazur"
        ],
        "description": "This course examines the determinants of firm and market structure and the resulting market performance in imperfectly-competitive markets. Advanced topics include advertising, research and development, imperfectly competitive international markets, and market integration. Emphasis is placed on using theoretical models of firm and industry behavior to explain and analyze real-world examples of firm behavior.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Behavioral Economics",
        "subjectCode": "ECON",
        "courseCode": "47100",
        "instructor": [
            "Jacob Alan Brindley"
        ],
        "description": "Students learn about human behavior in economic environments, with a strong emphasis on classroom laboratory exercises.  Topics considered include behavior in a variety of markets - for example, markets with price controls, markets for financial assets and auction markets -- and behavior in social dilemmas that arise when people try to provide public goods voluntarily or when sellers try to conspire to fix prices. Students will also learn how people bargain with, trust each other, and show social preferences towards others. Decision-making and anomalies for risky and uncertain choices will also be covered.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Experimental Economics",
        "subjectCode": "ECON",
        "courseCode": "49000",
        "instructor": [
            "Colin Douglas Sullivan"
        ],
        "description": "Arrange with instructor before enrolling. Supervised reading and reports in various subjects. Open only to a limited number of seniors with superior records in previous courses. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Intermediate Economics I",
        "subjectCode": "ECON",
        "courseCode": "51100",
        "instructor": [
            "Bettina S Klose"
        ],
        "description": "Consumer behavior and demand, production and cost, factor demand, market structure, general equilibrium and welfare. Emphasis on the tools used to analyze the behavior of individual economic units.  Not open to students with credit in ECON 34000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Statistical & Machine Learning",
        "subjectCode": "ECON",
        "courseCode": "57600",
        "instructor": [
            "Chi Chun Chan"
        ],
        "description": "This is an introductory course in statistical and machine learning. It will cover fundamental concepts and essential tools that are critical in understanding cutting-edge machine learning techniques. Students will develop skills in applying a wide variety of modeling and prediction methods. Topics include linear regression, classification, regularization and shrinkage methods, tree-based methods, and support vector machines. An integral part of this course is the extensive use of the open source statistical software R. Students will gain hands-on experience in analyzing datasets commonly used in business and economics.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Teaching Economics",
        "subjectCode": "ECON",
        "courseCode": "60000",
        "instructor": [
            "John R Umbeck"
        ],
        "description": "This course traces the development of economic theory from the Mercantilist writers through the contributions of J. S. Mill and Karl Marx. Topics covered include the development of value theory (especially labor theories of value), theories of economic growth and business cycles, the classical debate over the meaning and validity of Say's Law, and changing views regarding the appropriate role of government in the marketplace. In each case, the contributions of the authors considered are evaluated in light of our modern understanding of economic theory.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Microeconomics I",
        "subjectCode": "ECON",
        "courseCode": "60600",
        "instructor": [
            "Elchin Suleymanov"
        ],
        "description": "An introduction to basic consumer and producer theory, competitive markets (including using the continuum to model competition), basic general equilibrium theory, and basic risk/uncertainty. Co-requisite: ECON 61500.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Microeconomics II",
        "subjectCode": "ECON",
        "courseCode": "60700",
        "instructor": [
            "Brian A Roberson"
        ],
        "description": "Building on Microeconomics I, more advanced consumer and producer theory using support functions, risk/uncertainty and information, and basic game theory and oligopoly. Prerequisite: ECON 60600.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Macroeconomic Theory I",
        "subjectCode": "ECON",
        "courseCode": "60800",
        "instructor": [
            "Seunghoon Na"
        ],
        "description": "An introduction to general equilibrium macroeconomic models in both deterministic and stochastic settings. Topics studied include: static neoclassical models, social planner problems, dynamic programming, growth and capital accumulation, stochastic economies, asset pricing, and overlapping generations models.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Mathematical Analysis For Economists",
        "subjectCode": "ECON",
        "courseCode": "61500",
        "instructor": [
            "Elchin Suleymanov"
        ],
        "description": "Topics include constrained optimization, comparative statics, and elementary topics in mathematical analysis. Students should be familiar with calculus, linear algebra, basic probability, and have a grasp of microeconomic theory (such as the material covered in ECON 51100).",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Labor Economics",
        "subjectCode": "ECON",
        "courseCode": "63200",
        "instructor": [
            "Timothy N Bond"
        ],
        "description": "An area seminar. Theoretical and empirical research on the financial markets. Prerequisite:  ECON 63000.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "International Trade",
        "subjectCode": "ECON",
        "courseCode": "63400",
        "instructor": [
            "Chong Xiang"
        ],
        "description": "Application of microeconomic techniques to international trade. Topics include: classical, neoclassical, and modern theories of international trade; the theory of tariffs and commercial policy, (including aspects of political economy), welfare aspects of trade and tariff theory, and related topics. The material is selected from current journal articles. Prerequisite:  ECON 60700.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Topics And Research In International Trade",
        "subjectCode": "ECON",
        "courseCode": "63600",
        "instructor": [
            "Anson Soderbery"
        ],
        "description": "A course in international trade theory and empirics, with emphasis on surveying the recent developments in the field-including empirical applications of material covered in ECON 634. While specific subject matter may vary from year to year, likely topics include: theory and empirics on trade and wages, trade and the environment, trade in the presence of multinational firms and vertical specialization, empirical evaluation of the positive theories of trade (especially factor endowment and variety models), and the identification and measurement of trade barriers and their effects. Material is selected from current journal articles. Prerequisite:  ECON 60700.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Agent-Based Computational Economics",
        "subjectCode": "ECON",
        "courseCode": "64100",
        "instructor": [
            "Yaroslav Rosokha"
        ],
        "description": "  Computational study of economic systems involving interacting agents who do not necessarily possess perfect rationality and information. In addition to equilibrium analysis, agent-based models focus on out-of-equilibrium dynamics that may or may not lead to equilibrium in the long run. Pre-requisite: ECON 67000 or STAT 51200 or STAT 51600 or equivalent.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Computational Economics",
        "subjectCode": "ECON",
        "courseCode": "64200",
        "instructor": [
            "Trevor S Gallen"
        ],
        "description": "The purpose of this class is to give you a computational toolbox you can apply to economic questions. We will introduce and use numerical methods on computationally tractable problems. The goal of the course is to encourage Ph.D. students to apply these techniques to their own research. Our in-class applications will primarily be public policy and macro-oriented, by solving and simulating the problems of microeconomic agents and aggregating the results.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Applied Microeconometrics",
        "subjectCode": "ECON",
        "courseCode": "65000",
        "instructor": [
            "Kevin Mumford"
        ],
        "description": "Topics in labor economics. While the specific subject matter varies from year to year, recent seminars have examined such topics as dynamic labor demand and supply analysis, human capital theory, screening and signaling theories, contract theory, efficiency wages, job matching, search, unions, and internal labor markets. Material is selected from current journal articles.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Public Economics",
        "subjectCode": "ECON",
        "courseCode": "65500",
        "instructor": [
            "Timothy John Moore"
        ],
        "description": "Knowledge of various types of government programs, public policies and program administration. Prerequisite: ECON 65000.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Topics In Applied Economics",
        "subjectCode": "ECON",
        "courseCode": "66800",
        "instructor": [
            "Colin Douglas Sullivan"
        ],
        "description": "Applied micro workshop. Topics on applied macroeconomics are presented by departmental and external speakers.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Probability And Statistics",
        "subjectCode": "ECON",
        "courseCode": "67000",
        "instructor": [
            "Mohitosh Kejriwal"
        ],
        "description": "An introduction to probability theory and the basic statistical estimation methods. Topics include: axiomatic development of probability theory, counting methods, conditional probability and Bayes' theorem, random variables and distributions, expectation, variance, covariance and correlation, special distributions, statistical inference, maximum likelihood estimators, unbiased estimation, and testing hypotheses.   Prerequisite: ECON 61500.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Econometrics I",
        "subjectCode": "ECON",
        "courseCode": "67100",
        "instructor": [
            "Chi Chun Chan"
        ],
        "description": "An introduction to the modern techniques of econometrics and their applications. Topics include: the classical linear regression model (specification, estimation, inference, and prediction), specification analysis, functional form, heteroscedasticity, and autocorrelation.   Prerequisite: ECON 67000.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Experimental Economics I",
        "subjectCode": "ECON",
        "courseCode": "68500",
        "instructor": [
            "Colin Douglas Sullivan"
        ],
        "description": "An overview of seminal and recent developments in experimental economic research. Provides practical training in designing and conducting experiments and the analysis of experimental data. Content varies from year to year. Applications include: industrial organization, game theory, finance, international trade, information economics, and monetary economics. Course readings are primarily from journal articles.  Prerequisite: ECON 60700. 61000.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Bayesian Econometrics I",
        "subjectCode": "ECON",
        "courseCode": "69000",
        "instructor": [
            "Cathy M Zhang",
            "Chi Chun Chan"
        ],
        "description": "Advanced individual reading and investigation in a specific economic field at the graduate level. Open to individual students with superior records. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Fall 2022"
    }
]