[
    {
        "title": "Special Populations Seminar: English Language Learners And Students With Gifts And Talents",
        "subjectCode": "EDCI",
        "courseCode": "20002",
        "instructor": [
            "Virak Chan"
        ],
        "description": "(EDCI 20002) This seminar is focused on special populations of learners for teacher education majors with an emphasis on students who are English learners and students with gifts, talents and creativity. Students will engage in mentoring activities and ongoing support in their development as a professional. The goal of the seminar is to connect theory to practice by engaging in an immersive field experience that connects to content and courses taken concurrently. The seminar provides an environment conductive to fostering rich relationships with schools and communities, pursuing common inquiry, thinking critically about theory, content and practice and advocation for equitable schooling. This seminar is intended to be taken concurrently with EDPS 24000 & EDCI 37001.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Exploring Teaching As A Career",
        "subjectCode": "EDCI",
        "courseCode": "20500",
        "instructor": [
            "Wiktoria Kozlowska",
            "Muna Sapkota",
            "Margie Cubillo Araya",
            "Erin N Rondeau-Madrid"
        ],
        "description": "Students will become familiar with the work of teachers and begin to develop their educational philosophies through examining what it means to teach and to learn and the nature and purpose of schools. Students will critically evaluate teaching as their chosen profession. This course includes a required weekly field-based experience in an elementary, middle, or high school classroom.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Construction And Textile Lab Management",
        "subjectCode": "EDCI",
        "courseCode": "20700",
        "instructor": [
            "Diana Dawn Reif"
        ],
        "description": "A lecture/lab course which provides clothing construction and textile science content to be applied in the secondary family and consumer sciences classroom.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Educ Scholar Program I-Honors",
        "subjectCode": "EDCI",
        "courseCode": "21000",
        "instructor": [
            "Nadine E Dolby"
        ],
        "description": "EDCI 21000 is the first course in a two course, introductory sequence for College of Education students enrolled in the Honors College and/or Devito Program scholarship recipients. In this course, we will examine key concepts and ideas in educational thought and research, understand what research is, and begin to explore individual students' research interests.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Teaching For Economic Literacy: Developing An Economic Way Of Thinking",
        "subjectCode": "EDCI",
        "courseCode": "21910",
        "instructor": [
            "Phillip J Vanfossen"
        ],
        "description": "Course focuses on preparing students in the social studies education licensure program to teach high school economics and to integrate economics into other middle and/or high school social studies courses. Course addresses issues of economic pedagogy. It will address economic content/concepts specifically and only in a way to illustrate/expand on the teaching idea, resources, methods and assessment.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Knowing The World Through Mathematics",
        "subjectCode": "EDCI",
        "courseCode": "22200",
        "instructor": [
            "Jill A Newton",
            "Maria Eloisa Cayanan Nuguid"
        ],
        "description": "In this course, Knowing the World Through mathematics, students will connect their situated experiences to larger trends in equity and social justice around the globe through mathematical investigations embedded in the context of the United Nations 2030 agenda (United Nations, 2015). Students in this course will make use of mathematics and global policy documents to critically interpret, model, and represent world phenomena.  Students will collaboratively analyze quantitative information gathered through trustworthy, globally representative data sets and individual survey and questionnaire items to investigate local experiences in relation to students' area(s) of interest. Students will learn about and utilize the GAISE Framework for Statistical Problem Solving (Franklin et al., 2005) and the Four Dimensions of Equity in Mathematics Education (Gutierrez, 2012) to ground their discussions and deliverables for Knowing the World Through Mathematics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Professional Development In Family And Consumer Sciences Education",
        "subjectCode": "EDCI",
        "courseCode": "25000",
        "instructor": [
            "Janine Marie Duncan"
        ],
        "description": "This course focuses on students' professional development as family and consumer sciences educators.  Characteristics and relationships among middle and high school family and consumer sciences standards, resources, and learning experiences; the Purdue Family and Consumer Sciences Education program; and expectations for Indiana FCS teacher-licensure are emphasized.  Includes participation in professional organizations and meetings.",
        "capacity": 0,
        "credits": [
            1,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Multiculturalism And Education",
        "subjectCode": "EDCI",
        "courseCode": "28500",
        "instructor": [
            "Janelle Brittany Grant Ashbaugh",
            "Nicole L Mccabe",
            "Shalin Lena Raye"
        ],
        "description": "This course integrates an understanding of multiculturalism with principles of democratic education. Historical, sociological, cultural, political, philosophical, and pedagogical foundations of multiculturalism are explored and related to issues of pedagogy in a pluralistic society.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Reading In Middle And Secondary Schools: Methods And Problems",
        "subjectCode": "EDCI",
        "courseCode": "30900",
        "instructor": [
            "Arianna Drossopoulos Banack",
            "Helen Claire Bentley"
        ],
        "description": "For prospective teachers at junior and senior high schools. An overview of reading processes, fundamentals of reading instruction, factors that influence the ability to read text materials, strategies and materials for identifying and reducing reading problems, school resources, and programs for normal and deficient readers. Concurrent enrollment with program-specified methods course.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Media For Children",
        "subjectCode": "EDCI",
        "courseCode": "31100",
        "instructor": [
            "Nancy A Boes"
        ],
        "description": "Books and other resources designed for children and adolescents are studied and evaluated in terms of literary theory and aesthetic appreciation. Emphasis is placed on literature and its place in the child's world.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Literacy In The Early Childhood Classroom",
        "subjectCode": "EDCI",
        "courseCode": "32500",
        "instructor": [
            "Kathleen A Martin",
            "Breanya Charise Hogue"
        ],
        "description": "Students will study how children's oral language develops, how children learn to read and write in early childhood/K3 settings,  and the teacher's role in this process.  Students will learn how phonemic awareness, phonics, fluency, vocabulary and comprehension influence children's literacy development.  Students will learn how to select appropriate instructional materials; employ teaching strategies to meet the cognitive and affective literacy needs of all children; and collect, interpret, and use data from various types of assessments to inform literacy teaching and learning processes.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Literacy In The Intermediate Classroom",
        "subjectCode": "EDCI",
        "courseCode": "32600",
        "instructor": [
            "Inna Abramova"
        ],
        "description": "This course includes a field-based component. Students will build on material learned in EDCI 32500. They will concentrate on increasing student's literacy skills with a focus on fluency, phonics, strategic reading, vocabulary, literary analysis, content area reading, the writing process, and building comprehension skills. They will learn to select appropriate materials, employ strategies to meet the cognitive and affective literacy needs of all children; and create integrate, and use data from various forms of assessment to inform the teaching and learning process.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Reading Instruction For Tier 1 And Tier 2",
        "subjectCode": "EDCI",
        "courseCode": "33500",
        "instructor": [
            "Kathleen A Martin",
            "Melanie R Kuhn"
        ],
        "description": "Given the needs of struggling/striving readers throughout the educational system, this class will focus on effective interventions from the primary grades through high school. Instructors will present a balance of theoretical and practitioner-oriented aspects of reading development and instruction. The course will also examine a number of reading models and instructional approaches designed to ensure all students have access to effective, research-based literacy instruction. The goal is to ensure students complete the semester with a range of essential tools for working with this population.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Community Issues & Applications For Educators",
        "subjectCode": "EDCI",
        "courseCode": "35000",
        "instructor": [
            "Abigail E Laufman",
            "Stephanie Scherer",
            "Crystal Snow Webb",
            "Erin N Rondeau-Madrid"
        ],
        "description": "This course is an examination of diverse individual, family, and community characteristics and issues, and potential impacts on teaching and learning processes. Includes service learning with human service agencies and personnel in the school and community. As part of this course, students complete certification to meet the Indiana Department of Education suicide prevention training requirement for teacher licensure.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Career Education In Family And Consumer Sciences",
        "subjectCode": "EDCI",
        "courseCode": "35600",
        "instructor": [
            "Janine Marie Duncan"
        ],
        "description": "Examination of middle and high school career education accomplished through family and consumer sciences, including (1) life and career exploration and planning; (2) analysis of career paths and opportunities in family and consumer sciences; and (3) career preparation through laboratory and cooperative education programs. Historical and contemporary foundations for career education in family and consumer sciences is also are addressed. Includes observations and interactions with students and teachers in career-education programs and participation in professional meetings.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Social Studies In The Elementary School",
        "subjectCode": "EDCI",
        "courseCode": "36100",
        "instructor": [
            "John Patrick Broome",
            "Vahap Demir"
        ],
        "description": "Provides students with an overview of the field of social studies, of selected issues in the field, and of best practice strategies for teaching social studies to elementary school children. Encourages participants to reflect on social studies knowledge, skills and dispositions, how students learn these most effectively, and how best to teach social studies. Includes a field-based experiential component. No undergraduate students may be enrolled in any of these undergraduate courses until they have been admitted to teacher education.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Literacy In The Elementary School II",
        "subjectCode": "EDCI",
        "courseCode": "36300",
        "instructor": [
            "Fay Elizabeth Mentzer",
            "Helen Claire Bentley"
        ],
        "description": "Focuses on teaching children who experience difficulty acquiring literacy. Assessments of children's strengths and needs are used to plan and evaluate instruction. Strategies for helping children develop more mature literacy understandings are applied in weekly small-group instructional sessions. Includes a field-based experiential component. Taken concurrently with EDPS 43000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Mathematics In The Elementary School",
        "subjectCode": "EDCI",
        "courseCode": "36400",
        "instructor": [
            "Elizabeth Suazo Flores",
            "Signe E Kastberg",
            "Yi Zhu",
            "Sezai Kocabas"
        ],
        "description": "Focuses on teaching mathematics in the elementary school. Students learn what it means to teach mathematics when reasoning, problem solving, communication, and connections are the foci. Includes a field-based experiential component.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Science In The Elementary School",
        "subjectCode": "EDCI",
        "courseCode": "36500",
        "instructor": [
            "Jenna Rae Gist",
            "Elizabeth Andrew Thiel",
            "Dean M Ballotti"
        ],
        "description": "Investigates ways children learn science as a basis for planning, enacting, and assessing science curriculum and instruction. State and national standards, teaching cases, and science lab experiences are used as tools for reflecting on practice. Includes a field-based experiential component. Taken concurrently with EDCI 36400 and EDCI 37000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Teaching And Learning English As A New Language",
        "subjectCode": "EDCI",
        "courseCode": "37001",
        "instructor": [
            "Anne M Garcia",
            "Brenda Sarmiento-Quezada",
            "Samarnh Pang",
            "Yangyang Zhu",
            "Karen L Brakke",
            "Natalia Eugenia Ramirez Casalvolone",
            "Mengfei Liu"
        ],
        "description": "This course builds foundational knowledge on the theories and practices related to the English language development of English language learners in the P-12 contexts. Particular attention is given to the current issues as well as on techniques for instructing and assessing students at different stages of English language development in the school context. Students will learn to identify students' strengths and current needs in English, to design classroom experiences across the curriculum, and to assess student performance using current WIDA standards.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Teaching For Social Justice: Culturally And Linguistically Diverse Learners",
        "subjectCode": "EDCI",
        "courseCode": "38100",
        "instructor": [
            "Arianna Drossopoulos Banack"
        ],
        "description": "This course builds on the content of EDCI 28500 (Multicultural Education) with specific attention to issues of social justice related to literacy and linguistic diversity. Within this framework, students will learn strategies for teaching English language learners, deconstruct deficit perspectives of dialectical differences, and consider approaches to classroom management. Additionally, a field experience component with an ELL teacher will be included in the course.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "The Teaching Of Biology In Secondary Schools",
        "subjectCode": "EDCI",
        "courseCode": "42100",
        "instructor": [
            "Khanh Quoc Tran"
        ],
        "description": "The rationale, objectives, methods, and materials of teaching biology and life science in junior and senior high schools. Extensive use of multimedia resources in planning specifically for the student teaching experience. No undergraduate students may be enrolled in any of these undergraduate courses until they have been admitted to teacher education.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "The Teaching Of English In Secondary Schools",
        "subjectCode": "EDCI",
        "courseCode": "42200",
        "instructor": [
            "Tara Johnson"
        ],
        "description": "Explores a wide variety of instructional practices suitable for teaching middle and high school English including language, literature, and writing - addressing specific pedagogical issues such as teaching diverse learners and developing cohesive units of instruction.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "The Teaching Of Social Studies In Secondary Schools",
        "subjectCode": "EDCI",
        "courseCode": "42300",
        "instructor": [
            "Anatoli Rapoport"
        ],
        "description": "The purpose of this course is the development of a theoretical framework and pedagogical skills necessary to teach social studies to middle and high school students. Students are introduced to the general issues involved in planning and organizing a social studies curriculum.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "The Teaching Of Earth And Physical Science In The Secondary Schools",
        "subjectCode": "EDCI",
        "courseCode": "42400",
        "instructor": [
            "Nobel Sanjay Rebello"
        ],
        "description": "The methods and materials needed for the teaching of chemistry, earth-space, physics, and general science in the secondary schools, including field experience. No undergraduate students may be enrolled in any of these undergraduate courses until they have been admitted to teacher education. May be taken for two credits (no field experience) by students who are enrolled in another methods course with field experience.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Teaching Of Secondary Mathematics",
        "subjectCode": "EDCI",
        "courseCode": "42500",
        "instructor": [
            "Amanda Renee Huffman Hayes"
        ],
        "description": "This is the first of two methods courses designed for students who are planning to be secondary mathematics teachers. The course content is organized around principles of equity, curriculum, teaching, learning, assessment and technology. It also focuses on the cycle of effective teaching, which includes justifying planning decisions, analyzing teaching, and using data to inform instruction. The courses addresses NCTM's principles and standards, as well as the content and process standards included in Indiana Academic Standards for Mathematics, and pedagogical strategies for teaching these in ways that serve the diverse population of mathematics learners.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Teaching Of Secondary Mathematics",
        "subjectCode": "EDCI",
        "courseCode": "42600",
        "instructor": [
            "Amanda Renee Huffman Hayes"
        ],
        "description": "This is the second of two methods courses designed for students who are planning to be secondary mathematics teachers. The course content is organized around principles of equity, mathematical task design, classroom discourse, classroom environment assessment and technology. It also focuses on the cycle of effective teaching, which includes justifying planning decisions, analyzing teaching, and using data to inform instruction. The courses addresses NCTM's Professional Standards as well as the content and process standards included in Indiana Academic Standards for Mathematics and pedagogical strategies for teaching in ways that serve the diverse population of mathematics learners.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Advanced Social Studies Methods",
        "subjectCode": "EDCI",
        "courseCode": "43300",
        "instructor": [
            "John Patrick Broome"
        ],
        "description": "Foundations of social studies; methods, techniques, strategies of teaching, and activities - with special attention to skills of planning, questioning, and testing. Includes observation, participation, and microteaching in social studies classrooms. No undergraduate students may be enrolled in any of these undergraduate courses until they have been admitted to teacher education.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Methods For Teaching Family And Consumer Sciences",
        "subjectCode": "EDCI",
        "courseCode": "44400",
        "instructor": [
            "Janine Marie Duncan"
        ],
        "description": "The culminating on-campus teacher-education course for the Purdue University Family and Consumer Sciences program. The course builds and consolidates teacher-candidates' knowledge and skills for teaching family and consumer sciences. Emphasis placed on standards-based instructional planning and materials; instructional strategies, including laboratories, assessment of student learning, and classroom management. Course includes field experiences. Program content requirements should be completed previous to or concurrent with this course.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Global Studies Seminar",
        "subjectCode": "EDCI",
        "courseCode": "45200",
        "instructor": [
            "Xuwei Luo"
        ],
        "description": "(EDPS 45200) The course builds on students' international cross-cultural experiences, particularly Study Abroad. The course is required for those wishing to complete the Global Studies minor in the College of Education.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Honors Scholarly Project Capstone",
        "subjectCode": "EDCI",
        "courseCode": "49200",
        "instructor": [
            "Nadine E Dolby"
        ],
        "description": "This course is designed to provide students with an introduction to designing and writing a proposal for the Honors Scholarly Project.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Supv Tch Soc Std Ed",
        "subjectCode": "EDCI",
        "courseCode": "49800",
        "instructor": [
            "Lanette Valena Jimerson",
            "Chrystal S Johnson",
            "Jill A Newton"
        ],
        "description": "Teaching full time in a school classroom under the supervision of the teacher in charge of the class and a University supervisor. Completion of education methods courses and other Gate requirements for the major area and admittance to teacher education required.",
        "capacity": 0,
        "credits": [
            8,
            16
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Environmental Education",
        "subjectCode": "EDCI",
        "courseCode": "50600",
        "instructor": [
            "Daniel P Shepardson"
        ],
        "description": "Synthesis of philosophies, scientific principles and methods for environmental education programs in forests, camps, and schools. Students conduct and summarize literature research on scientific and educational principles. In interdisciplinary teams, they develop, implement, and evaluate curricula for schools, nature centers, interpretive and outdoor education programs.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Colloquium In Science And Mathematics Education",
        "subjectCode": "EDCI",
        "courseCode": "51000",
        "instructor": [
            "Marcy H Towns"
        ],
        "description": "Weekly colloquia on individual research topics of interest to science and mathematics education faculty and graduate students. Colloquia will describe research programs in education. Course will be required of first-year graduate students.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Foundations Of Learning Design And Technology",
        "subjectCode": "EDCI",
        "courseCode": "51300",
        "instructor": [
            "Katherine H Dufault"
        ],
        "description": "Provides an historical overview of the field and delineates the foundational knowledge, skills, and attitudes needed by professionals in the field of educational technology and instructional design.  Students explore the field by engaging in collaborative projects, along with thinking and writing about various aspects of educational technology and the underlying instructional design theories.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Integrated Science, Technology, Engineering And Mathematics (STEM) Education Methods-Secondary",
        "subjectCode": "EDCI",
        "courseCode": "55800",
        "instructor": [
            "Nathan Mentzer"
        ],
        "description": "Focuses on operationalizing the theoretical pedagogical approaches to integrated Science, Engineering, Mathematics and Agriculture (STEM) education. Collaboratively and cooperatively investigate, plan and deliver integrated learning experiences appropriate for secondary education. Course content will blend philosophical considerations with practical application. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Principles Of Adult Education",
        "subjectCode": "EDCI",
        "courseCode": "56500",
        "instructor": [
            "Brian Allen Talbert"
        ],
        "description": "(YDAE 56500) Principles of adult education applied to helping adults learn, evaluating their performance, and determining their needs. Examines history, philosophy, and research of adult education. Explores techniques required in design and delivery of instruction for adults.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Learning Systems Design",
        "subjectCode": "EDCI",
        "courseCode": "57200",
        "instructor": [
            "Shamila Janakiraman"
        ],
        "description": "An introduction to the principles of designing instructional materials and to instructional communication theory and techniques. Topics include objectives, student characteristics, media selection, communication variables, message design, and systematic evaluation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Foundations Of Curriculum",
        "subjectCode": "EDCI",
        "courseCode": "58000",
        "instructor": [
            "Steven J Burdick"
        ],
        "description": "Introduction to the major historical and philosophical sources of curriculum ideas. Significant forces influencing curriculum decision making. Different theoretical approaches to the construction and analysis of curriculum.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Publishing Research In LDT",
        "subjectCode": "EDCI",
        "courseCode": "59100",
        "instructor": [
            "Brenda M Capobianco",
            "Lixia Cheng",
            "William R Watson",
            "Marisa E Exter"
        ],
        "description": "Group study of a current problem or special topic of interest to professional educational personnel. Intensive study of research, theory, or practical aspects of a particular issue within the usual graduate class format.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Seminar In Bilingualism And Multilingualism",
        "subjectCode": "EDCI",
        "courseCode": "61450",
        "instructor": [
            "Virak Chan"
        ],
        "description": "This course examines theories, research and educational practices in bilingualism and multilingualism. Students will become familiar with major conceptual and methodological issues in research about the use and acquisition of two or more languages in bi/multilingual societal and educational contexts. Individual and societal dimensions will be considered through the examination of a wide range of approaches. Accordingly, the course is transdisciplinary in nature, bringing together work from anthropology, education, psychology, and (socio)linguistics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Qualitative Research Methods In Education",
        "subjectCode": "EDCI",
        "courseCode": "61500",
        "instructor": [
            "Amber M Neal-Stanley"
        ],
        "description": "Focuses on expanding graduate students' research skills to include knowledge of the theories and methods associated with qualitative and qualitative-quantitative combined research. Prerequisite: EDPS 53300.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Gender And Culture In Science Education",
        "subjectCode": "EDCI",
        "courseCode": "61800",
        "instructor": [
            "Brenda M Capobianco"
        ],
        "description": "An examination of the different perspectives on issues of gender, culture, and science.  Major topics include feminist critiques of scientific theories and methods, the work of women and minorities in science, the role science has played in the construction of race and gender, and topics in science education, such as girls' learning in science and the potential of inclusive practices in the science classroom.   Prerequisite: EDCI 51800 or 58500.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "LDT Readings",
        "subjectCode": "EDCI",
        "courseCode": "62700",
        "instructor": [
            "Wanju Huang",
            "Adrie Anne Koehler-Blair"
        ],
        "description": "A critical analysis of problems, trends, issues, and programs related to the area of learning design and technology.  Prerequisite:  EDCI 51300.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Curriculum And Instruction Doctoral Seminar I",
        "subjectCode": "EDCI",
        "courseCode": "62800",
        "instructor": [
            "Marisa E Exter"
        ],
        "description": "An examination of current issues and concerns related to doctoral study in Curriculum and Instruction. This course is intended for all new doctoral students in the Department of Curriculum and Instruction and should be taken within the first year of doctoral study.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "The Teaching Of Mathematics: Insights And Issues",
        "subjectCode": "EDCI",
        "courseCode": "63700",
        "instructor": [
            "Signe E Kastberg"
        ],
        "description": "Examines research related to mathematics teaching, including research on characteristics of mathematics teachers, the features of effective mathematics teaching, and the professional preparation and development of mathematics teachers.  Prerequisite: Master's student standing or higher and enrolled in Mathematics Education.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Curriculum In Career And Technical Education",
        "subjectCode": "EDCI",
        "courseCode": "64800",
        "instructor": [
            "James P Greenan"
        ],
        "description": "Overview of curriculum in career and technical education programs; business and industry training programs; curriculum planning, development, implementation, and evaluation; review and analysis of curriculum models.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Seminar In Career And Technical Education",
        "subjectCode": "EDCI",
        "courseCode": "65300",
        "instructor": [
            "James P Greenan"
        ],
        "description": "Current trends, theory, and practices related to educational contexts and careers.",
        "capacity": 0,
        "credits": [
            1,
            9
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Learning Design And Technology Seminar",
        "subjectCode": "EDCI",
        "courseCode": "66000",
        "instructor": [
            "Luke Bennett"
        ],
        "description": "  This course is an investigation of trends, developments, and issues in learning design and technology with a focus on current practices, problems, and research. This one-credit seminar is designed to help students learn about applications of instructional design and educational technology in various settings and to interact with faculty and guest speakers about topics related to the field and the LDT program.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Contemporary Curriculum Theory",
        "subjectCode": "EDCI",
        "courseCode": "68200",
        "instructor": [
            "Steven J Burdick"
        ],
        "description": "Critical examination of contemporary concepts of curriculum theory. Rational/technical curriculum, social needs/child centered curriculum. Socio-political curriculum theory; curriculum as existential, aesthetic, and phenomenological. Implications for current practice, school reform, and educational research.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    }
]