[
    {
        "title": "Foundations Of Cinema Production",
        "subjectCode": "FVS",
        "courseCode": "26100",
        "instructor": [
            "Jeremy Frederick Sklar"
        ],
        "description": "The course introduces students to the principles and practice of professional video production. Through lectures, viewing, discussions, and laboratory exercises, students will acquire the tools necessary to transform their concepts, or those of their clients, into successful video productions. Film students have priority.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Found Of Live Video Prod",
        "subjectCode": "FVS",
        "courseCode": "29000",
        "instructor": [
            "Bobby L Chastain",
            "Tyler J Rogers"
        ],
        "description": "Special topics or projects under the direction of an instructor in a particular field of specialization.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Sports Video Production Fall/Winter",
        "subjectCode": "FVS",
        "courseCode": "33201",
        "instructor": [
            "Hunter R Massingill"
        ],
        "description": "This experiential course furthers the students understanding of live sports video production. Lecture combined with various production experiences increase the students' proficiency with professional technology and equipment as well as the art and storytelling of the craft. Potential Men's and Women's Fall/Winter sports include Cross Country, Soccer, Volleyball, Football, Swimming & Diving, Wrestling, Basketball, or Track & Field.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Screenwriting",
        "subjectCode": "FVS",
        "courseCode": "33600",
        "instructor": [
            "Jeremy Frederick Sklar"
        ],
        "description": "Students will gain a working knowledge of basic narrative elements and how these elements work to form a story. Writing and re-writing a three-act outline and an original screenplay will give you an understanding of script language and process. (Film Video Studies majors have priority.)",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Producing Non-Fiction Video",
        "subjectCode": "FVS",
        "courseCode": "44600",
        "instructor": [
            "Bobby L Chastain"
        ],
        "description": "This advanced course builds on previous knowledge and exposes students to the role of an independent video producer. By working with real-world clients on real-world projects, students will gain valuable experience in guiding productions from start to finish. Additionally, students will learn basic fundamentals of entrepreneurship and business skills designed to begin to prepare students to form their own video production business.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Produce& Direct Sports Vids",
        "subjectCode": "FVS",
        "courseCode": "49100",
        "instructor": [
            "Cory W Palm",
            "Jeremy Frederick Sklar"
        ],
        "description": "Special topics or projects under the direction of an instructor in a particular field of specialization.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Fall 2022"
    }
]