[
    {
        "title": "Introduction To Academic Programs At Purdue",
        "subjectCode": "GS",
        "courseCode": "11900",
        "instructor": [
            "Edward S Vana"
        ],
        "description": "To provide a comprehensive program describing each of the baccalaureate degree-granting schools at Purdue. The course is designed to assist students in the clarification of their degree objectives. Not open to students who have completed GS 11500.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Summer Start Seminar II",
        "subjectCode": "GS",
        "courseCode": "12001",
        "instructor": [
            "Kathryn Leigh Pratt",
            "Allison Leann McKay",
            "David Joseph Ivey",
            "Morgan Delph"
        ],
        "description": "This seminar course is designed for students to reflect on the hopes, assumptions, and questions they bring with them as they begin their college experience at Purdue University. The class will support student success by introducing students to campus resources, establishing connections with the campus community, expanding study skills learned during high school, and implementing appropriate time management strategies.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Purdue Promise First-Year Experience Course",
        "subjectCode": "GS",
        "courseCode": "19700",
        "instructor": [
            "Lilli Katherine Hertel",
            "Quinton John Skibinski",
            "Dianne Pedroza",
            "Matthew Jay Gouwens"
        ],
        "description": "A combined lecture and experiential seminar course for new Purdue Opportunity Awards scholars. The course will focus on the transition issues for these first-year students.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Strategies For A Successful First Year",
        "subjectCode": "GS",
        "courseCode": "19900",
        "instructor": [
            "Marquetta I Strait"
        ],
        "description": "This course focuses on student adjustment to university life and development skills. Content includes testing to determine skills, attitudes, and interests; group activities to foster student adjustment; and training in computer usage, time management, and University policies. Open to Horizons students only.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Advancing Tomorrow's Leaders: Preparing For Employment And Life After College",
        "subjectCode": "GS",
        "courseCode": "40500",
        "instructor": [
            "Mckalaih Elizabeth Mitchell",
            "Dylan Rhett Whipple",
            "Jazmine C Clifton"
        ],
        "description": "A one-credit course designed to prepare Purdue Promise students for the next chapter of their professional journey through the reflection of past experiences and the acquisition of new knowledge, expectations, and skills necessary to be successful citizens and employees post-graduation. This course is only for students in the Purdue Promise program. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Horizons Study Skills",
        "subjectCode": "GS",
        "courseCode": "49000",
        "instructor": [
            "Brandi Cristine Dennis",
            "Brittany S Allensworth",
            "Noah Lawrence Valentine",
            "Cheryl A Brantley",
            "Brittiany Noel Foley",
            "Cristy R Gosney",
            "Jessica Kristine Weller",
            "Alexander I Harrington",
            "Jared Thomas Ward",
            "Brendin Jay Humrickhouse",
            "Tyler H Ellenwood",
            "Samuel Augustus Baur",
            "Ignacio G Camarillo"
        ],
        "description": "Reading to be done under the direction of the instructor in the particular field of specialization. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Fall 2022"
    }
]