[
    {
        "title": "Introduction To The Medieval World",
        "subjectCode": "HIST",
        "courseCode": "10300",
        "instructor": [
            "Melinda S Zook",
            "Christopher D Beck"
        ],
        "description": "Barbarians, kings, queens, peasants, witches, saints, teachers, students, heretics, Muslims, Jews, Christians, love, death, monks, farm life, city life, ordinary men, women, and children as Europe develops from A.D. 500 to 1500.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To The Modern World",
        "subjectCode": "HIST",
        "courseCode": "10400",
        "instructor": [
            "Jennifer L Foray"
        ],
        "description": "Traces the expansion of Europe into the Americas, Africa, and Asia. The French Revolution, nationalism, and the development of western European states from the era of the Reformation to the present are studied.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Survey Of Global History",
        "subjectCode": "HIST",
        "courseCode": "10500",
        "instructor": [
            "Deborah L Fleetham",
            "Tithi Bhattacharya"
        ],
        "description": "A survey of the interaction between the civilizations of Asia, Africa, Europe, and the Americas since 1500, with attention to cultural comparisons over time, and to the implications of global interdependence for the environment, health, economy, and geopolitics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "American History To 1877",
        "subjectCode": "HIST",
        "courseCode": "15100",
        "instructor": [
            "Trenton C Jones"
        ],
        "description": "A study of the development of American political, economic, and social institutions from the early explorations and colonial settlements through Reconstruction. CTL:ISH 1010 American History I",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "United States Since 1877",
        "subjectCode": "HIST",
        "courseCode": "15200",
        "instructor": [
            "Cornelius L Bynum"
        ],
        "description": "A study of the growth of the United States from 1877 to the present. The new industrialism, agrarian problems, depression, the New Deal, the two world wars, the cold war, and similar topics are analyzed. CTL:ISH 1011 American History II",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Anc Jud & Early Christ",
        "subjectCode": "HIST",
        "courseCode": "20100",
        "instructor": [
            "Stuart Dunbar Robertson"
        ],
        "description": "This variable title course deals with broad historical topics that transcend and telescope traditional analytical, chronological, and geographical boundaries. Content will vary with the instructors teaching the class.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "East Asia And Its Historic Tradition",
        "subjectCode": "HIST",
        "courseCode": "24000",
        "instructor": [
            "Huiying Chen"
        ],
        "description": "Survey of the great historic traditions of China, Japan, and Korea from earliest times to approximately 1600, with special attention to state formation, society, intellectual, philosophical, and religious developments, and the visual, musical, and literary arts.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "South Asian History And Civilizations",
        "subjectCode": "HIST",
        "courseCode": "24300",
        "instructor": [
            "Tithi Bhattacharya"
        ],
        "description": "Survey history of India, Pakistan, and Bangladesh, from the origins of South Asian civilization to the present. Topics include ancient India, the Mughal Empire, the colonial experience, the independence movement, and conflict and popular culture.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Colonial Latin American History (1492-1810)",
        "subjectCode": "HIST",
        "courseCode": "27100",
        "instructor": [
            "Ariel E De La Fuente"
        ],
        "description": "The purpose of this general survey course is to introduce students to the principle historical themes of Latin America during the colonial period (roughly, from 1492 to 1810). No prior knowledge of Latin American history is required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Eve Of Destruction: Global Crises And World Organization In The 20th Century",
        "subjectCode": "HIST",
        "courseCode": "30000",
        "instructor": [
            "William G Gray"
        ],
        "description": "Using a variety of case studies, this course considers 20th-century turning points -- often violent and disastrous ones -- in an emerging global conversation about urgent world problems and their possible solutions.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Gandhi:Myth Real&Persp",
        "subjectCode": "HIST",
        "courseCode": "30200",
        "instructor": [
            "Rajendra Madhukar Abhyankar"
        ],
        "description": "This variable-title course deals with broad historical topics that transcend and collapse traditional analytical, chronological, and geographic boundaries. Content will vary with faculty member teaching the class.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Food In Modern America",
        "subjectCode": "HIST",
        "courseCode": "30305",
        "instructor": [
            "Sharra L Vostral"
        ],
        "description": "This course examines the kitchen as an architectural space, a place of labor and food production, and an arena for technological innovation in modern American history. Cooking and eating reflect cultural sentiments about modernity, progress, ethnicity, and family, and the politics of how society nourishes bodies. Typically offered Fall Spring.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Medical Devices And Innovation",
        "subjectCode": "HIST",
        "courseCode": "31305",
        "instructor": [
            "Sharra L Vostral"
        ],
        "description": "This course examines the history of material cultures of health care in the United States. The class will analyze how technological innovation has become central to medicine over the last two centuries and how we are coping with the consequences, both intended and unintended, of our reliance upon such medical devices. We will look at identities associated with medical devices, the ways in which disease is constructed, how technologies contribute to the naming of maladies, and implications for emergent bioengineering and biotechnologies.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Science And Society In Western Civilization II",
        "subjectCode": "HIST",
        "courseCode": "33400",
        "instructor": [
            "Ekaterina Babintseva"
        ],
        "description": "This course considers Western science and society from the time of Newton to the present. Beginning with Copernicus to Newton, topics next include biological classification, modern chemistry, and the onset of the industrial revolution. For the nineteenth century the course stresses the maturation of biology. Darwinian evolution, the dynamic synthesis and electromagnetic studies, and the second industrial revolution. In the twentieth century, the course covers modern physics, the life sciences, the understanding of the universe, and the interaction between pure and applied science. The course concludes with some of the modern social and political problems which science caused by its success.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "History Of Human Rights",
        "subjectCode": "HIST",
        "courseCode": "33805",
        "instructor": [
            "Rebekah A Klein-Pejsova"
        ],
        "description": "This course explores human rights' genealogy and uneven historical development from Atlantic Revolutionary articulations through the late 20th Century and experience of globalization.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "History Of Religion In America",
        "subjectCode": "HIST",
        "courseCode": "34705",
        "instructor": [
            "Deborah L Fleetham"
        ],
        "description": "This course examines the history of religion in the United States from the colonial period to the present. It traces the evolution of religious life in America and religion's influence on American politics, society, and culture. Typically offered Fall Spring.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "History Of American Military Affairs",
        "subjectCode": "HIST",
        "courseCode": "35500",
        "instructor": [
            "Trenton C Jones"
        ],
        "description": "Surveys American military policy from the colonial militia to the atomic age. Covers major wars and limited wars. The course also investigates the peacetime military functions, i.e., the Navy's role in diplomacy and the Army's involvement in Indian affairs.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Society, Culture, And Rock And Roll",
        "subjectCode": "HIST",
        "courseCode": "37100",
        "instructor": [
            "David C Atkinson"
        ],
        "description": "Surveys American society and culture through the prism of rock and roll music. Looks at politics, gender, race, and class in the postwar era to examine and explain the social, economic, and technological forces that shaped rock and roll.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "History Of The American West",
        "subjectCode": "HIST",
        "courseCode": "37200",
        "instructor": [
            "Dawn Gay Marsh"
        ],
        "description": "This course explores the history of the trans-Mississippi and Pacific west from the early 17th century to the late 19th century. The diverse experiences of the inhabitants and the environmental transformations are the central themes of the course.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "American Constitutional History",
        "subjectCode": "HIST",
        "courseCode": "38200",
        "instructor": [
            "Yvonne M Pitts"
        ],
        "description": "Survey of the fundamental principles of American constitutionalism and dominant trends in judicial interpretation, from the creation of the Constitution to the period of the New Deal.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "History Of Aviation",
        "subjectCode": "HIST",
        "courseCode": "38400",
        "instructor": [
            "Michael G Smith"
        ],
        "description": "A comparative history of human flight and air power (in Europe, the Americas, and Asia) from its origin in the early inventors and pilots, through its reflection in the popular media, to the global development of civil and military aviation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Nrthn Indian Removal 1783-1850",
        "subjectCode": "HIST",
        "courseCode": "39500",
        "instructor": [
            "Dawn Gay Marsh",
            "Michael G Smith"
        ],
        "description": "Variable title seminar for history majors in their junior year intended to teach historical skills, including research in primary sources, analytical skills, and forming historical arguments. It is a writing-intensive course and counts as one of the major requirements.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Dictatorship And Democracy: Europe 1919-1945",
        "subjectCode": "HIST",
        "courseCode": "40800",
        "instructor": [
            "William G Gray"
        ],
        "description": "This course examines the fleeting triumph of democracy across Europe. Followed by the rise of fascism, communism, and Nazism. Emphasis will be placed on broad economic, social, and cultural transformations as well as individual choices to resist or conform.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "History Of The American Presidency",
        "subjectCode": "HIST",
        "courseCode": "41005",
        "instructor": [
            "Kathryn C Brownell"
        ],
        "description": "Using a historical perspective, examines the shifting role of the presidency in the American imagination and the cultural, social, and economic changes that have wrought political developments in public functions and expectations of the modern presidency.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Gender And Politics In Early Modern Europe",
        "subjectCode": "HIST",
        "courseCode": "41505",
        "instructor": [
            "Silvia Z Mitchell"
        ],
        "description": "This course explores the role of gender (its discourse as well as its practice) in the emergence, consolidation, and centralization of European political systems from the Renaissance to the French Revolution, such as princely courts, republics and monarchies.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Honors Historical Methods",
        "subjectCode": "HIST",
        "courseCode": "42100",
        "instructor": [
            "A. Whitney Walton"
        ],
        "description": "Designed as a prequel to Honors Thesis; this course introduces the Honors students to various advanced interpretative approaches to history and methods of historical research. Students also choose their topic for their Honors Thesis and begin research.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Black Civil Rights Movement",
        "subjectCode": "HIST",
        "courseCode": "46900",
        "instructor": [
            "Cornelius L Bynum"
        ],
        "description": "This course will examine the origins, dynamics, and consequences of the modern black civil rights movement by exploring how struggles for racial equality and full citizenship worked to dismantle entrenched systems of segregation, repression, and discrimination within American society and culture.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Madness And The Asylum In The United States",
        "subjectCode": "HIST",
        "courseCode": "48005",
        "instructor": [
            "Yvonne M Pitts"
        ],
        "description": "This course explores how Americans have understood insanity and asylums. We analyze historical concepts of insanity, the evolution of asylums, how psychiatrists have debated therapeutics, and how ordinary people have experienced treatments and diagnoses.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Psychedelic Psychiatry",
        "subjectCode": "HIST",
        "courseCode": "49500",
        "instructor": [
            "Wendy K Kline",
            "A. Whitney Walton"
        ],
        "description": "This course is designed to train history majors in the fundamentals of historical research and writing. Course descriptions vary according to specific topics proposed for study by instructors.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Human Rights",
        "subjectCode": "HIST",
        "courseCode": "60100",
        "instructor": [
            "Rebekah A Klein-Pejsova"
        ],
        "description": "Bibliography and historiography of selected fields of topics in European history; may vary in subject matter from semester to semester. Prerequisite: Master's student standing.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "History: Theory And Methods",
        "subjectCode": "HIST",
        "courseCode": "61000",
        "instructor": [
            "Jennifer L Foray"
        ],
        "description": "This is the first part of an introductory two-course sequence for new graduate students intended to acquaint them with some important issues regarding the modern professional practice of history. This semester concentrates on historiography, theoretical questions, and methodological debates that today's working historians inevitably encounter. Students read about the practice of historical scholarship and read several important example texts representing different approaches to the discipline over the past 200 years. Students write several short book reviews, position papers, and a mock grant proposal during this semester. The course is required of incoming graduate students in history. It usually will be followed by HIST 61100, Research Practicum.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Global Asias: Methods & Cases",
        "subjectCode": "HIST",
        "courseCode": "64100",
        "instructor": [
            "Margaret M Tillman",
            "Rebekah A Klein-Pejsova"
        ],
        "description": "Individual and group study of topics in global history. Topics reflect the research, teaching, or historiographic specialties of the faculty offering the course. Subtitles indicate the focus of the research seminar. Prerequisite: Master's student standing.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Gender Sexuality &Body US Hist",
        "subjectCode": "HIST",
        "courseCode": "65100",
        "instructor": [
            "Wendy K Kline"
        ],
        "description": "Bibliography and historiography of selected fields or topics in American history; may vary in subject matter from semester to semester. Prerequisite: Master's student standing.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2022"
    }
]