[
    {
        "title": "Introduction To Health And Kinesiology",
        "subjectCode": "HK",
        "courseCode": "13500",
        "instructor": [
            "Jocelyn D Cavalier",
            "Hannah Renee Treadway"
        ],
        "description": "Overviews the disciplines of health and kinesiology. Students explore skills and academic interests in theses areas. Describes career opportunities and options for graduate study. Provides strategies for professional and portfolio development. Students complete five hours of community service per semester. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Foundations For The Health And Fitness Professional",
        "subjectCode": "HK",
        "courseCode": "22200",
        "instructor": [
            "Cassandra A Ledman"
        ],
        "description": "Designed to introduce the emerging Health and Fitness professional to current trends in health and physical activity, and provide effective hands-on methodology for implementation of physical activity and exercise in different settings. Students will be able to identify the role of a clinician, coach, trainer, etc. Students will obtain skills in client consultation, program design and strategies for implementing programs to the general population. Students will also be introduced to the skills and knowledge required for working with clinical populations. This course is designed to help students prepare for future clinical practice and certification.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Principles Of Motor Development",
        "subjectCode": "HK",
        "courseCode": "25300",
        "instructor": [
            "Laura J Claxton"
        ],
        "description": "This course provides an introduction to motor development from a life-span perspective. Students will learn how infants develop from mainly reflexive beings into children and adults that are capable of interacting with the world in a goal-directed manner. This course specifically examines how changes in physical growth, aging, and maturation of the central nervous system influence motor performance. Finally, the decline of motor skills associated with advanced age is discussed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Foundations Of Motor Skill Learning",
        "subjectCode": "HK",
        "courseCode": "25800",
        "instructor": [
            "Howard N Zelaznik"
        ],
        "description": "Concepts and principles of motor skill learning, with emphasis on the acquisition and retention of gross movement and sport skills.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Biomechanical Foundations Of Motor Skills",
        "subjectCode": "HK",
        "courseCode": "26300",
        "instructor": [
            "Satyajit S Ambike"
        ],
        "description": "Fundamental anatomical and mechanical concepts and procedures for analyzing motor skills, with particular reference to sport, dance, and aquatic activities.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Fieldwork In Athletic Training",
        "subjectCode": "HK",
        "courseCode": "28700",
        "instructor": [
            "Mitsue Alice Wilcoxson"
        ],
        "description": "Students will learn about and explore the athletic training profession through classroom and experiential learning in an emerging athletic training setting. Under supervision of the certified athletic trainer, students will observe facility operation and duties of the athletic trainer. Topics of instruction include basics of taping and wrapping, selection and fitting of protective equipment, and principles of risk management.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Applied Clinical Anatomy",
        "subjectCode": "HK",
        "courseCode": "30200",
        "instructor": [
            "Mitsue Alice Wilcoxson"
        ],
        "description": "An introduction to the regional anatomical study of the human body for undergraduate allied health students. Lectures will be supplemented by observation and demonstration of prosected cadaver material, radiographs, osteology, and surface anatomy.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Athletic Health Care",
        "subjectCode": "HK",
        "courseCode": "30800",
        "instructor": [
            "Scott E Lawrance"
        ],
        "description": "Provides students with foundational knowledge and skills for the prevention, recognition, and management of common athletic injuries and illnesses, as well as emergency conditions encountered by sports medicine professionals.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Strength And Conditioning And Exercise Instruction Across The Lifespan",
        "subjectCode": "HK",
        "courseCode": "31800",
        "instructor": [
            "Cassandra A Ledman"
        ],
        "description": "This course is designed to provide students with an overview of educational concepts, program design and instructional/leadership skills for designing and instructing exercise programs. Students will obtain hands-on experience conducting exercise programs for strength and conditioning, cardiorespiratory fitness, and flexibility throughout the semester. Students will learn to work with a variety of populations throughout the semester. Students will be evaluated on their effectiveness in designing and instruction exercise sessions for both individual and group-led scenarios. This course is designed to help students prepare for future clinical practice and certifications, such as the ACSM Certified Clinical Exercise Physiologist. Must have CPR/AED, First Aid certifications.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Physical Education In The Elementary School",
        "subjectCode": "HK",
        "courseCode": "32200",
        "instructor": [
            "Carole B Dehaven"
        ],
        "description": "Current conceptions of elementary school physical education, with a particular emphasis on curriculum implementation.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Exercise Physiology I",
        "subjectCode": "HK",
        "courseCode": "36800",
        "instructor": [
            "Chad C Carroll"
        ],
        "description": "Physiological concepts and principles underlying human responses and adaptations to exercise stress. Included are selected methods and techniques of assessing physiological function in the laboratory setting.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Sport And Exercise Psychology I",
        "subjectCode": "HK",
        "courseCode": "37200",
        "instructor": [
            "Shih-Chun Kao"
        ],
        "description": "This course focuses on social and psychological factors related to participation in sport, exercise, and physical activity. The class explores both (a) how social and psychological factors influence participation and performance in physical activity, and (b) how sport, exercise, and physical activity participation affects psychological well-being. Topics include personality, socialization, learning and feedback, stress and coping, self-perceptions, motivation, and psychological methods for enhancing personal development and physical performance.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "History Of Sport",
        "subjectCode": "HK",
        "courseCode": "37600",
        "instructor": [
            "Bonnie T Blankenship"
        ],
        "description": "A prior course in American or world history is recommended but not required. A survey of historical events that have shaped classical and modern sport, with a focus on recent history of American sport. Typically offered Fall Spring.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Clinical Practice In Athletic Training",
        "subjectCode": "HK",
        "courseCode": "40100",
        "instructor": [
            "Mitsue Alice Wilcoxson"
        ],
        "description": "Under the supervision of the certified athletic trainer, the student will be provided the opportunity to practice those skills acquired. The student is expected to take a leadership role in the clinical setting. The student must obtain a minimum of 240 hours, but no more than 480 hours of practicum experience.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Administration Of Athletic Training Programs",
        "subjectCode": "HK",
        "courseCode": "40500",
        "instructor": [
            "Scott E Lawrance"
        ],
        "description": "Advanced theory in the more complex injuries associated with athletics. Organization of athletic training programs, nontraumatic medical problems, pharmacology, and athletic nutrition also will be studied.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Clinical Applications Of Health/Fitness Concepts III",
        "subjectCode": "HK",
        "courseCode": "41100",
        "instructor": [
            "Brandon Alston Yates"
        ],
        "description": "Under the supervision of the program coordinator, students will demonstrate the ability to apply specific skills, competencies, and applications of basic/advanced exercise principles in a professional setting. Required to be taken fall and spring. Permission of department required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Exercise As Medicine",
        "subjectCode": "HK",
        "courseCode": "41500",
        "instructor": [
            "Timothy P Gavin"
        ],
        "description": "Provide students with the concepts, techniques, and skills to investigate the scientific evidence on physical activity and health; and to design and implement interventions to make physical activity a part of daily campus culture. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Health Screening And Fitness Evaluation And Design",
        "subjectCode": "HK",
        "courseCode": "42100",
        "instructor": [
            "Adam S Huffield"
        ],
        "description": "This course provides the learner with the knowledge and skills to successfully administer and interpret the results of health evaluations and fitness assessments for the purposes of analysis and the development of individualized exercise programs.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Basic Concepts In Exercise Program Design",
        "subjectCode": "HK",
        "courseCode": "42200",
        "instructor": [
            "Adam S Huffield"
        ],
        "description": "Introduces basic program design concepts and rationale to design fitness programs for healthy adults emphasizing cardiovascular training, strength training, flexibility training, and balance.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Balance Rehab In Older Adults",
        "subjectCode": "HK",
        "courseCode": "44400",
        "instructor": [
            "Jeffrey M Haddad"
        ],
        "description": "In this course, students learn about the decline in motor function that occurs in older adults and techniques to improve motor function in an older population. Topics include decreased balance control, loss of muscle strength, and declines in adaptive locomotion as a function of age. Students enrolled in this class also participate in an off-campus lab. In the lab, students are paired with an older adult and use the knowledge gained in lecture to improve the motor function of the older adult. This class provides students with a unique opportunity to gain hands-on experience working with an older population. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Advanced Exercise Physiology II",
        "subjectCode": "HK",
        "courseCode": "46800",
        "instructor": [
            "Daniel Hirai"
        ],
        "description": "An advanced undergraduate course in the area of exercise and human performance. Further examination of the physiological mechanisms and theories involved in the exercise response.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Exercise Testing And Prescription In Special Populations",
        "subjectCode": "HK",
        "courseCode": "46900",
        "instructor": [
            "Adam S Huffield"
        ],
        "description": "Examines responses to exercise testing and prescription in healthy adults compared to exercise responses and special considerations for individuals with chronic diseases and conditions and issues of concern to pregnant women, children, and older adults, among others.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Electrocardiography, Cardiovascular Disease And Exercise",
        "subjectCode": "HK",
        "courseCode": "48500",
        "instructor": [
            "Cassandra A Ledman"
        ],
        "description": "This course is designed to provide students with a basic understanding of electrocardiography interpretation, diagnostic testing, and exercise with cardiovascular disease. The course is designed to help students prepare for future clinical practice and certifications, such as, the ACSM Certified Clinical Exercise Physiologist.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Teach Balance Rehab",
        "subjectCode": "HK",
        "courseCode": "49000",
        "instructor": [
            "Mitsue Alice Wilcoxson",
            "Jeffrey M Haddad",
            "Howard N Zelaznik",
            "Christopher Joseph Henderson",
            "William G Evans"
        ],
        "description": "Individualized readings, topics, or projects in health and kinesiology appropriate for undergraduate students. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Athletic Training Practice",
        "subjectCode": "HK",
        "courseCode": "50000",
        "instructor": [
            "Mitsue Alice Wilcoxson"
        ],
        "description": "This course covering the roles and responsibilities of an athletic trainer as well as the history, governance structure, and regulation of the athletic training profession. Instruction and practical application of taping, wrapping, bracing techniques, and protective equipment is also included. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Evidence Based Practice In Athletic Training",
        "subjectCode": "HK",
        "courseCode": "50600",
        "instructor": [
            "Scott E Lawrance"
        ],
        "description": "Introduction to research methodology, and qualitative and quantitative data analysis as related to evidence-based practice of athletic training. The course addresses formulating clinical questions; searching, reading and appraising research; understanding levels of evidence; and citing and referencing works to become consumers of and designers of evidence. The course introduces students to the selection, application, and interpretation of basic descriptive, correlational, and interferential statistics. Permission of department required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Emergency Medical Management In Athletic Training",
        "subjectCode": "HK",
        "courseCode": "51500",
        "instructor": [
            "Jennifer K Popp"
        ],
        "description": "This course is designed to teach management concepts and skills used by athletic trainers in emergency situations. Topics addressing prevention, recognition, and management of life-threatening and/or severe injury and illness are included. Application of skills that include the environment, CPR/AED, airway management, immobilization, bleeding control and sudden illness management are also addressed. Students will become certified in CPR/AED. Permission of department required.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Evaluation And Management Of The Lower Quarter",
        "subjectCode": "HK",
        "courseCode": "52000",
        "instructor": [
            "Jennifer K Popp"
        ],
        "description": "Course covering an in-depth study of the normal anatomical structures in the lower extremities, including joint structure and musculoskeletal/nervous systems. Also discussed are common risk factors and causes of injuries as identified by contemporary epidemiological studies, common injuries to each body part, typical symptoms, and common clinical signs associated with injuries and illnesses with the physically active. A lab covering the assessment and management techniques for injuries commonly seen will be included. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Evaluation And Management Of The Upper Quarter",
        "subjectCode": "HK",
        "courseCode": "53000",
        "instructor": [
            "Scott E Lawrance"
        ],
        "description": "Course covering an in-depth study of the normal anatomical structures in the upper extremities, including joint structure and musculoskeletal/nervous systems. Also discussed are common risk factors and causes of injuries as identified by contemporary epidemiological studies, common injuries to each body part, typical symptoms, and common clinical signs associated with injuries and illnesses with the physically active. A lab covering the assessment and management techniques for injuries commonly seen will be included. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Cardiopulmonary Physiology",
        "subjectCode": "HK",
        "courseCode": "53600",
        "instructor": [
            "Bruno Tesini Roseguini"
        ],
        "description": "  This course will provide a comprehensive overview of the characteristics and regulatory mechanisms underlying the cardiorespiratory adjustments to exercise. The effects of chronic diseases, including chronic obstructive pulmonary disease, peripheral artery disease and chronic heart failure, on the cardiovascular and respiratory responses to exercise will also be discussed in detail. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Advanced Exercise Psychology",
        "subjectCode": "HK",
        "courseCode": "57400",
        "instructor": [
            "Steve Amireault"
        ],
        "description": "This course is designed to examine psychological issues and theories related to exercise, the promotion of regular physical activity and active lifestyles. Emphasis is placed on the factors related to physical activity, health behavior theories, and the psychological and emotional consequences of exercise and physical activity. Key methodological considerations in behavioral health research will also be highlighted.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Physical Activity & Cognition",
        "subjectCode": "HK",
        "courseCode": "59000",
        "instructor": [
            "Shih-Chun Kao"
        ],
        "description": "Individualized readings, topics, or projects in health and kinesiology appropriate for graduate students. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "HK PhD Seminar",
        "subjectCode": "HK",
        "courseCode": "60100",
        "instructor": [
            "Chad C Carroll"
        ],
        "description": "This course is the first of a required two-course sequence for first-year health and kinesiology doctoral students. The course is designed to socialize students into the worlds of science, graduate education, and health and kinesiology research and practice. Particular emphasis is placed on the responsible conduct of research, shared and unique expectations of graduate students and mentors across various health and kinesiology subdisciplines, professional development, and the nurturing of academic community. Prerequisite: Incoming health and kinesiology doctoral students qualify for and are required to complete this course. Permission of department required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Advanced Semnr In Kinesiology",
        "subjectCode": "HK",
        "courseCode": "67000",
        "instructor": [
            "Satyajit S Ambike"
        ],
        "description": "Selected topics in motor control. The subject matter will be data-based and drawn from research literature encompassing behavioral and physiological experimental paradigms. Students will critically evaluate and synthesize research to better understand the integration of individual systems in sensorimotor processing. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    }
]