[
    {
        "title": "Research Thinking",
        "subjectCode": "HONR",
        "courseCode": "19900",
        "instructor": [
            "Thomas Edward Gerrish",
            "Heidi Ione Fahning"
        ],
        "description": "These introductory topic seminars are designed to open intellectual horizons and allow opportunities for learning by inquiry in a collaborative environment. Courses are limited to 20 participants or less, may be team-taught, and emphasize close interaction between the professor(s) and the students.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Fall 2022"
    },
    {
        "title": "The Evolution Of Ideas",
        "subjectCode": "HONR",
        "courseCode": "19901",
        "instructor": [
            "Zahra A Tehrani",
            "Nicole Marie Fadellin",
            "Nathan W Swanson",
            "Christie Nicole Shee",
            "Mayari Illarij Serrano anazco",
            "Adam E Watkins",
            "Lindsay Weinberg",
            "Muiris Macgiollabhui",
            "Katherine M Jarriel",
            "Elizabeth B Brite",
            "Md Sanoar Rahman",
            "Dwaine H Jengelley",
            "Anish Vanaik",
            "Jason A Ware",
            "Ashima Krishna",
            "Jonathan P Moore"
        ],
        "description": "This course is the first half of the required introductory series taken by all students entering the Honors College. Restricted to Honors College students.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Interdisciplinary Approaches In Writing",
        "subjectCode": "HONR",
        "courseCode": "19903",
        "instructor": [
            "Jonathan P Moore"
        ],
        "description": "This course is a writing-intensive course in which students learn how to find, evaluate, and use credible information, how to express themselves well in a variety of different written genres, and how to write for different audiences.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Research Accelerator Mentors",
        "subjectCode": "HONR",
        "courseCode": "29900",
        "instructor": [
            "Thomas Edward Gerrish",
            "Nicole Marie Fadellin",
            "Nathan W Swanson",
            "Adam E Watkins",
            "Kristen Marie Bellisario",
            "Heidi Ione Fahning",
            "Ashima Krishna"
        ],
        "description": "These interdisciplinary topics seminars are designed to offer experiential learning on campus, in the community, and around the world. Courses are limited to 20 participants or fewer, may be team-taught, and emphasize close interaction between the professor(s) and the students. Students will participate in active learning exercises that may include study away and study abroad, workshops, research and creative skill building, community collaboration, and/or service learning. Seminar topics will vary from semester to semester.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Interdisciplinary Honors",
        "subjectCode": "HONR",
        "courseCode": "29901",
        "instructor": [
            "Zahra A Tehrani",
            "Nicole Marie Fadellin",
            "Nathan W Swanson",
            "Christie Nicole Shee",
            "Mayari Illarij Serrano anazco",
            "Muiris Macgiollabhui",
            "Adam E Watkins",
            "Lindsay Weinberg",
            "Katherine M Jarriel",
            "Elizabeth B Brite",
            "Md Sanoar Rahman",
            "Dwaine H Jengelley",
            "Anish Vanaik",
            "Jason A Ware",
            "Ashima Krishna",
            "Jonathan P Moore"
        ],
        "description": "This hands-on course provides leadership training to the continuing Honors College students selected to work as mentors for the required, first-year honors course. Students work closely with a faculty instructor. Restricted to Honors College students. Department permission required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "The Anthropocene",
        "subjectCode": "HONR",
        "courseCode": "39900",
        "instructor": [
            "Nadine E Dolby",
            "Huachao Mao",
            "Gustavo Severo De Borba",
            "Muiris Macgiollabhui",
            "Matthew N Hannah",
            "Elizabeth B Brite"
        ],
        "description": "This course is designated for a wide range of honors seminars that stress interdisciplinary understanding, intellectual flexibility, creative thought, and group discussion. Topics vary by semester. Open to students at all levels.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Fall 2022"
    },
    {
        "title": "GeoSpace",
        "subjectCode": "HONR",
        "courseCode": "49900",
        "instructor": [
            "Molly M Amstutz",
            "Katherine M Jarriel",
            "Kristen Marie Bellisario",
            "Dwaine H Jengelley",
            "Jason A Ware"
        ],
        "description": "This course is designated for a wide range of faculty-led collaborative research projects. Topics will vary by semester. Permission of department required.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Research Mentorship Development Program",
        "subjectCode": "HONR",
        "courseCode": "59901",
        "instructor": [
            "Zahra A Tehrani"
        ],
        "description": "The Research Mentorship Development Program is designed for Purdue based on a nationally recognized curriculum and prepares graduate students or postdocs to mentor undergraduates in research. Effective mentoring of undergraduate researchers requires specific skillsets and approaches. Implementation of these strategies can lead to a productive and mutually beneficial experience for both students and their mentors. The course is designed for graduate students who plan to work with new researchers in their labs or research groups and who plan to enter academia or pursue careers in which they will mentor others in scholarship or research. Graduate students or postdocs selected for the program are matched with honors students who are interested in research. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    }
]