[
    {
        "title": "Fundamentals Of Horticulture",
        "subjectCode": "HORT",
        "courseCode": "10100",
        "instructor": [
            "Kathryn S Orvis"
        ],
        "description": "Biology and technology involved in the production, storage, processing, and marketing of horticultural plants and products. Laboratories include experiments demonstrating both the theoretical and practical aspects of horticultural plant growth and development.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Medicine In The Garden",
        "subjectCode": "HORT",
        "courseCode": "12100",
        "instructor": [
            "Joshua R Widhalm"
        ],
        "description": "A survey of the uses and properties of horticultural plants for human health and well-being. Topics will focus on the close relationships between plants and human physiology, nutrition, medicines, mind-altering drugs, poisons, and beverages.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Woody Landscape Plants",
        "subjectCode": "HORT",
        "courseCode": "21700",
        "instructor": [
            "Paul C Siciliano"
        ],
        "description": "Recognition and identification of woody landscape plants; plant characteristics in terms of landscape function.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Hardy Herbaceous Landscape Plants",
        "subjectCode": "HORT",
        "courseCode": "21820",
        "instructor": [
            "Michael N Dana"
        ],
        "description": "Survey of hardy perennial herbaceous ornamentals including native and non-native species, bulbs, groundcovers, grasses, ferns, aquatics; recognition; cultural requirements; and use in landscape plantings.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Landscape Contracting And Management",
        "subjectCode": "HORT",
        "courseCode": "31700",
        "instructor": [
            "Kyle M Daniel"
        ],
        "description": "Principles and practices applicable to the installation and management of landscape plants. Topics include site and project assessment, site modification and plant installation, the business practices of estimating and bidding, and plant management. Requires class trips. Students will pay individual lodging or meal expenses when necessary.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "The Plant Microbiome",
        "subjectCode": "HORT",
        "courseCode": "52500",
        "instructor": [
            "Lori A Hoagland"
        ],
        "description": "Students will learn about the latest methods to collect and analyze root and shoot exudates, quantify the composition and activity of microbes associating with plants, and determine how these associations influence plant health and productivity. Critical reviews of the primary literature and development of a research proposal will help students acquire the skills needed to conduct research on this rapidly emerging topic.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Applied Plant Genomics",
        "subjectCode": "HORT",
        "courseCode": "53100",
        "instructor": [
            "Ying Li"
        ],
        "description": "This course aims to provide students an introduction to the theory and practice of functional genomics in plants. The course is centered around the many forms in which DNA sequencing technologies are applied to understand plant genomes, their variation and their function. The course will cover concepts in plant genome sequencing, transcriptome profiling and functional enrichment analyses in sets of genes. This is a full semester course that meets twice a week for: 1. A lecture that covers the rationale and theory of the topic and 2. A hands-on lab section that provides experiential learning with the computational tools and packages used in plant genomics and transcriptomics.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Plant Responses To The Environment",
        "subjectCode": "HORT",
        "courseCode": "55100",
        "instructor": [
            "Michael V Mickelbart"
        ],
        "description": "Future agricultural production and the environment will encounter multifaceted challenges from global climate change, heat and drought incidence and severity, and limited land and resources. An understanding of how plant responds to these changes is essential to develop new technologies and systems approaches to mitigate the negative impacts and enhance agricultural crop productivity. This is an advanced plant biology course covering the present state of understanding of phenological, physiological, and molecular and genetic mechanisms and processes by which plants acclimate to transient and chronic environmental extremes.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Stakeholdr Involvmnt Land Mgmt",
        "subjectCode": "HORT",
        "courseCode": "59000",
        "instructor": [
            "Linda S Prokopy"
        ],
        "description": "Special studies in horticulture not covered in regular coursework. The field in which work is offered will be indicated in the student's record. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Horticulture Research Seminar",
        "subjectCode": "HORT",
        "courseCode": "60200",
        "instructor": [
            "Joshua R Widhalm"
        ],
        "description": "Weekly attendance at the Horticulture and Landscape Architecture Departmental seminars to help graduate students develop an appreciation for attending seminars and learning appropriate and effective presentation skills. HORT 602 compliments HORT 601 and HORT 603 by extending the presentation and project development approaches learned, so that students are better ready to prepare and defend their project proposals in HORT 603. Prerequisite: BCHM 56100.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Horticulture Seminar",
        "subjectCode": "HORT",
        "courseCode": "69500",
        "instructor": [
            "Joshua R Widhalm"
        ],
        "description": "Topics of current interest to staff and students.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Fall 2022"
    }
]