[
    {
        "title": "Introduction To Linguistics",
        "subjectCode": "LING",
        "courseCode": "20100",
        "instructor": [
            "Alexis Nicole Zhou",
            "Seyyed Hatam Tamimi Sa'd",
            "Yuhyeon Seo",
            "Elaine J Francis",
            "Leah Michelle Nodar"
        ],
        "description": "Basic concepts of linguistics and methods of analysis of language; overview of linguistics and the role of language in society. Introduction to phonology, morphology, syntax, and semantics, and to problem-solving techniques, with material drawn from a variety of languages. Typically offered Fall Spring.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Fundamentals Of Phonology And Morphology",
        "subjectCode": "LING",
        "courseCode": "31100",
        "instructor": [
            "Ye-Jee Jung"
        ],
        "description": "Basic concepts and tools of phonological and morphological analysis viewed through the material of American English. Current theoretical approaches to phonology and morphology, including word-formation processes and applications. Typically offered Fall Spring.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Foundations Of Syntax And Semantics",
        "subjectCode": "LING",
        "courseCode": "32100",
        "instructor": [
            "Elena E Benedicto"
        ],
        "description": "Introduction to syntactic and semantic analysis based on American English and its dialects. Underlying structure and its relation to meaning. Analysis of parts of speech, constituent phrases, sentence structure, representations, ambiguity, and applications of current theory. Credit will not be given for both LING 32100 and ENGL 32800. Typically offered Fall Spring.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Linguistics",
        "subjectCode": "LING",
        "courseCode": "50000",
        "instructor": [
            "Victor Raskin"
        ],
        "description": "Fundamental concepts and methods of linguistic analysis of natural languages; overview of linguistics and the role of language in society. Introduction to phonology, morphology, syntax and semantics, and to problem-solving techniques, with material drawn from a wide variety of languages.  Offered in conjunction with ANTH 51400 or AUSL 58000 or ENGL 50600 or LC 56100. Typically offered Spring Fall.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Phonology I: Descriptive Analysis",
        "subjectCode": "LING",
        "courseCode": "51100",
        "instructor": [
            "Olga Dmitrieva"
        ],
        "description": "Foundations of phonological analysis. Development of concepts and methods for the analysis of phonological data and the phonological structures of natural languages within the framework of generative phonology. Focuses on problem solving and linguistic argumentation. Offered in conjunction with ENGL 51300.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Syntax I: Syntactic Analysis",
        "subjectCode": "LING",
        "courseCode": "52100",
        "instructor": [
            "Elena E Benedicto"
        ],
        "description": "Foundations of syntactic analysis and syntactic theory within the framework of generative grammar. Focuses on the central concepts of syntactic theory and on the principles and methods of syntactic analysis and argumentation using a core of topics relevant for syntactic theory. Offered in conjunction with ENGL 51200.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Semantics I: Lexical And Sentential Semantics",
        "subjectCode": "LING",
        "courseCode": "53100",
        "instructor": [
            "Victor Raskin"
        ],
        "description": "Foundations of semantic analysis and survey of current linguistic semantic theories and methods. Semantics at the lexical and sentential levels. Combinatorial, truth-conditional, pragmatic, contextual, and computational semantics. Offered in conjunction with ENGL 51100.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "History Of Russian Lang",
        "subjectCode": "LING",
        "courseCode": "59400",
        "instructor": [
            "Robert Channon"
        ],
        "description": "Investigation of an advanced topic in historical linguistics. Topic varies from semester to semester. Permission of instructor required. Typically offered Fall Spring.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Anthrop Linguistics",
        "subjectCode": "LING",
        "courseCode": "59800",
        "instructor": [
            "Mariko M Wei",
            "Lixia Cheng",
            "Robert Channon",
            "Myrdene Anderson",
            "Colleen A Neary-Sundquist"
        ],
        "description": "Investigation of an advanced topic in linguistics. Topic varies from semester to semester. Permission of instructor required. Typically offered Fall Spring.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Fall 2022"
    }
]