[
    {
        "title": "Environmental Science And Conservation",
        "subjectCode": "NRES",
        "courseCode": "12500",
        "instructor": [
            "John B Dunning"
        ],
        "description": "(AGRY 12500, EAPS 12500, FNR 12500) Introduction to environmental science and conservation includes topics in ecological principles, conservation and natural resource management, human impacts on the environment, toxic waste disposal, climate change, energy, air and water pollution, environmental geology and geologic hazards.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Soil Science",
        "subjectCode": "NRES",
        "courseCode": "25500",
        "instructor": [
            "Shams Rahman R Rahmani"
        ],
        "description": "(AGRY 25500) Differences in soils; soils genesis; physical, chemical, and biological properties of soils; relation of soils to problems of land use and pollution; soil management relative to tillage, erosion, drainage, moisture supply, temperature, aeration, fertility, and plant nutrition. Introduction to fertilizer chemistry and use. Not available to students who have taken AGRY 27000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Environmental Soil Chemistry",
        "subjectCode": "NRES",
        "courseCode": "38500",
        "instructor": [
            "Linda S Lee"
        ],
        "description": "(AGRY 38500) Designed as an upper level introductory course covering environmental soil chemistry concepts in the framework most applicable to inorganic and organic chemical contamination of soil and water resources and intended for students in environmental science fields that may not have a strong chemistry and/or mathematics background.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Environmental Internship Reporting",
        "subjectCode": "NRES",
        "courseCode": "42000",
        "instructor": [
            "Laura C Bowling"
        ],
        "description": "Reporting on participation in government, industrial, or other internship program. Permission of department required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Soil Conservation And Water Management",
        "subjectCode": "NRES",
        "courseCode": "45000",
        "instructor": [
            "Shalamar D Armstrong"
        ],
        "description": "(AGRY 45000) Principles of soil conservation with emphasis on control of soil erosion by wind and water; impact of soil management decisions on environment; soil-water-plant relations, includes agronomic aspects of water management for both irrigation and drainage.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Fundamentals Of Planning",
        "subjectCode": "NRES",
        "courseCode": "47000",
        "instructor": [
            "Kara A Salazar"
        ],
        "description": "This course will overview key steps involved in natural resources planning, expose students to a variety of different natural resource plans, and engage students in critically evaluating the effectiveness of planning. (Course meets during weeks 1-5.)",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    }
]