[
    {
        "title": "Introduction To Naval Science",
        "subjectCode": "NS",
        "courseCode": "11000",
        "instructor": [
            "Jennifer L Kwiatek"
        ],
        "description": "This course is a general introduction to the USN and USMC that emphasizes organizational structure, warfare components and assigned roles/missions of USN/USMC. It covers all aspects of naval service from its relative position within the DoD to the specific warfare community/career paths and includes basic elements of leadership and USN and USMC core values. The course provides students with initial exposure to many elements of naval culture and provides the conceptual framework/working vocabulary for students to use on summer cruise.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Naval Leadership And Management",
        "subjectCode": "NS",
        "courseCode": "21400",
        "instructor": [
            "Christopher M Dudley"
        ],
        "description": "Introduces the student to many of the fundamental concepts of leading Sailors and Marines, which shall be expanded upon during the continuum of leadership development throughout NROTC. It develops the elements of leadership vital to the effectiveness of Navy/Marine Corps officers by reviewing the theories and parameters of leadership and management within and outside of the Naval Service and progressing through values development, interpersonal skills, management skills, and application theory. Practical applications are explored through the use of experiential exercises, readings, case studies, and laboratory discussions.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Naval Operations And Seamanship",
        "subjectCode": "NS",
        "courseCode": "31100",
        "instructor": [
            "Brandon M Alcorn"
        ],
        "description": "This course is a continued study of relative motion, formation tactics, and ship employment. It includes introductions to naval operations and operations analysis, ship behavior and characteristics in maneuvering, applied aspects of ship handling, afloat communications, naval command and control, naval warfare areas, and joint warfare.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Naval Ship Systems-Engineering",
        "subjectCode": "NS",
        "courseCode": "35000",
        "instructor": [
            "William Kenneth Satre"
        ],
        "description": "In this course, students learn detailed ship design, hydrodynamic forces, stability, propulsion, electrical theory and distribution, hydraulic theory and ship control, and damage control. The course includes basic concepts of theory/design of steam, gas turbine, diesel, and nuclear propulsion.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Naval Leadership And Ethics",
        "subjectCode": "NS",
        "courseCode": "41300",
        "instructor": [
            "Christopher M Nelson"
        ],
        "description": "This course completes the final preparations of ensigns and second lieutenants for service in the Navy and Marine Corps. The course integrates an intellectual exploration of Western moral traditions and ethical philosophy with a variety of topics, such as military leadership, core values, professional ethics, the UCMJ and Navy regulations, and discussions relating to the roles of enlisted members, junior and senior officers, command relationships, and the conduct of warfare. The course provides midshipmen with a foundation of moral traditions, combined with a discussion of actual current and historical events in the Navy and Marine Corps, to prepare them for the roles and responsibilities of leadership in the Naval Service of the 21st century. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    }
]