[
    {
        "title": "Introduction To Institutional Pharmacy Practice",
        "subjectCode": "PHPR",
        "courseCode": "45000",
        "instructor": [
            "Steven A Scott"
        ],
        "description": "An overview of the delivery of pharmaceuticals and the provision of clinical and administrative services to patients in institutional settings is presented along with the various roles pharmacists play both within the pharmacy department and the institution. Course content focuses on the provision of services and career development rather than on drug therapy. The course features a series of presentations by practitioners from a variety of practice settings. Enrollment is limited to Doctor of Pharmacy students or by consent of course coordinator.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Self-Care Pharmacy Practice I",
        "subjectCode": "PHPR",
        "courseCode": "48000",
        "instructor": [
            "Gail D Newton"
        ],
        "description": "This course is specifically designed to provide students with guided experience in the application of knowledge acquired during previous professional course work to the solution of simulated problems which occur in self-care pharmacy practice. Specifically, the course is designed to introduce students to the appropriate selection and use of nonprescription medications and devices for the treatment of minor health complaints by patients. A principle theme throughout the course is that the solution of all self-care problems (i.e., regardless of the context in which they occur) involves the application of the same basic problem-solving process. Course activities, readings and homework assignments will provide students with illustration of how the problem-solving process can be applied to specific self-care situations that arise in practice. Active learning methods will be employed to involve students directly in the actual application of this process to simulated practice problems. Topics: Colds, Coughs, Allergies.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Self-Care Pharmacy Practice III",
        "subjectCode": "PHPR",
        "courseCode": "48300",
        "instructor": [
            "Gail D Newton"
        ],
        "description": "This course is specifically designed to provide students with guided experience in the application of knowledge acquired during previous professional course work to the solution of simulated problems which occur in self-care pharmacy practice. Specifically, the course is designed to introduce students to the appropriate selection and use of nonprescription medications and devices for the treatment of minor health complaints by patients. A principle theme throughout the course is that the solution of all self-care problems (i.e., regardless of the context in which they occur) involves the application of the same basic problem-solving process. Course activities, readings and homework assignments will provide students with illustration of how the problem-solving process can be applied to specific self-care situations that arise in practice. Active learning methods will be employed to involve students directly in the actual application of this process to simulated practice problems. Topics: Dermatology.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Beyond Ecstasy",
        "subjectCode": "PHPR",
        "courseCode": "48600",
        "instructor": [
            "Cynthia P Koh-Knox Sharp"
        ],
        "description": "The goal of the course is to augment the students' knowledge about commonly used street drugs including: pharmacology and mechanisms of action; interactions and adverse effects; law enforcement and policing; available support and treatment for addiction, abuse, and misuse; and the role of pharmacists.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Prin Drug Dev Pharma Industry",
        "subjectCode": "PHPR",
        "courseCode": "49000",
        "instructor": [
            "Brian M Shepler"
        ],
        "description": "An honors course to be used to relate to, and supplement, an existing course. Subject matter and method of approach individually directed by instructor. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2022"
    }
]