[
    {
        "title": "American Government And Politics",
        "subjectCode": "POL",
        "courseCode": "10100",
        "instructor": [
            "Valeria S Chapman",
            "John W T Megson"
        ],
        "description": "A study of the nature of democratic government, the U.S. Constitution, federalism, civil rights, political dynamics, the presidency, Congress, and the judiciary. CTL:ISH 1002 American Government",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Public Policy And Public Administration",
        "subjectCode": "POL",
        "courseCode": "12000",
        "instructor": [
            "Russell Harry Hall"
        ],
        "description": "An introduction to the fields of public policy and public administration. Processes of policy formation and administration are examined. Different approaches to evaluating and improving public policies are discussed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To International Relations",
        "subjectCode": "POL",
        "courseCode": "13000",
        "instructor": [
            "Kyle E Haynes"
        ],
        "description": "An analysis of the fundamentals of international law, organization, and politics, particularly as relevant to contemporary international relations. CTL:ISH 1003 Introduction To World Politics",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Governments Of The World",
        "subjectCode": "POL",
        "courseCode": "14100",
        "instructor": [
            "William Adam Dory",
            "Joan Carreras Timoneda"
        ],
        "description": "An introduction to the politics and government in selected foreign countries. The course presents the tools and background needed to understand contemporary events in the world beyond the United States. Readings and discussions pay special attention to democratization and development.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Political Thought",
        "subjectCode": "POL",
        "courseCode": "15000",
        "instructor": [
            "Mary F Scudder"
        ],
        "description": "Introduction to basic concepts in political philosophy, such as conflict and community, justice and the good society, the origins of democracy, and the intersections of class, race, gender, and sexuality.  Selected classical and contemporary political thinks covered.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Environmental Policy",
        "subjectCode": "POL",
        "courseCode": "22300",
        "instructor": [
            "Tara Grillos",
            "Leigh S Raymond"
        ],
        "description": "(FNR 22310)  Study of decision making as modern societies attempt to cope with environmental and natural resources problems. Focuses on the American political system, with some attention to the international dimension. Current policies and issues will be examined.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Social And Polit Phil",
        "subjectCode": "POL",
        "courseCode": "22900",
        "instructor": [
            "Lynn Parrish"
        ],
        "description": "This course focuses on problems and issues that are beginning to be recognized as worthy of public discussion or policy action, or that may be new areas of expertise and interest for our faculty members. We use it to introduce new topics and approaches, including experimental pedagogies, courses that involve travel, and the like. The content of the course varies from one offering to the next. Possible topics are Bioethics and Politics, Food Policy, and Bicycle Politics.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To United States Foreign Policy",
        "subjectCode": "POL",
        "courseCode": "23100",
        "instructor": [
            "Melissa C Will"
        ],
        "description": "Designed to introduce students to the major themes and issues in contemporary U.S. foreign policy. Lectures, discussion, and readings will examine such areas as U.S. relationships with the major powers, the Third World, and international organizations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Modern Weapons And International Relations",
        "subjectCode": "POL",
        "courseCode": "23700",
        "instructor": [
            "Melissa C Will"
        ],
        "description": "This course introduces the student to the roles that modern weapons systems play in contemporary international relations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Political Analysis",
        "subjectCode": "POL",
        "courseCode": "30000",
        "instructor": [
            "Eric N Waltenburg"
        ],
        "description": "An introduction to the study of politics, its basic concepts and major areas of concern; also review of important research techniques, including methods of data collection and analysis.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "The President And Policy Process",
        "subjectCode": "POL",
        "courseCode": "31400",
        "instructor": [
            "Kathryn C Brownell"
        ],
        "description": "A study of presidential leadership as the embodiment of social forces and as reflective of the personality of the incumbent; the president as national leader reflecting national myths and ideologies; the growth of the presidency; issues and forces affecting the continuity of presidential leadership; the degree of institutionalization of the presidency.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Comparative Environmental Policy",
        "subjectCode": "POL",
        "courseCode": "32300",
        "instructor": [
            "Reed Michael Kurtz"
        ],
        "description": "Comparative study of environmental policy development and processes in industrialized democracies, former and current communist states, and developing nations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Global Green Politics",
        "subjectCode": "POL",
        "courseCode": "32700",
        "instructor": [
            "Reed Michael Kurtz"
        ],
        "description": "Analysis and assessment of the nature of global environmentalism, its connections with other new social movements, and its impact on domestic and international politics worldwide, with particular attention to green political parties and nongovernmental organizations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Campaigns And Elections",
        "subjectCode": "POL",
        "courseCode": "37300",
        "instructor": [
            "Martin Jay Sweet"
        ],
        "description": "This course analyzes the role of political parties, issues, candidates, media, funding, and electoral and campaign strategies in presidential, congressional, and state campaigns. Contemporary election examples will be utilized.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Congress: Structure And Functioning",
        "subjectCode": "POL",
        "courseCode": "41100",
        "instructor": [
            "Robert X Browning"
        ],
        "description": "A study of how Congress actually operates. Formal and informal power structures within both chambers and roles of the individual members of Congress are analyzed. Attention is directed to latent, as well as manifest, functions of legislative, investigative, and other major activities of Congress. The problem of bringing expertise to bear on the legislative process is considered throughout.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "International Environmental Policy",
        "subjectCode": "POL",
        "courseCode": "42300",
        "instructor": [
            "Reed Michael Kurtz"
        ],
        "description": "Environmental policy development in the international arena, with attention to international law, international organizations, and transboundary environmental problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Am Political Communication",
        "subjectCode": "POL",
        "courseCode": "42900",
        "instructor": [
            "Diana G Zulli",
            "Swati Srivastava"
        ],
        "description": "Contemporary political problems in the United States affecting the interpretation of democracy, human rights and welfare, social pressures, and intergovernmental relations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "International Organization",
        "subjectCode": "POL",
        "courseCode": "43300",
        "instructor": [
            "Ann Marie Clark"
        ],
        "description": "A study of the structure and functions of the United Nations and associated agencies, with an emphasis on the role of this system in contemporary international relations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Judicial Politics",
        "subjectCode": "POL",
        "courseCode": "46000",
        "instructor": [
            "Eric N Waltenburg"
        ],
        "description": "A survey of judicial processes as they operate in America. Both trial courts and appellate courts will be examined in light of the procedures with which they operate. The external social, economic, and political pressures surrounding courts and the impact courts have on society will be considered.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Constitutional Law I",
        "subjectCode": "POL",
        "courseCode": "46100",
        "instructor": [
            "Linda Lee Kampe",
            "Christina Lynn Thomas"
        ],
        "description": "A survey of selected areas of constitutional law, considering the political and social influences as well as the doctrinal forces that have produced these policies and interpretations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Constitutional Law II",
        "subjectCode": "POL",
        "courseCode": "46200",
        "instructor": [
            "Martin Jay Sweet"
        ],
        "description": "An examination of the development of individual rights and civil liberties through constitutional law and interpretation of the Bill of Rights and Civil War Amendments. Both doctrinal and political pressures will be discussed to illustrate the evolution of these rights.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Democracy And Its Critics",
        "subjectCode": "POL",
        "courseCode": "49100",
        "instructor": [
            "Swati Srivastava",
            "Mary F Scudder",
            "Logan R Strother"
        ],
        "description": "This is a variable-title seminar focusing on contemporary issues in political science at the senior level. It is part of the \"capstone\" experience for political science majors.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Political Science: Methodology",
        "subjectCode": "POL",
        "courseCode": "50100",
        "instructor": [
            "Joan Carreras Timoneda"
        ],
        "description": "Introduction to the basic techniques of statistical analysis applicable to political science data. Elementary descriptive statistics and statistical inference. Introduction to multivariate analysis. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Diversity Equity Inclusion",
        "subjectCode": "POL",
        "courseCode": "52000",
        "instructor": [
            "Rosalee A Clawson"
        ],
        "description": "This is a course focused on a specific current public policy topic, chosen for its contemporary political relevance, which varies from semester to semester. In general, each topic will be examined in terms of its historical roots, past policy initiatives, present policy proposals, and its enduring political and social challenges.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Environmental Politics And Public Policy",
        "subjectCode": "POL",
        "courseCode": "52300",
        "instructor": [
            "Leigh S Raymond"
        ],
        "description": "The political problems of natural resource use and environmental quality. Theoretical foundations for environmental policy and its evaluation, the political context of environmental policy, principles of administering environmental policies, and the significance of international law and institutions for environmental policies.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Political Science: Discipline And Profession",
        "subjectCode": "POL",
        "courseCode": "60000",
        "instructor": [
            "Logan R Strother"
        ],
        "description": "An exploration of the scope of political science and of its development as a profession, with a focus on what American political scientists do as disciplinary professionals. Analysis of major approaches to the study of politics and of current developments. Prerequisite: 6 credit hours in Political Science.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Proseminar In American Political Systems, Processes, And Behavior",
        "subjectCode": "POL",
        "courseCode": "61000",
        "instructor": [
            "James A Mccann"
        ],
        "description": "An introduction to American political systems, processes, and behavior as a field of graduate study with an emphasis on literature.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Media & Public Opinion",
        "subjectCode": "POL",
        "courseCode": "61100",
        "instructor": [
            "Jennifer E Hoewe"
        ],
        "description": "Topics vary. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Research Seminar In Environmental Policy",
        "subjectCode": "POL",
        "courseCode": "62300",
        "instructor": [
            "Tara Grillos"
        ],
        "description": "Investigation in depth of a substantive aspect of environmental policy or a theoretical approach to environmental policy, with emphasis on student research. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Proseminar In International Relations",
        "subjectCode": "POL",
        "courseCode": "63000",
        "instructor": [
            "Ann Marie Clark"
        ],
        "description": "An introduction to international relations as a field of graduate study with an emphasis on literature.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "IR Research Seminar",
        "subjectCode": "POL",
        "courseCode": "63100",
        "instructor": [
            "Tyler John Girard"
        ],
        "description": "Topics vary. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Comparative Research Seminar",
        "subjectCode": "POL",
        "courseCode": "64100",
        "instructor": [
            "Tyler John Girard"
        ],
        "description": "Topics vary. Prerequisite: POL 64000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Professional Development Practicum",
        "subjectCode": "POL",
        "courseCode": "68500",
        "instructor": [
            "Kyle E Haynes"
        ],
        "description": "This course examines the ethics, norms, and expectations of the profession of political science and public policy for those engaged in doctoral level study. The course explores topics of professional development to support progress in the degree and building a successful career. Permission of department required.",
        "capacity": 0,
        "credits": [
            0,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Career And Placement Practicum",
        "subjectCode": "POL",
        "courseCode": "68600",
        "instructor": [
            "Kyle E Haynes"
        ],
        "description": "Provide practical guidance and workshops to help students plan job searches, prepare application materials, and develop skills in public presentations such as video interviews, in-person interviews, job talks, teaching talks, and other public talks. Permission of department required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Dynamics Social Ecolgcl Sys",
        "subjectCode": "POL",
        "courseCode": "69300",
        "instructor": [
            "Jae Hoon David Yu"
        ],
        "description": "Topics vary - Interdisciplinary Seminar. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    }
]