[
    {
        "title": "Introductory Sociology",
        "subjectCode": "SOC",
        "courseCode": "10000",
        "instructor": [
            "Patricia A Thomas",
            "Kooi Chin Tong",
            "Brandon Jackson"
        ],
        "description": "A survey course designed to introduce the student to the scene of human society. Fundamental concepts, description, and analysis of society, culture, the socialization process, social institutions, and social change. Students of junior or senior standing should take SOC 31200, unless they are sociology or law and society majors. CTL:ISH 1060 Introduction To Sociology",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Social Problems",
        "subjectCode": "SOC",
        "courseCode": "22000",
        "instructor": [
            "Lindsay M Hamm"
        ],
        "description": "Contemporary problems at the community, society, and international levels, focusing on patterns of social organization and social change in American society, with concentration on such topics as technological militarism and war, poverty, racism, political protest, and cybernation. CTL:ISH 1061 Social Problems",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Sociology Of Aging And The Life Course",
        "subjectCode": "SOC",
        "courseCode": "27500",
        "instructor": [
            "Kenneth F Ferraro"
        ],
        "description": "An examination of research on the social context of human aging, including demographic and developmental changes. A life course perspective is emphasized for studying health, life events, and quality of life. Considers exceptional longevity in comparative perspective.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Race And Ethnicity",
        "subjectCode": "SOC",
        "courseCode": "31000",
        "instructor": [
            "Robbee Wedow",
            "Brandon Jackson"
        ],
        "description": "This course is a sociological examination and analysis of the presence and significance of race and ethnicity in our society. The purpose of this course is to provide a foundation and critical framework for assessing the origins and manifestations of race and ethnicity. Race and ethnicity have historically been one basis for differentiation and stratification in the United States and other societies, and this persists today. In this course, we will examine the emergence of race and ethnicity as concepts, and how they shape our everyday lives. We will be guided by the following questions: Why do we study race and ethnicity? How and why are they relevant in our society? How do we experience race and ethnicity, and how has this changed over time? Topics include multiculturalism and diversity; media representations; racism and discrimination; colorism; racial hierarchies; immigration; and different domains of racial inequality.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Criminology",
        "subjectCode": "SOC",
        "courseCode": "32400",
        "instructor": [
            "David R Mcelhattan"
        ],
        "description": "(CRJU 32400) Nature and cause of crime; methods of dealing with adult and juvenile offenders, consideration of present programs for the social treatment of crime in the light of needed changes.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Urban Sociology",
        "subjectCode": "SOC",
        "courseCode": "33400",
        "instructor": [
            "David A Reingold"
        ],
        "description": "Development of the city and its functions; types of social behavior in cities; influences of city life on personality; city planning.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Political Sociology",
        "subjectCode": "SOC",
        "courseCode": "33500",
        "instructor": [
            "Nicole Marie Frame"
        ],
        "description": "Analysis of the social and social psychological sources of routine political participation such as voting and interest group activity, and nonroutine political action such as protest movements and revolution; the organization of power at the community, national, and international level; and political ideology.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Sociology Of Global Development",
        "subjectCode": "SOC",
        "courseCode": "33900",
        "instructor": [
            "Christie A Sennott"
        ],
        "description": "Analysis of the causes and consequences of global development. Topics include: globalization; colonialism and decolonization; food insecurity and dependency; industrialization, poverty and inequality; migration; debt and trade; women's empowerment; global health; rights and social change; and sustainable development. This course will introduce you to the study of global development and globalization. The primary questions we will address are: What is development? What is globalization and what is its relationship with development? How have the processes of global development produced inequalities among nations, regions, races, genders, and classes? Is there a \"developing\" world and a \"developed\" world? If so, what are their differences and how do they relate with each other? How have some developing countries become more developed than others? What roles do corporations, the state, and civil society organizations play in the processes of global development? How is global development interrelated with the physical environment, inequalities of consumption, and the environmental crisis? How do people resist the inequalities and perceived injustices of global development through global social movements? How are we interconnected economically, politically, culturally, socially, and ecologically with people all over the world? What are the possible futures of development? To address these issues, our focus will be on the developing world, our scope will be global and long-term, our methodology will be historical-comparative, and our perspective will be social-scientific and critical.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "General Social Psychology",
        "subjectCode": "SOC",
        "courseCode": "34000",
        "instructor": [
            "Trenton D Mize"
        ],
        "description": "Social influences on the individual and processes of social interaction. Individual attitudes and behavior as related to socialization, social norms, social roles, communication and propaganda, and other social influences. Among the interaction processes considered are interpersonal attraction, influence, leadership, cooperation, and conflict. Not open to students with credit in PSY 24000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Sociology Of Family",
        "subjectCode": "SOC",
        "courseCode": "35000",
        "instructor": [
            "Catherine G Stepniak"
        ],
        "description": "Designed to provide an understanding of contemporary courtship, marriage, and family interaction as cultural, social, and social-psychological phenomena. Consideration of the major sources of marital strain and conflict within a heterogeneous, rapidly changing society.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Hate And Violence",
        "subjectCode": "SOC",
        "courseCode": "35600",
        "instructor": [
            "Rachel L Einwohner"
        ],
        "description": "Examines the causes of and solutions to hatred and violence. Concepts such as anti-Semitism, discrimination, hate crimes, prejudice, racism, bullying, homosexual prejudice, terrorism and other topics will be addressed. This course uses experiential activities, videos, guest speakers and classroom discussion.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Religion In America",
        "subjectCode": "SOC",
        "courseCode": "36700",
        "instructor": [
            "Daniel A Winchester"
        ],
        "description": "Examines the social dimensions of religion in American life; religion in American culture; social profiles of America's religious groups; trends in individual religious commitment; and religion's impact on American life.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Religion And Chinese Society",
        "subjectCode": "SOC",
        "courseCode": "36900",
        "instructor": [
            "Fenggang Yang"
        ],
        "description": "This course provides an overview of various religions in contemporary China, examines religiosity at the micro, meso and macro levels, and discusses the mutual impacts between religion and social, cultural and political life in Chinese societies.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Medical Sociology",
        "subjectCode": "SOC",
        "courseCode": "37400",
        "instructor": [
            "Kenneth F Ferraro"
        ],
        "description": "Medical sociology provides an overview of the social determinants of health and health disparities, the experience of illness and being a patient, the organization of the medical profession, and the health care system in the United States as well as other areas of the world.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Statistics In Sociology",
        "subjectCode": "SOC",
        "courseCode": "38200",
        "instructor": [
            "Jeremy E Reynolds",
            "Christie A Sennott"
        ],
        "description": "Introduction to the basic techniques of statistical analysis applicable to sociological data. Elementary descriptive statistics and statistical inference. Introduction to multivariate analysis.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Introduction To Research Methods In Sociology",
        "subjectCode": "SOC",
        "courseCode": "38300",
        "instructor": [
            "Rachel L Einwohner"
        ],
        "description": "Introduction to the methods of data collection and analysis and to the use of the scientific method of social research. Formulation of hypotheses and research designs for their testing. Elementary principles for the conduct of experiments, observation and interviewing, documentation, content analysis, and surveys. Relationship between social research and social theory.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Sociology Of Policing",
        "subjectCode": "SOC",
        "courseCode": "39100",
        "instructor": [
            "Leslie A Charters",
            "William M Coghill",
            "Jacqueline Louise Frost"
        ],
        "description": "Various topics in sociology that may change from semester to semester are presented by Sociology faculty members.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Sociological Theory",
        "subjectCode": "SOC",
        "courseCode": "40200",
        "instructor": [
            "Daniel V A Olson"
        ],
        "description": "An advanced critical treatment of the theories, concepts, and methods of sociology. A basic course required of undergraduate majors in sociology.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Social Inequality",
        "subjectCode": "SOC",
        "courseCode": "41100",
        "instructor": [
            "Lindsay M Hamm"
        ],
        "description": "Examination of systems of class and caste, with special attention to the United States; status, occupation, income, and other elements in stratification.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Sociology Of Law",
        "subjectCode": "SOC",
        "courseCode": "41900",
        "instructor": [
            "David R Mcelhattan"
        ],
        "description": "Provides an overview of American legal thought and legal processes. Major topics include definitions of law; anthropological studies of law; origin and development of law; jurisprudence; police behavior; lawyers and courts; deterrent and labeling effects of legal sanctions.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Field Practicum In Sociology And Law And Society",
        "subjectCode": "SOC",
        "courseCode": "42300",
        "instructor": [
            "William M Coghill"
        ],
        "description": "Field experience in criminal justice system or social services. Students serve as \"interns\" in a criminal justice or social service agency one day (or its equivalent) per week, under the supervision of agency personnel. Application of theory and empirical research findings to field problems. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Gender Roles In Modern Society",
        "subjectCode": "SOC",
        "courseCode": "45000",
        "instructor": [
            "Daniel Golbeck Rudel"
        ],
        "description": "A critical examination of the complementary roles of men and women, with particular attention to problems of role adjustment in the contemporary United States. The neofeminist movement and countermovements. Role conflicts and adjustments in such areas as family, education, employment, and the political arena.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Meth Soc Research II",
        "subjectCode": "SOC",
        "courseCode": "58100",
        "instructor": [
            "Shawn G Bauldry"
        ],
        "description": "Emphasis on statistical inference applied to sociological problems; topics include the binomial distribution and the logic of inference, one and two sample tests, confidence intervals, and chi-square. Introduction to bivariate correlation and regression, analysis of variance.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Sociology ProSeminar",
        "subjectCode": "SOC",
        "courseCode": "59100",
        "instructor": [
            "Shawn G Bauldry"
        ],
        "description": "Topics vary.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Development Of Sociological Theory",
        "subjectCode": "SOC",
        "courseCode": "60000",
        "instructor": [
            "Robin S Stryker"
        ],
        "description": "The development of sociological thought in Western Europe and subsequently in the United States from the publication of Marx's early manuscripts through the sociological writings of the 1940s.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Sociology Of Gender",
        "subjectCode": "SOC",
        "courseCode": "60900",
        "instructor": [
            "J Jill Suitor",
            "Patricia A Thomas",
            "Danielle Kane"
        ],
        "description": "Topics vary.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Social Inequality: Class, Race, And Gender",
        "subjectCode": "SOC",
        "courseCode": "61100",
        "instructor": [
            "Kevin M Stainback"
        ],
        "description": "Survey of major approaches (functional, status attainment, labor market, class, culture) to the sociological study of inequality, including qualitative and quantitative, historical and comparative studies. Students will be asked to complete a project analyzing inequality, which might provide the basis for a publishable paper. Prerequisite: Master's student standing and Sociology majors only.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Research Seminar On Aging And The Life Course",
        "subjectCode": "SOC",
        "courseCode": "67700",
        "instructor": [
            "Kenneth F Ferraro"
        ],
        "description": "An interdisciplinary seminar examining recent research on aging and the responsible conduct of research. Emphasis is given to professional development in gerontology and related fields.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Selected Problems Of Social Research",
        "subjectCode": "SOC",
        "courseCode": "68100",
        "instructor": [
            "Marcus Larson Mann",
            "Daniel A Winchester"
        ],
        "description": "Working with already available data, each student will conduct one or more research projects, including conceptualization, operational procedures, analysis of the data, and report writing. The data to be used may be from surveys, small group studies, organizational studies, or written documents. Prerequisite: SOC 60000 or 68000. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    }
]