[
    {
        "title": "Organizational Leadership Orientation",
        "subjectCode": "TLI",
        "courseCode": "10000",
        "instructor": [
            "Stephen John Elliott"
        ],
        "description": "Course is designed to help students explore issues and practices in technology-driven organizations. A \"seminar\" approach, utilizing case method is emphasized. The course orientates incoming students to Organizational Leadership. Students analyze assumptions on a variety of leadership and personal/organizational development topics. Students will explore unique options for OLS majors and determine individual requirements for completing their leadership degree by creating a personal strategic plan of study.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Foundations Of Organizational Leadership",
        "subjectCode": "TLI",
        "courseCode": "11200",
        "instructor": [
            "Melissa R Casner",
            "Joshua Adam Plaskoff"
        ],
        "description": "A survey of individual and organizational behavioral concepts and principles that provide a foundation for leadership in technology organizations. The focus will be toward the understanding of behaviors necessary for effective organizational leadership, including concepts of work in a technology-rich environment.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Business Principles For Organizational Leadership",
        "subjectCode": "TLI",
        "courseCode": "15200",
        "instructor": [
            "Alan Richard Harvath",
            "Regena L Scott"
        ],
        "description": "This course will introduce the topic of applied organization leadership in the context of working organizations. Topics include basic functions, structures, and operations of organizations, and an introduction to reading and understanding balance sheets, cash flow statements, and profit-loss statements.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Project Management",
        "subjectCode": "TLI",
        "courseCode": "21300",
        "instructor": [
            "Steven R Dunlop"
        ],
        "description": "Project management is an ad hoc technique for accomplishing specialized missions or work. Examples of projects include research and development studies, consulting projects, reorganizations efforts, implementation of total quality management, installation of new equipment, advertising campaigns, construction or other one-time efforts. This course will provide a leadership approach to project management, including team development and team selection.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Foundations Of Human Resource Development",
        "subjectCode": "TLI",
        "courseCode": "25500",
        "instructor": [
            "Andrew C Hurt"
        ],
        "description": "Much has been discussed about the importance of people in organizations, difficulties within organizations, and challenges faced by today's organizations. This course covers the field of human resource development (HRD) as an important area of practice within organizations. The course provides an introduction to HRD theories, principles, concepts, and practices. It provides foundations through the study of history, current paradigms, and perspectives on the future of the field of HRD while specifically focusing on training and development, organization development, and career development as organizational functions within HRD.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Foundations Of Integrated STEM Education",
        "subjectCode": "TLI",
        "courseCode": "26200",
        "instructor": [
            "Ralph L Rivera"
        ],
        "description": "This course provides students with a conceptual understanding of an integrated approach to teaching Science, Technology, Engineering, and Mathematics (STEM). Integrated STEM pedagogies include project/problem-based (PBL), design-based, and inquiry-based approaches to teaching. Students engage in a co-teaching model to deliver STEM instruction and observe local K-12 classrooms.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Organizational Leadership Coaching",
        "subjectCode": "TLI",
        "courseCode": "30000",
        "instructor": [
            "Regena L Scott"
        ],
        "description": "This course is designed to help students to become results oriented through coaching. The course will discuss strategies on how to unlock potential, and maximize performance through results orientation and through facilitation. Attention is directed to facilitating coaching skills, emotional intelligence, and empowerment.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Leading Innovation In Organizations",
        "subjectCode": "TLI",
        "courseCode": "31400",
        "instructor": [
            "Lisa B Bosman"
        ],
        "description": "This course provides the foundation for understanding the manner in which companies capture innovation and use it to set themselves apart from competitors. Topics covered include the attributes of organizations that are successful in fostering a culture of innovation; the characteristics and roles of leaders and members in innovative organizations; managerial processes and organizational systems that facilitate the successful development, commercialization, and adoption of innovative technologies, products, and services; and methods used to measure innovation-related outcomes.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Employment And Labor Law For The Human Resource Professionals",
        "subjectCode": "TLI",
        "courseCode": "35560",
        "instructor": [
            "Theresa Laughlin Bowers"
        ],
        "description": "This course provides a foundation for understanding the impact of labor laws and legal issues in organizations. Topics include corporate social responsibility, employment law, environmental issues, conflict resolution, and global challenges.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Job Analysis And Job Design",
        "subjectCode": "TLI",
        "courseCode": "35570",
        "instructor": [
            "Cho Hyun Park"
        ],
        "description": "This course demonstrates procedures for analyzing tasks related to specific jobs. Topics include collecting occupational data and information, the relevance of job analysis on individual and organizational performance, impact on training and development, and associated legal issues.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Teaching Design And Innovation I",
        "subjectCode": "TLI",
        "courseCode": "36700",
        "instructor": [
            "Todd R Kelley"
        ],
        "description": "This course focuses on the development of appropriate engineering design knowledge and skill required to effectively teach middle and high school engineering/technology education courses by infusing engineering design into the curriculum. Students will use 3-D solid",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Global Human Resources",
        "subjectCode": "TLI",
        "courseCode": "45570",
        "instructor": [
            "Tania M Kjerfve"
        ],
        "description": "This course prepares students to lead human resource activities within a global, technology-driven economy and business environment. Topics include recruitment, training and development processes, cultural issues, policies and regulations within a global and international context.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Human Resource Information Systems And People Analytics",
        "subjectCode": "TLI",
        "courseCode": "45580",
        "instructor": [
            "Brandon Carlyle Grant"
        ],
        "description": "This class surveys Human Resource Information Systems (HRIS) to understand how they facilitate communication processes, policy implementations and change management. Big data is transforming how firms recruit and develop talent and this course introduces concepts and methods for making better through people analytics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Leadership For Competitive Advantage",
        "subjectCode": "TLI",
        "courseCode": "45800",
        "instructor": [
            "John S Hutcheson"
        ],
        "description": "Organizations who consistently outperform competitors realize bottom-line impact through efficient leveraging of organizational strategy, leadership, internal and external talent acquisition, organizational culture, and marketing strategies. This course will explore the relationships between these areas and introduce organizational tools and concepts to enable the student to recognize and build capacity for sustainable competitive advantage in technology organizations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Teaching Design And Innovation II",
        "subjectCode": "TLI",
        "courseCode": "46000",
        "instructor": [
            "Douglas E Pruim"
        ],
        "description": "This course expands the engineering design process, incorporating rapid prototyping and other fabrication technologies to create a specified solution. The course emphasizes process flow chart planning and logistics of engineering/technology education laboratory management. Prototypes will be tested in real situations and data gathered on performance. Designs will be revised to reflect a deeper understanding of manufacturing and use, being sensitive to structure, function, and behavior from a systems-level perspective. Intellectual property, marketing, and infrastructure will be discussed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Engineering/Technology Teacher Lab Planning",
        "subjectCode": "TLI",
        "courseCode": "46100",
        "instructor": [
            "Greg J Strimel"
        ],
        "description": "This course provides future engineering/technology education teachers with information on designing, organizing, and managing engineering/technology education facilities. An in-depth study of specific laboratory requirements related to safety is covered. Management skills related to students, equipment, and supplies are addressed. Students design an engineering/technology education laboratory.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Foundations Of Innovation Studies",
        "subjectCode": "TLI",
        "courseCode": "52000",
        "instructor": [
            "Lisa B Bosman"
        ],
        "description": "Foundations Of Innovation Studies has been designed to provide a broad spectrum introduction to the field of innovation studies. Students will gain practical and theoretical knowledge of innovation at a variety of levels, including the individual, team, organizational, and ecosystem contexts. Students will examine innovation strategies and tensions within the innovation \"Triple Helix\" of industry, academia, and government through the use of case studies and individually selected research reports. Throughout the class, students will examine recent innovation efforts and present short innovation cases that align with the learning objectives of the class.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Life Of A Faculty Entrepreneur: Discovery, Delivery, Translation",
        "subjectCode": "TLI",
        "courseCode": "62600",
        "instructor": [
            "Nathalie A L Duval-Couetil"
        ],
        "description": "(ABE 62600) The course is designed to introduce graduate students and faculty mentors to the intellectual, financial, and management processes associated with translating research into tangible products through university initiated, early-stage commercialization (start-up) activities. Lectures will present case studies of technologies and pathways to commercialization. Guest speakers will illustrate the start-up process through real-world experience, and will also address approaches for managing entrepreneurial activities, intellectual property and conflicts of interest in a university environment. No course prerequisites, however students should be involved in research with commercial implications. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    }
]