[
    {
        "title": "Women's, Gender, And Sexuality Studies: An Introduction",
        "subjectCode": "WGSS",
        "courseCode": "28000",
        "instructor": [
            "Stephen K Horrocks",
            "Judy L Fisher"
        ],
        "description": "An introductory survey of the concepts and research data in the new scholarship on women. Topics covered include biology, sexuality, socialization, family and work, creativity, and politics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Comparative Studies In Gender And Culture",
        "subjectCode": "WGSS",
        "courseCode": "38000",
        "instructor": [
            "Stephen K Horrocks"
        ],
        "description": "This course expands students' understanding of gender issues by exploring the multicultural diversity of women's lives. It examines how race, class, sexuality, and culture interact and shape society and ecology in the United States and in a global context.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Women Of Color In The United States",
        "subjectCode": "WGSS",
        "courseCode": "38100",
        "instructor": [
            "Marlo Denice David"
        ],
        "description": "Explores the diversity of racial and ethnic groups in the United States with a particular emphasis on the histories, experiences, and cultural contributions of women of color. Provides a broad introduction to the intersections of gender, race and ethnicity.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Understanding The NFL",
        "subjectCode": "WGSS",
        "courseCode": "39000",
        "instructor": [
            "Cheryl A Cooky"
        ],
        "description": "Variable topics under the direction of an instructor in a particular field of specialization.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Feminist Theory",
        "subjectCode": "WGSS",
        "courseCode": "68000",
        "instructor": [
            "Patricia A Boling"
        ],
        "description": "This course focuses on feminist theories at an advanced level and in a global perspective. Graduate students engage with key theoretical issues in contemporary feminist studies, and examine how feminist scholars have theorized women and gender issues across disciplines.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    },
    {
        "title": "Gender&Culture Sci Ed",
        "subjectCode": "WGSS",
        "courseCode": "68100",
        "instructor": [
            "Brenda M Capobianco"
        ],
        "description": "Applies feminist theory, knowledge, and methods to the examination of selected contemporary issues. Emphasizes ways in which theory and practice interact in feminist scholarship. Content may vary according to the issues examined. Prerequisite: WGSS 68000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Fall 2022"
    }
]