[
    {
        "title": "Introduction To Data Analytics For Agricultural Business",
        "subjectCode": "AGEC",
        "courseCode": "20201",
        "instructor": [
            "Zachary T Neuhofer"
        ],
        "description": "Overview of data analytics in agricultural business. Students are exposed to an overview of software tools with a primary focus on Excel, introduction to relational databases, and data visualization. Focus is in using financial, accounting, and economic data to make management decisions. Laptop required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introductory Microeconomics For Food And Agribusiness",
        "subjectCode": "AGEC",
        "courseCode": "20300",
        "instructor": [
            "John G Lee"
        ],
        "description": "This course introduces the application of microeconomics as used by farms and agribusiness firms. The behavior of individual firms is evaluated as price and output are determined in various market structures (pure competition, pure monopoly, monopolistic competition, and oligopoly). Other topics include pricing and employment of resources, market failure and the social control of industry (government, economics policy, and regulation), cost and production theory.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Resource Economics And Environmental Policy",
        "subjectCode": "AGEC",
        "courseCode": "20400",
        "instructor": [
            "John G Lee"
        ],
        "description": "The course provides an overview of microeconomic theory and its application to issues related to evaluating resource economic issues and environmental policy. Topics discussed include efficiency, sustainability, valuation, externalities, governmental policies, and benefit cost analysis.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Economics",
        "subjectCode": "AGEC",
        "courseCode": "21700",
        "instructor": [
            "Leeann Elizabeth Moss"
        ],
        "description": "National economic problems such as unemployment, recessions, inflation, taxation, bank interest rates, the growth of government, monetary systems, and a rising national debt are discussed along with the principles, policies, and institutions for solving these macroeconomic problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Economics Of Agricultural Markets",
        "subjectCode": "AGEC",
        "courseCode": "22000",
        "instructor": [
            "Mindy Lyn Mallory"
        ],
        "description": "This class provides an overview of U.S. and international agricultural markets, and develops a framework for analyzing those markets. Concepts include determination of agricultural prices, spatial dimensions of agricultural markets, and trade; temporal dimensions of agricultural markets, and futures and options markets; and public policy in agricultural markets.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Economic Geography Of World Food And Resources",
        "subjectCode": "AGEC",
        "courseCode": "25000",
        "instructor": [
            "Joseph V Balagtas"
        ],
        "description": "A study of the important issues and economic decisions about worldwide resource use for food and fiber production as influenced by geography, climate, history, social institutions, national self-interest, and the environment.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Farm Organization",
        "subjectCode": "AGEC",
        "courseCode": "31000",
        "instructor": [
            "Leeann Elizabeth Moss"
        ],
        "description": "Economic factors controlling success in farming; types of farming; business records and analysis; adjustment in organization to meet changing economic conditions; organization and management of successful farms.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Principles Of Food And Agribusiness Marketing",
        "subjectCode": "AGEC",
        "courseCode": "32700",
        "instructor": [
            "Valerie Kilders"
        ],
        "description": "This course is a study of the major components of marketing decisions made by food and agribusiness firms. The course examines the marketing process, market research, marketing opportunities, and marketing strategies. Students will work on developing skills for evaluating and making marketing decisions.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Management Methods For Agricultural Business",
        "subjectCode": "AGEC",
        "courseCode": "33000",
        "instructor": [
            "Leeann Elizabeth Moss"
        ],
        "description": "Management of nonfarm, agriculturally related businesses. Topics include tools for management decision making, legal forms of business organization, basics of accounting, and important financial management techniques. Case studies and computer simulation game.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Principles Of Industrial Selling",
        "subjectCode": "AGEC",
        "courseCode": "33100",
        "instructor": [
            "Amy L Cochran"
        ],
        "description": "The principles of selling and their application to the industrial businesses. Topics include attitudes and value systems, basic behavioral patterns, the purchase decision process, relationship of sales to marketing, selling strategies, preparing for sales calls, making sales presentations, handling objections, and closing sales. Emphasis is placed on application of principles to real-world situations and on building selling skills through class projects. Requires class trips. Students will pay individual lodging or meal expenses when necessary.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Food Distribution",
        "subjectCode": "AGEC",
        "courseCode": "33300",
        "instructor": [
            "Steven Yu-Ping Wu"
        ],
        "description": "Distribution factors that affect the food industry. Particular attention to the food wholesaling and retailing sectors. Presentation of economic tools to evaluate performance in the food industry. Discussion of the relative importance of each of the major departments in the modern supermarket. Discussion of current and future industry prototypes.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Quantitative Techniques For Firm Decision Making",
        "subjectCode": "AGEC",
        "courseCode": "35200",
        "instructor": [
            "Diego Soares Cardoso"
        ],
        "description": "Introduction to mathematical programming and computing as an aid to agricultural decision making by firms, linear programming, game theory and strategy, simulation, the waiting-line problem, the equipment replacement decision, and multiproduct scheduling methods.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "The Process Of Economic Research",
        "subjectCode": "AGEC",
        "courseCode": "37500",
        "instructor": [
            "Todd Henry Kuethe"
        ],
        "description": "This course is a study of the process of conducting economic research. The course examines the research problem and objectives, literature review, conceptual framework, methods and procedures, and reporting research. Students will identify a research topic and project advisor. For Honors program students only in Agricultural Economics. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Agricultural Policy",
        "subjectCode": "AGEC",
        "courseCode": "41000",
        "instructor": [
            "Roman M Keeney"
        ],
        "description": "Economic analysis of U.S. food and agricultural policy; current and past farm legislation; international trade; agricultural policies in selected countries; domestic and foreign food assistance; structural change; agricultural research policy; macroeconomic linkages with the agricultural sector; and emerging environmental policy issues, land and water use.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Commodity Marketing",
        "subjectCode": "AGEC",
        "courseCode": "42100",
        "instructor": [
            "Mindy Lyn Mallory"
        ],
        "description": "Application of commodity marketing principles to grain, livestock, and other commodity sectors. Applications include hedging, speculation, risk management, and fundamental and technical price analysis. Examination and testing of pricing strategies and the development of commodity marketing plans.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Financial Management Of Agricultural Business",
        "subjectCode": "AGEC",
        "courseCode": "42400",
        "instructor": [
            "Hong Holly Wang"
        ],
        "description": "A study of the major types of financial decisions made by agriculturally related firms, including investment in inventory, receivables and cash, property, plant, and equipment; sources and types of short-term, intermediate, and long-term capital; legal patterns of the business organization, emphasis on implementation involving agribusiness case problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Agri-Marketing Analytics",
        "subjectCode": "AGEC",
        "courseCode": "42900",
        "instructor": [
            "Steven Yu-Ping Wu"
        ],
        "description": "This course focuses on the use of modern, data-drive analytics marketing techniques. Focuses on the analysis of marketing data and metrics to help make business decisions. A hands-on course that requires extensive use of the computer. Laptops required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Agricultural And Food Business Strategy",
        "subjectCode": "AGEC",
        "courseCode": "43000",
        "instructor": [
            "Brenna Daun Ellison"
        ],
        "description": "An advanced course in business planning and strategy for potential agribusiness and food firm managers. Focuses on development of viable business strategy in the context of the firm's market and its internal condition. Makes extensive use of case studies that document management dilemmas of agribusiness firms, ranging from those providing inputs to agricultural producers to firms involved in the retail distribution of food.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "International Agricultural Trade",
        "subjectCode": "AGEC",
        "courseCode": "45000",
        "instructor": [
            "Hans Bernhard Stefan Dalheimer"
        ],
        "description": "Study of U.S. agricultural trade with emphasis on international trade theory, exchange rates and their determination, relationships between domestic agricultural policies and trade policies, and analysis of institutional arrangements for world trade in agricultural products.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Applied Econometrics",
        "subjectCode": "AGEC",
        "courseCode": "45100",
        "instructor": [
            "Michael S Delgado"
        ],
        "description": "Application of strategies to economic problems. Simple and multiple regression, dummy variables, logit analysis, time series, and forecasting.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Academic Bowl Seminar",
        "subjectCode": "AGEC",
        "courseCode": "49800",
        "instructor": [
            "Todd Henry Kuethe",
            "Valerie Kilders"
        ],
        "description": "Open primarily to qualified seniors who want to study special problems in agricultural economics not covered in regular work. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Agricultural Finance",
        "subjectCode": "AGEC",
        "courseCode": "52400",
        "instructor": [
            "Michael R Langemeier"
        ],
        "description": "Designed to provide students the concepts and tools to apply financial management principles to farm businesses. Topics include financing alternatives, preparation and interpretation of financial statements, and capital investment analysis using discounted cash flows.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Global Change And The Challenge Of Sustainably Feeding A Growing Planet",
        "subjectCode": "AGEC",
        "courseCode": "52800",
        "instructor": [
            "Thomas W Hertel"
        ],
        "description": "This course investigates the major drivers of global agricultural and environmental change associated with the global farm and food system. This includes demography, income growth, biofuels, climate change, environmental and ecosystem services, livestock consumption, food waste and land use change. Weekly modules include a guest lecture, student led discussion of readings and discussion of lab assignments undertaken using the SIMPLE model of global agriculture, environment and food security. The class culminates with a course project which is presented to the class and written up in a term paper.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Internatl Agric Trade",
        "subjectCode": "AGEC",
        "courseCode": "59600",
        "instructor": [
            "Hans Bernhard Stefan Dalheimer"
        ],
        "description": "Study of selected current developments in agricultural economics. Topics will be announced in advance. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Preparation And Procedures For Policy Analysis",
        "subjectCode": "AGEC",
        "courseCode": "60200",
        "instructor": [
            "Todd Henry Kuethe"
        ],
        "description": "Research methods, scientific methodology, problem identification, and the nature of policy problems including economic policy readings, case studies, and practice project proposals.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Agricultural Markets And Price Analysis",
        "subjectCode": "AGEC",
        "courseCode": "60500",
        "instructor": [
            "Meilin Ma"
        ],
        "description": "Agricultural markets are multi-faceted, having been studied using a wide range of analytical tools. This graduate-level course emphasizes charactering demand and supply of agricultural markets and understanding forces that determine commodity and food prices. It also aims to cover a set of economic studies of prices and assist students in applying theoretical frameworks and time-series econometrics to empirical analysis of agricultural prices. In addition to studying prices in perfectly competitive markets, the first half of the course highlights several classic models of consumer demand and agricultural supply, prices under imperfect competition, price spreads (marketing margins), and the economics of information. The second half of the course focuses on empirical price analysis. Popular time-series econometric tools are introduced to study price relationships over space and time, price discovery mechanisms, and functions of futures markets.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Applied Microeconomic Theory",
        "subjectCode": "AGEC",
        "courseCode": "61900",
        "instructor": [
            "Jacob E Ricker-Gilbert"
        ],
        "description": "Provides students with the capability to apply microeconomic theory and econometrics to analyses of economic issues and problems. Students will work through applied producer/consumer problems to gain experience in the uses of econometric estimation. Topics include: primal-dual approaches, direct and indirect functions, flexible functional forms, static optimization, separability and aggregation, risk and expectations, dynamics and demographics. Examples are drawn from both consumer and producer applications. Prerequisite: AGEC 65100, ECON 60700.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Food System Organization And Policy",
        "subjectCode": "AGEC",
        "courseCode": "62200",
        "instructor": [
            "Meilin Ma"
        ],
        "description": "Development of framework to study food system organization and policy; survey of measurement and empirical testing problems in industrial-organization research on food-system market structure and performance; review of competition policies and evaluation of policy alternatives. Prerequisite: Graduate courses in microeconomic theory and marketing.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "The Theory And Practice Of Spatial Econometrics",
        "subjectCode": "AGEC",
        "courseCode": "63100",
        "instructor": [
            "Guy Tchuente Nguembu"
        ],
        "description": "This course deals with the analysis of spatial data and centers on both exploratory tools developed in spatial statistics and GIScience, as well as on econometric models that have been the main focus in spatial econometrics. During the course, the theoretical basis for the analysis of spatial data and spatial models will be covered. This theoretical angle will be combined with ample opportunities to acquire hands-on experience in the analysis of spatial data. To the effect, up-to-date software, such as GeoDa, R, Stata, and Matlab will be used. A good working knowledge of basic statistics and regression techniques is needed. Prior experience with GIS is helpful but not required. Prerequisites: AGEC 45100 or 65000 or ECON 67100 or STAT 41700 or STAT 51200 or STAT 51700.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Theory Of Economic Development",
        "subjectCode": "AGEC",
        "courseCode": "64300",
        "instructor": [
            "Jacob E Ricker-Gilbert"
        ],
        "description": "The economic theories behind the predominant approaches to economic development are reviewed. Both the sources of growth and problems in the development process are stressed. Emphasis is on the analysis and evolution of the models supporting the different approaches and the empirical analysis leading to changes in the paradigms. The role of agriculture in the economic development process is one of the topics. Other important issues are technological change, income distribution, structural adjustment, and the debt problem. Prerequisite: ECON 51100, 51200.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Application Of Quantitative Analysis: Econometrics I",
        "subjectCode": "AGEC",
        "courseCode": "65000",
        "instructor": [
            "Bhagyashree Katare"
        ],
        "description": "Brief presentation of probability concepts, mathematical expectation, probability density and distribution functions as background for studying principles of economic model construction. Emphasis is on econometric single equation models, principles of estimation, the general linear model, tests of hypothesis, confidence interval estimation, and special topics such as errors in the variables, multicollinearity, dummy variables, hetero-scedasticity, autocorrelation and prediction problems. Prerequisite: STAT 51100; ECON 51100 or 60700, matrix algebra.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Application Of Quantitative Analysis: Econometrics II",
        "subjectCode": "AGEC",
        "courseCode": "65100",
        "instructor": [
            "Michael S Delgado"
        ],
        "description": "Emphasis is on using advanced econometric techniques. The course covers use of computer software and interpretation and reporting of econometric results. The first part of the course includes general econometric concepts, such as least squares and maximum likelihood estimation, desirable statistical properties, assumptions of the classical linear regression model, Monte Carlo methods, nested and non-nested hypothesis tests. Later, more specialized topics are covered, including multiple equation models, simultaneous equation models, limited dependent variable models, and other topics that are deemed relevant. Prerequisite: AGEC 65000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Application Of Quantitative Analysis: Mathematical Programming",
        "subjectCode": "AGEC",
        "courseCode": "65200",
        "instructor": [
            "Diego Soares Cardoso"
        ],
        "description": "Recent literature on the theory and application of mathematical programming and agricultural modeling. Model building and analysis techniques with focus on matching solution methods to problems. Prerequisite: AGEC 55200, ECON 61200; a course in matrix algebra.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Workshop In Applied Economics",
        "subjectCode": "AGEC",
        "courseCode": "69200",
        "instructor": [
            "Joseph V Balagtas"
        ],
        "description": "A workshop on how to communicate research results in a seminar setting. Students present at least once during the course and will be present for other students' presentations. Students may present their own research, or a paper from a recent journal also is acceptable. The course is open to master's students, and one credit of this course is required of doctoral students.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    }
]