[
    {
        "title": "Communicating Across Culture",
        "subjectCode": "AGR",
        "courseCode": "20100",
        "instructor": [
            "Pamala V Morris"
        ],
        "description": "This course will provide students with an opportunity to understand their place in a multicultural, multiethnic, multinational country, the United States. It is designed to provide an academic overview of the field of multicultural education as it evolved to this day. The course will offer an introductory overview of the many differences that exist within all human beings. Because the diversity among individuals is endless, we cannot study all differences, but will study a sampling such as race, ethnicity, gender identity, age, social class, disability, learning styles, and religion/spiritual orientation. Issues of poverty, language, and social justice may also be examined in relationship to the above major areas of emphasis.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Deans Scholars Spec Tpc Class",
        "subjectCode": "AGR",
        "courseCode": "29000",
        "instructor": [
            "Elizabeth A Byers-Doten"
        ],
        "description": "Presentation of subject matter not available in other courses offered by the college. The specific topic that is offered will be indicated on the student's academic record.",
        "capacity": 0,
        "credits": [
            0,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Data Science For Agriculture",
        "subjectCode": "AGR",
        "courseCode": "33300",
        "instructor": [
            "Bruce J Erickson"
        ],
        "description": "Students will apply data processes including identifying data needs, acquiring data, assessing data quality, data wrangling, filtering, and visualization. In each of several topic areas (forestry, animal science, agronomy, food science, entomology, engineering, economics), data-driven insights and improved decision making will be the culmination of applied data skills. Students will understand data ethics and practice data management skills including the merging of disparate but related data sets.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    }
]