[
    {
        "title": "Biomolecules: Structure, Function, And Engineering Applications",
        "subjectCode": "BME",
        "courseCode": "20100",
        "instructor": [
            "Luis Solorio"
        ],
        "description": "Classes of molecules (biomolecules) such as sugars, lipids, proteins, and nucleic acids that form the cellular components of living organisms. Explores the chemistry behind the structure and function of these important classes of biological molecules. Hydrogen-bonding, hydrophobic forces, electrostatic interactions along with other weak interactions discussed with reference to their importance in biomolecular systems in an engineering context.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Bioinstrumentation And Circuit Theory",
        "subjectCode": "BME",
        "courseCode": "20700",
        "instructor": [
            "Yunjie Tong"
        ],
        "description": "Introduction of laboratory instruments used to measure physiological events. Stimulation and conduction of electric signals within the mammalian nervous system and other excitable tissues are demonstrated. Fundamental circuit elements and concepts include resistance, capacitance, inductance, op-amps, impedance, voltage, current, power, and frequency. Fundamental analog measurement concepts include adequate bandwidth and amplitude and phase linearity. An integrative design project emphasizes the practical aspects of quantitative physiological measurements. Students are introduced to programming (using Python) to deepen the understanding of the basic concepts and learn basic skills in data processing. SPICE software will be used throughout the course to design/simulate various analog circuits.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Physiological Modeling In Human Health",
        "subjectCode": "BME",
        "courseCode": "25600",
        "instructor": [
            "Charles F Babbs"
        ],
        "description": "Introduction to the physiology and medicine underlying practical problems in biomedical engineering, especially with respect to medical device development. Engineering skills taught and practiced within the context of human disease, injury, and illness on extended problem sets which include mathematical modeling and problem solving with appropriate documentation. Main physiological systems of focus are cardiovascular, pulmonary, and renal, and common afflictions thereof.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Thermodynamics In BME",
        "subjectCode": "BME",
        "courseCode": "29500",
        "instructor": [
            "Elsje Pienaar",
            "Jonathan William Cody"
        ],
        "description": "Specialized topic areas for which there are no specific courses, workshops, or individual study plans, but having sufficient interest to justify the formalized teaching of a course. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Experimental Methods In Biomechanics",
        "subjectCode": "BME",
        "courseCode": "31400",
        "instructor": [
            "Deva D Chan"
        ],
        "description": " This course focuses on the concepts and applications of mechanics, imaging, and instrumentation methods towards evaluating experimental biomechanics at multiple length scales. Core concepts include mechanics of materials, dynamics, contact theory, and the simplifying assumptions and standardizations often needed to conduct experiments on biomaterials and living systems. Experimental methods may include atomic force microscopy, digital image correlation, and motion analysis.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Foundations Of Biomedical Data Science",
        "subjectCode": "BME",
        "courseCode": "36600",
        "instructor": [
            "Leopold Noel Green"
        ],
        "description": "  This course presents foundational data science methods for analysis of complex biological datasets encountered in biomedical engineering research and applications. After a brief (1-2 weeks) introduction and review of mathematical concepts necessary for data science, the course will cover representative areas of regression, supervised machine learning, unsupervised machine learning, model evaluation, and uncertainty quantification. Assignments and exams will focus on practical examples spanning basic science, engineering, and medical applications.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Intro To Biomaterials",
        "subjectCode": "BME",
        "courseCode": "39500",
        "instructor": [
            "Taimoor Hasan Qazi"
        ],
        "description": "Specialized topic areas for which there are no specific courses, workshops, or individual study plans, but having sufficient student interest to justify the formalized teaching of a course. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Neural Engineering",
        "subjectCode": "BME",
        "courseCode": "41000",
        "instructor": [
            "Maria Cristina Makin"
        ],
        "description": "An introduction to Neural Engineering - an emerging field of developing and applying engineering solutions to research or translational problems concerning the brain. The course will cover a broad range of topics about neural sensing, modeling, stimulation, interface, and prosthetics. Course projects are drawn from real-world problems and experimental data.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Computational Mechanics In Biomedical Engineering",
        "subjectCode": "BME",
        "courseCode": "44000",
        "instructor": [
            "Tae Yoon Kim"
        ],
        "description": "Teaches modeling methods for biomedical engineering problems with focus on fluid/solid mechanics. Students are introduced to the most common numerical techniques in biomedical engineering and will learn the applications of these techniques to biomechanical problems at various length scales, such as cardiac contraction and blood flow. The first half of this course focuses on modeling based on ordinary differential equation (ODE) and partial differential equation (PDE) as well as on how we integrate these equations analytically or numerically using software packages such as MATLAB. The other half focuses on fundamentals of fluid/solid mechanics and also on the application of COMSOL or similar software to solving relevant biomechanical problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Deep Learning For Medical Imaging",
        "subjectCode": "BME",
        "courseCode": "45000",
        "instructor": [
            "Eugenio Culurciello"
        ],
        "description": "Teaches the foundation of neural network (aka Deep Learning) approaches and applications to medical imaging: or how to create computable models of biological neural systems, in particular large-scale neural networks, for processing medical images and data. Drawing inspiration from neuroscience and statistics, Deep Learning introduces the basic background on neural networks, presents computable neuron models and extends to large networks of neurons. Students study deep learning with both real and artificial neural networks, along with methods of deep learning about the environment by applying back propagation, Boltzmann machines, auto-encoders, convolutional neural networks and recurrent neural networks. Students will explore how Deep Learning is impacting our understanding of intelligence and contributing to the practical design of automatic medical imaging tools that are able to augment expert medical personnel, enhance diagnosis accuracy and speed, and lower health-care costs.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Translation Sr Design Projects",
        "subjectCode": "BME",
        "courseCode": "49500",
        "instructor": [
            "Nan King Kong",
            "Bradley S Duerstock"
        ],
        "description": "Specialized topic areas for which there are no specific courses, workshops, or individual study plans, but having sufficient student interest to justify the formalized teaching of a course. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Regulatory Issues Surrounding Approval Of Biomedical Devices",
        "subjectCode": "BME",
        "courseCode": "56200",
        "instructor": [
            "Aaron Edward Lottes"
        ],
        "description": "Medical devices are developed, manufactured, and distributed in a highly-regulated environment. This course primarily concerns the processes for obtaining FDA marketing approval or clearance for biomedical devices. Prior to marketing a medical device in the US, a specific governmental approval or clearance is required depending on the type of device and the risk associated with the device. This course is part of a three-course series dealing with various aspects of regulatory science. Regulatory processes for class I, II, and III devices, including combination devices, are covered with specific focus on 510(k) and PMA requirements. Approval requirements in the EU, Japan and other countries will also be briefly considered. Throughout the course, emphasis will be placed on regulatory science, regulatory strategy and principles of interacting with regulatory agencies.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Ethical Engineering Of Medical Technologies",
        "subjectCode": "BME",
        "courseCode": "56400",
        "instructor": [
            "Andrew O Brightman"
        ],
        "description": "This course examines many of the ethical challenges surrounding the design, development, and deployment of medical technologies. Issues will be analyzed from multiple frameworks and perspectives including industry, government, and society. Students will learn and practice identification and analysis of ethical issues. They will develop empathic and decision-making skills designed to prepare them as engineers to deal productively and ethically with issues in professional practice.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Bio-Micro-Electro-Mechanical Systems (BioMEMS) & Biomedical Microsystems",
        "subjectCode": "BME",
        "courseCode": "58100",
        "instructor": [
            "Chi Hwan Lee"
        ],
        "description": "This course covers key topics in bio-micro-electro-mechanical systems (BioMEMS) and micro-integrated systems. Properties of useful materials will be discussed in context to BioMEMS. Micro-electronics process modules used in the design and fabrication of BioMEMS and micro-integrated systems will be presented. Applications of these systems in a variety of medical practices will be discussed in detail.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Bioelectronics",
        "subjectCode": "BME",
        "courseCode": "59500",
        "instructor": [
            "Hyowon Lee",
            "Fang Huang",
            "Steven Rudolf Steinhubl",
            "Sunghee Park",
            "Krishna Jayant"
        ],
        "description": "This course is designed primarily for specialized topic areas for which there is no specific course, workshop, or individual study plan, but having enough student interest to justify the formalized teaching of a course. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Deep Learning",
        "subjectCode": "BME",
        "courseCode": "64600",
        "instructor": [
            "Charles A Bouman"
        ],
        "description": "This course teaches the theory and practice of deep neural networks from basic principles through state-of-the-art methods. The class blends hands-on programming, using a variety of state-of-the-art programming frameworks, with theoretical treatment based on current literature. Implementation will emphasize the use of the Pytorch language and the use of dynamic computational graphs. Some previous experience with optimization techniques is important for success in the course.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Polymers In Biomedical And Pharmaceutical Systems",
        "subjectCode": "BME",
        "courseCode": "68300",
        "instructor": [
            "Kinam Park"
        ],
        "description": "This course is designed to provide backgrounds in basic polymer chemistry, synthesis, characterization, solution properties, and recent advances in polymers for applications in drug delivery, biomedical devices, tissue engineering, biotechnology, and nanotechnology.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Seminar In Biomedical Engineering",
        "subjectCode": "BME",
        "courseCode": "69000",
        "instructor": [
            "Young L Kim"
        ],
        "description": "Seminar course covering a broad range of current research topics spanning Biomedical Engineering. Seminar presentations by representatives from industry and faculty from Purdue University and other external institutions. Required of Biomedical Engineering graduate students at Purdue; M.S. and Ph.D. students must complete two and four semesters (respectively) prior to graduation.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Spring 2024"
    }
]