[
    {
        "title": "Cooperative Seminar I",
        "subjectCode": "CHE",
        "courseCode": "20100",
        "instructor": [
            "Gabriela Nagy"
        ],
        "description": "Lectures by faculty and students on subjects that relate the academic work and the industrial experience. Written reports on the industrial experience are required and will include a documentation of the student's success in finding application of specified academic activities.   For students returning from the first and second work periods.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Chemical Engineering Calculations",
        "subjectCode": "CHE",
        "courseCode": "20500",
        "instructor": [
            "Stephen P Beaudoin"
        ],
        "description": "Quantitative applications of steady-state mass and energy balances to solve problems involving multi-component systems  and multi-unit chemical processes. Single-component and multi-component phase equilibria, single-reaction and multiple-reaction stoichiometry, coupled mass and energy balances, chemical processes involving bypass and recycle streams.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introductory Chemical Engineering Thermodynamics",
        "subjectCode": "CHE",
        "courseCode": "21100",
        "instructor": [
            "Jeffrey P Greeley"
        ],
        "description": "Basic principles and concepts of thermodynamics applied to chemical engineering problems; use of basic thermodynamic functions of enthalpy, entropy, free energy to solutions, phase equilibria, and chemical equilibria; thermodynamic processes and efficiencies; equations of state; and relation of macroscopic to molecular properties.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Chemical Engineering Seminar",
        "subjectCode": "CHE",
        "courseCode": "30000",
        "instructor": [
            "Gabriela Nagy"
        ],
        "description": "Continuation of CHE 20000. Lectures to acquaint the junior students with professional ethics, career choices, including graduate studies, and services of professional societies.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Cooperative Seminar II",
        "subjectCode": "CHE",
        "courseCode": "30100",
        "instructor": [
            "Gabriela Nagy"
        ],
        "description": "Continuation of CHE 20100. For students returning from the third and fourth work periods.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Design Of Staged Separation Processes",
        "subjectCode": "CHE",
        "courseCode": "30600",
        "instructor": [
            "Enrico Martinez Sainz"
        ],
        "description": "The application of equilibria and mass and energy balances for the design of staged separation processes. Use of various equilibrium data and thermodynamic principles for the design of batch and continuous distillation, absorption, stripping, and extraction systems. Stagewise calculations and graphical methods for design of binary systems. Design of multicomponent separators. Determination of stage efficiency and column size.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Statistical Modeling And Quality Enhancement",
        "subjectCode": "CHE",
        "courseCode": "32000",
        "instructor": [
            "Kendall T Thomson"
        ],
        "description": "Statistical modeling methods, design of experiments, error analysis, curve fitting and regression, analysis of variance, confidence intervals, quality control and enhancement: emphasizes preparation for designing chemical engineering laboratory experiments and analyzing data.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Chemical Reaction Engineering",
        "subjectCode": "CHE",
        "courseCode": "34800",
        "instructor": [
            "Rajamani P Gounder"
        ],
        "description": "Application of kinetic rate equations, mass balances and energy balances to the analysis and design of chemical reactors involving homogeneous and heterogeneous chemical reactions. Chemical equilibria, kinetic rate equations for homogeneous and heterogeneously catalyzed reactions, design of ideal isothermal reactors, effects of non-isothermal operation, effects of diffusion in porous catalysts and non-ideal mixing in continuous flow reactors.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Momentum Transfer",
        "subjectCode": "CHE",
        "courseCode": "37700",
        "instructor": [
            "Michael T Harris"
        ],
        "description": "Differential (microscopic) and integral (macroscopic) mass, momentum, and energy balances. Newtonian and non-Newtonian fluids. Fluid statics. One-dimensional steady and transient laminar flows. Turbulence. Dimensional analysis and similarity. Friction factors and drag coefficients. Applications to engineering analysis of practical problems. Introduction to numerical analysis and visualization of flows.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Heat And Mass Transfer",
        "subjectCode": "CHE",
        "courseCode": "37800",
        "instructor": [
            "David S Corti"
        ],
        "description": "Macroscopic and differential energy balances. Heat transfer coefficients for free and forced convection and phase change. Conductive and radiative heat transfer. Applications to heat transfer equipment design and compressible fluid flow. Macroscopic and differential species balances. Mass transfer coefficients and analogies. Mass transfer with and without chemical reaction. Mass transfer equipment design.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Chemical Engineering Laboratory",
        "subjectCode": "CHE",
        "courseCode": "43500",
        "instructor": [
            "Enrico Martinez Sainz"
        ],
        "description": "Quantitative experimental study of projects involving problems in fluid mechanics and heat and mass transfer or operation and evaluation of equipment; projects include analysis and data-based design of operations involving mass transfer such as distillation, absorption, drying, humidification, etc.; study of rates and equilibria in simple chemical reaction systems; study of chemical processes; application of methods of data analysis in practice; some library work; emphasis on group work, report writing, and oral communication.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Chemistry And Engineering Of High Polymers",
        "subjectCode": "CHE",
        "courseCode": "44200",
        "instructor": [
            "James M Caruthers"
        ],
        "description": "Introduction to basic principles of polymer engineering, including the chemical structure and use of a variety of industrial polymers, polymerization mechanisms and kinetics, techniques for molecular and morphological characterization, polymer processing, and a variety of engineering properties.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Design And Analysis Of Processing Systems",
        "subjectCode": "CHE",
        "courseCode": "45000",
        "instructor": [
            "Jeffrey J Siirola"
        ],
        "description": "Use of process synthesis methods and concepts; detailed design of unit operation equipment, the economics of chemical plants and flow sheet optimization methods. Synthesize, develop, and evaluate a preliminary design of a chemical process that meets market requirements for a specific product. Analysis of design alternatives using case studies and optimization methods.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Transport Phenomena",
        "subjectCode": "CHE",
        "courseCode": "54000",
        "instructor": [
            "Vivek Narsimhan"
        ],
        "description": "Continuation of CHE 37700 and 37800. Topics in fluid mechanics, heat transfer and mass transfer including unsteady state transport problems, stream functions, potential flow, hydrodynamic and thermal layers, turbulence, and multicomponent diffusion.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Industrial Chemical Technology",
        "subjectCode": "CHE",
        "courseCode": "59700",
        "instructor": [
            "Jeffrey J Siirola",
            "Can Li",
            "Michelle N Chutka",
            "Jeffrey T Miller",
            "William R Clark",
            "Brian Michael Tackett",
            "Rakesh Agrawal"
        ],
        "description": "Hours and credits to be arranged. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            18
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Approaches To Graduate Research In Chemical Engineering",
        "subjectCode": "CHE",
        "courseCode": "60000",
        "instructor": [
            "John A Morgan"
        ],
        "description": "This course is designed to prepare and enable students to make a rapid start on their research. Additionally, key skills in critical analysis of the literature, technical writing and delivery of oral presentations are included.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Chemical Reaction Engineering",
        "subjectCode": "CHE",
        "courseCode": "66000",
        "instructor": [
            "Doraiswami Ramkrishna"
        ],
        "description": "Heat, mass, and momentum transfer in the design and analysis of chemical reactor systems. Optimization techniques applied to reactor design. Prerequisite: CHE 34800.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Colloidal And Interfacial Phenomena",
        "subjectCode": "CHE",
        "courseCode": "66800",
        "instructor": [
            "You-Yeon Won"
        ],
        "description": "Preparation, characterization, and stability of emulsions, aerosols, and other multiphase dispersions. Interparticle forces, electrokinetics, thermodynamics and kinetics of coagulation. Techniques for determining size, shape, orientation, and charge of particles. Capillary and wetting phenomena. Thermodynamics of interfacial tension and adsorption. Applications to surfactants, polymers, biodispersions, flotation, separations, oil recovery, etc. Offered in alternate years.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Educational Methods In Engineering",
        "subjectCode": "CHE",
        "courseCode": "68500",
        "instructor": [
            "Syed Ahmad Helmi Bin Syed Hassan"
        ],
        "description": "(ENE 68500)  Students will learn how to teach in an engineering environment where both classroom and laboratory instruction is intertwined. Classroom techniques, such as lectures, cooperative groups, mastery and PSI, TV and video, and guided design will be studied, in addition to class preparation issues, such as ABET accreditation and design content. Students will study motivation, learning theories and cycles, and personality types. Includes teaching practice and group projects. Permission of Instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Seminar In Chemical Engineering",
        "subjectCode": "CHE",
        "courseCode": "69000",
        "instructor": [
            "Beverly J Johnson"
        ],
        "description": "Required of all graduate students.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Chem Engr Teaching Experience",
        "subjectCode": "CHE",
        "courseCode": "69700",
        "instructor": [
            "Kendall T Thomson"
        ],
        "description": "Topics vary. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            18
        ],
        "term": "Spring 2024"
    }
]