[
    {
        "title": "General Chemistry",
        "subjectCode": "CHM",
        "courseCode": "11100",
        "instructor": [
            "Gudrun Schmidt"
        ],
        "description": "Not available for credit toward graduation in the School of Science. Required of all freshmen in the School of Agriculture who are not in CHM 11500 and required of students in the School of Consumer and Family Sciences in retailing, textile, RHIT, and dietetics options who are not in CHM 11500. Required of students in physical therapy who are not in CHM 11500. Not available for credit toward graduation in the School of Science. Metric and S.I. Units; dimensional analysis; density; the atomic concept; elements, compounds, and mixtures; the mole concept; equations and stoichiometry; atomic structure, spectra; the periodic table; chemical bonding, gases; descriptive chemistry of the common elements.  Prerequisite: two years of high school algebra. CTL:IPS 1721 General Chemistry I w/lab",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "General Chemistry",
        "subjectCode": "CHM",
        "courseCode": "11200",
        "instructor": [
            "Cynthia A Harwood"
        ],
        "description": "Continuation of CHM 11100. Liquids and solids; solutions; chemical kinetics; equilibrium; acids and bases; oxidation and reduction; electrochemistry; descriptive chemistry of the metals and nonmetals; introduction to organic chemistry; nuclear chemistry. Not available for credit toward graduation in the School of Science.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "General Chemistry",
        "subjectCode": "CHM",
        "courseCode": "11500",
        "instructor": [
            "Leah Marie Everly"
        ],
        "description": "Stoichiometry; atomic structure; periodic properties; ionic and covalent bonding; molecular geometry; gases, liquids, and solids; crystal structure; thermochemistry; descriptive chemistry of metals and non-metals. Required of students majoring in science and students in engineering who are not in CHM 12300. One year of high school chemistry or one semester of college chemistry required. CTL:IPS 1721 General Chemistry I w/lab",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "General Chemistry",
        "subjectCode": "CHM",
        "courseCode": "11600",
        "instructor": [
            "Marybeth S Miller"
        ],
        "description": "A continuation of CHM 11500. Solutions; quantitative equilibria in aqueous solution; introductory thermodynamics; oxidation-reduction and electrochemistry; chemical kinetics; qualitative analysis; further descriptive chemistry of metals and nonmetals. CTL:IPS 1722 General Chemistry II w/lab",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Chemistry II",
        "subjectCode": "CHM",
        "courseCode": "12600",
        "instructor": [
            "Jonathan C Rienstra-Kiracofe"
        ],
        "description": "A continuation of CHM 12500. Properties of solutions; chemical equilibrium calculations; elementary thermodynamics; oxidation-reduction reactions and electrochemical cells; rates of reaction; qualitative analysis; descriptive chemistry.",
        "capacity": 0,
        "credits": [
            5,
            5
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Organic Chemistry For The Life Sciences I",
        "subjectCode": "CHM",
        "courseCode": "25500",
        "instructor": [
            "TBA"
        ],
        "description": "A study of aliphatic and aromatic hydrocarbons and their simple derivatives in terms of (a) structure, bonding, etc.; (b) general syntheses and reactions; and (c) a logical modern rationale for fundamental phenomena as supported by reactivity orders, orientation effects, stereochemistry, and relative rates. Recommended for biology majors.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Organic Chemistry For The Life Sciences II",
        "subjectCode": "CHM",
        "courseCode": "25600",
        "instructor": [
            "TBA"
        ],
        "description": "A continuation of CHM 25500 with various functional groups such as the carboxyl, amino, etc., and including such polyfunctional natural products as carbohydrates and peptides.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Organic Chemistry",
        "subjectCode": "CHM",
        "courseCode": "25700",
        "instructor": [
            "Chengde Mao"
        ],
        "description": "Introductory organic chemistry. Emphasis is on structure, nomenclature, reactions, and theory as applied to simple organic compounds. This course is designed for students who require a one semester overview in preparation for biochemistry. Not recommended for majors in the College of Science. Both CHM 25700 + 25701 = CTL:IPS 1723 Organic And Biochemistry w/lab.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Organic Chemistry II",
        "subjectCode": "CHM",
        "courseCode": "26200",
        "instructor": [
            "Paul G Wenthold"
        ],
        "description": "A continuation of CHM 26100, but a broader scope. The chemistry of a variety of functional groups is discussed. Theory is employed extensively to demonstrate the coherence underlying seemingly diverse transformations. Qualitative organic analysis is introduced, with particular emphasis on spectroscopic methods.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Organic Chemistry II",
        "subjectCode": "CHM",
        "courseCode": "26605",
        "instructor": [
            "Ming-Yu Ngai"
        ],
        "description": "A continuation of CHM 26505, but a broader scope.  The chemistry of a variety of functional groups is discussed. Theory is employed extensively to demonstrate the coherence underlying seemingly diverse transformations. Qualitative organic analysis is introduced, with particular emphasis on spectroscopic methods.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Quantitative Analysis",
        "subjectCode": "CHM",
        "courseCode": "29000",
        "instructor": [
            "Jeffrey Edward Dick"
        ],
        "description": "Topics vary. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Biochemistry: A Molecular Approach",
        "subjectCode": "CHM",
        "courseCode": "33900",
        "instructor": [
            "Angeline M Lyon"
        ],
        "description": "This is a comprehensive one-semester biochemistry course that emphasizes molecules and molecular reaction mechanisms, building upon the principles conveyed in general chemistry and organic chemistry. This course is designed to cover the essential elements of biochemistry traditionally covered in a two semester series. Topics to be covered include: Amino acids, peptides and proteins, molecular models and structure-function relationships, enzymes, enzyme kinetics and enzyme mechanisms, carbohydrates and carbohydrate metabolism, aerobic metabolism, lipids and membranes, lipid metabolism, nitrogen metabolism and integration and regulation of metabolism. Special emphasis will be placed on connections between biochemical principles and the fields of medicine, human health and disease, nutrition and biotechnology. This course should serve as excellent preparation for higher-level biochemistry courses as well as standardized pre-health professional exams. CHM 33900 was designed as the 4th semester of the 1-2-1 competency-based curriculum transformation in chemistry as it applies to pre-health professional and life science students at Purdue. However, this course is open to other students who meet the prerequisites.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Inorganic Chemistry",
        "subjectCode": "CHM",
        "courseCode": "34200",
        "instructor": [
            "Jonathan J Wilker"
        ],
        "description": "Interpretation and correlation of the reactions and properties of inorganic compounds in terms of their electronic and molecular structures. A survey of the preparations and reactivities of important compounds of the representative elements, with an emphasis on group trends. The elementary chemistry of the transition metals, including magnetic and spectral properties of coordination compounds.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Topics In Physical Chemistry",
        "subjectCode": "CHM",
        "courseCode": "37000",
        "instructor": [
            "Sabre Kais"
        ],
        "description": "Kinetic theory of gases; statistical thermodynamics; quantum mechanics; atomic and molecular structure and spectroscopy; properties of ionic phases. May not be used to satisfy requirements for graduation in chemistry.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Physical Chemistry",
        "subjectCode": "CHM",
        "courseCode": "37200",
        "instructor": [
            "Shalini T Low-Nam"
        ],
        "description": "Principles of physical chemistry with emphasis on chemical thermodynamics and kinetics, illustrated examples from the biological sciences. Intended primarily for students in the life sciences. Other topics include physical and chemical equilibria, quantum mechanics, and spectroscopy.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Physical Chemistry II",
        "subjectCode": "CHM",
        "courseCode": "37400",
        "instructor": [
            "Hanzhe Liu"
        ],
        "description": "Physical chemistry of molecules. Wave properties of matter; quantum mechanics of translation, rotation, and vibration; atomic structure; molecular orbitals; quantum states; statistical mechanics; chemical kinetics; collision theory; transition state theory.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Analytical Chemistry II",
        "subjectCode": "CHM",
        "courseCode": "42400",
        "instructor": [
            "Chi Zhang"
        ],
        "description": "Principles and application of optical and electrical methods of chemical analysis, including topics in instrumentation.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Molecular Biotechnology",
        "subjectCode": "CHM",
        "courseCode": "43800",
        "instructor": [
            "Shiliang Tian"
        ],
        "description": "An examination of modern tools for the characterization, manipulation, and design of nucleic acids and proteins. Topics include DNA technology, recombinant proteins, bioinformatics, genetic modifications, gene expression and the interactions between nucleic acids and proteins.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Intermediate Organic Chemistry",
        "subjectCode": "CHM",
        "courseCode": "46200",
        "instructor": [
            "Hilkka I Kenttamaa"
        ],
        "description": "Theory and application of organic chemistry and reaction mechanisms to organic synthesis and contemporary research topics in closely related areas. Topics include stereochemistry, reactive organic intermediates, molecular orbital theory, photochemistry, organic materials chemistry, and chemical biology.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "The Nuclear Age",
        "subjectCode": "CHM",
        "courseCode": "49000",
        "instructor": [
            "Jonathan C Rienstra-Kiracofe"
        ],
        "description": "Topics vary.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Junior-Senior Chemistry Seminar",
        "subjectCode": "CHM",
        "courseCode": "49400",
        "instructor": [
            "Paul G Wenthold"
        ],
        "description": "Major emphasis on developing skills in oral and written presentations by students. The subject matter can be library material and/or accomplishments in undergraduate or co-op research. Department permission required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Chemical Literature",
        "subjectCode": "CHM",
        "courseCode": "51300",
        "instructor": [
            "David A Zwicky"
        ],
        "description": "Types of information in technical publications; exercises in finding, assembling, and using such data.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Computational Chemistry",
        "subjectCode": "CHM",
        "courseCode": "57900",
        "instructor": [
            "Gaurav Chopra"
        ],
        "description": "Theoretical basis and practical applications of computational methods relevant to chemical and biochemical research problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Analytical Chemistry",
        "subjectCode": "CHM",
        "courseCode": "62100",
        "instructor": [
            "Garth J Simpson"
        ],
        "description": "A critical survey of recent developments in chemical and instrumental methods of analysis. Prerequisite: CHM 32100, 42400.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Particle Spectroscopy",
        "subjectCode": "CHM",
        "courseCode": "62400",
        "instructor": [
            "Scott A Mcluckey"
        ],
        "description": "Introduction to the application of ion and electron beams in the chemical analysis of gases and of surfaces. Emphasis is on the unity of the phenomena that underlie the preparation, manipulation, and analysis of ion and electron beams and on the analogies between inelastic reactions of ions and electrons, including those with both gaseous and solid targets. Mass spectrometry is covered in some depth, and a number of newer aspects of particle spectroscopy are treated, including ion scattering spectrometry, Rutherford scattering, energy loss spectrometry (ion and electron), ion kinetic energy spectrometry, ion cyclotron resonance and Auger spectrometry. Applications of these techniques feature structural analysis (compositions of mixtures, molecular structure of organics, electronic state assignment in simple ions), chemical preparations (ion implantation), and isotopic analysis. The underlying chemistry is explored, particularly in considering the kinetics and dynamics of unimolecular fragmentation and in terms of the factors that affect the cross-sections of inelastic collisions. Offered in alternate years. Prerequisite: CHM 42400.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Biochemistry: Dynamic Aspects",
        "subjectCode": "CHM",
        "courseCode": "63500",
        "instructor": [
            "Kavita Shah"
        ],
        "description": "Enzymes, metabolism, and protein and nucleic acid biosynthesis. Prerequisite: CHM 63400.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Biophysical Chemistry",
        "subjectCode": "CHM",
        "courseCode": "63800",
        "instructor": [
            "Chittaranjan Das"
        ],
        "description": "Applications of the principles and methods of physical chemistry in biochemistry with emphasis on the behavior of macromolecules in solution. Protein engineering. Offered in alternate years. Prerequisite: CHM 57800, 63400.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Inorganic Chemistry",
        "subjectCode": "CHM",
        "courseCode": "64200",
        "instructor": [
            "Tong Ren"
        ],
        "description": "Physical inorganic chemistry. Applications of group theory to chemistry and spectroscopy, especially vibrational and electronic spectra of transition metal complexes. Molecular orbital theory and theoretical bases for reactivity. Magnetic properties and electron paramagnetic resonance (EPR) spectroscopy of inorganic materials. Prerequisite: CHM 34200.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Transition Metal And Organometallic Chemistry",
        "subjectCode": "CHM",
        "courseCode": "64700",
        "instructor": [
            "TBA"
        ],
        "description": "A study of the chemistry and physical properties of compounds of the transition metals. Halides, oxides, and oxy-salts; transition metal carbonyls and derivatives; pi-bonded organometallic compounds; catalysis; spectral and magnetic properties of compounds. Prerequisite: CHM 64100.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Synthetic Organic Chemistry",
        "subjectCode": "CHM",
        "courseCode": "65200",
        "instructor": [
            "Abram J Axelrod"
        ],
        "description": "An advanced treatment of methods for preparing major types of organic functionalities and bonds, stressing stereochemical control and involving mechanisms for understanding the reactions employed. Prerequisite: CHM 65100.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Quantum Chemistry",
        "subjectCode": "CHM",
        "courseCode": "67200",
        "instructor": [
            "Valentin Walther"
        ],
        "description": "Basic principles of classical and quantum mechanics, exact solutions for simple systems, approximation methods, atomic structure, spectroscopy, application of group theory, theory of molecular binding. Prerequisite: CHM 67100.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Computational Quantum Chemistry",
        "subjectCode": "CHM",
        "courseCode": "67300",
        "instructor": [
            "Lyudmila V Slipchenko"
        ],
        "description": "Semiempirical and molecular-mechanics treatments of large molecules, ab initio methods, modern density functional theory, Green's functions, multichannel quantum defect theory, global optimization methods. Prerequisite: CHM 67100.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Sem Anlytcl Chem",
        "subjectCode": "CHM",
        "courseCode": "69500",
        "instructor": [
            "Chi Zhang",
            "Jonathan D Hood",
            "Christina W Li",
            "Shalini T Low-Nam",
            "Paul G Wenthold",
            "Shiliang Tian"
        ],
        "description": "Groups meeting for review and discussion of important current literature in analytical, biological, inorganic, organic, and physical chemistry. Each graduate student is required to attend the seminar of his or her major subject.",
        "capacity": 0,
        "credits": [
            0,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "X-Ray Crystallography",
        "subjectCode": "CHM",
        "courseCode": "69600",
        "instructor": [
            "Bryon Shane Drown",
            "Jonathan D Hood",
            "Jonathan Patrick Schlebach",
            "Weiguo Andy Tao",
            "Matthias Zeller",
            "Alexander Laskin",
            "Adam Wasserman"
        ],
        "description": "Lectures on selected topics of current interest.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    }
]