[
    {
        "title": "Data Acquisition And Systems Control",
        "subjectCode": "ECET",
        "courseCode": "17700",
        "instructor": [
            "April Cheung",
            "Shawn Richard Oltz",
            "Matthew J Turner",
            "Keenan Arthur Estese",
            "John R Ulrich"
        ],
        "description": "Fundamental electrical parameters and measurement techniques are introduced. These are then applied to implementing power interfaces, actuators and sensors. Modules that provide signal conditioning, data conversion, filtering and controllers are evaluated. A full, closed loop control system is built and evaluated.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Digital Systems",
        "subjectCode": "ECET",
        "courseCode": "17900",
        "instructor": [
            "Michael Franklin Passwater",
            "Mark T Carnes",
            "Thomas M Lucas",
            "John R Ulrich",
            "Jeffrey J Richardson"
        ],
        "description": "This course introduces computing systems and defines the major classes of computing devices. Sequential and concurrent operations, along with logic and control structures, are covered. Knowledge of fundamental computing principles is discovered. Common software tools are used to create, test, and debug systems. Systems are constructed from standard blocks with a focus on subsystem operation and performance, troubleshooting/debugging and testing. Common applications of embedded systems are introduced.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Electronic Systems",
        "subjectCode": "ECET",
        "courseCode": "22400",
        "instructor": [
            "Zachary Schreiber"
        ],
        "description": "This course is a survey of key electrical and electronics systems, their basic performance and applications. DC fundamentals include sources, resistance, Ohm's and Kirchhoff's Laws with simple circuits. AC systems include transformers and reactive elements, power production and distribution, filtering, motors and relays. Computer systems are presented with a microprocessor and provide the ability to write and read both digital and analog data. Analog systems include diodes, transistors, IC amplifiers, and analog-digital and digital to analog conversions. The semester closes by combining all of the topics presented in the control of motor speed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "DC And Pulse Electronics",
        "subjectCode": "ECET",
        "courseCode": "22700",
        "instructor": [
            "Robert A Nawrocki"
        ],
        "description": "Capacitors, inductors, oscillators, rectifiers, bipolar and MOSFET power switches, switching power supplies, half-and full-H bridges, switching audio power amplifiers, and linear regulators are studied. Computer-aided analysis of circuits is utilized.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Concurrent Digital Systems",
        "subjectCode": "ECET",
        "courseCode": "22900",
        "instructor": [
            "Miad Faezipour"
        ],
        "description": "This course establishes a foundation for concurrent digital systems. Common methods of describing digital circuit operation are studied along with the techniques for translation between any two methods. Basic building blocks of digital systems are defined and applied. Analysis techniques for combinational and sequential logic circuits or subsystems are covered. Computer-based development tools, programmable logic devices, and technical reference sources are used to build, test, and evaluate digital systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Electronics Prototype Development And Construction",
        "subjectCode": "ECET",
        "courseCode": "27000",
        "instructor": [
            "Nghia T Le",
            "Mark T Carnes",
            "Michael Franklin Passwater",
            "Jeffrey J Richardson"
        ],
        "description": "This course introduces project planning and basic concepts in electronic design automation (EDA). The student develops a portion of an electronic system by utilization of EDA, design for testing, design for manufacturability (DFM), and component selection techniques. New construction methods and testing techniques are introduced.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Wireless Communications",
        "subjectCode": "ECET",
        "courseCode": "27400",
        "instructor": [
            "Michael Franklin Passwater",
            "Keenan Arthur Estese",
            "Rajeswari Sundararajan",
            "Thomas M Lucas"
        ],
        "description": "The theory and techniques of wirelessly sending information (voice, music, data) from one location to another is studies from a systems point of view. This includes a signal analysis, modulation techniques, transmitters, receivers, low noise amplifiers, and filters in the RF frequency spectrum. In addition, special topics of current interest are introduced. This course incorporated a student-based communication design and analysis laboratory.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "AC And Power Electronics",
        "subjectCode": "ECET",
        "courseCode": "27700",
        "instructor": [
            "Nghia T Le"
        ],
        "description": "AC Circuits including the j operator, phasors, reactance and impedance are studies. Circuit laws, network theorems, and the application of circuit analysis techniques to amplifiers used in power electronics, including power MOS devices, thyristors, and other appropriate applications. Computer-aided analysis of circuits is used.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Embedded Digital Systems",
        "subjectCode": "ECET",
        "courseCode": "27900",
        "instructor": [
            "Rashmi Bahuguna Deodeshmukh",
            "April Cheung",
            "Michael Franklin Passwater",
            "Mark T Carnes",
            "Thomas M Lucas"
        ],
        "description": "A course emphasizing the advanced applications of embedded digital systems. Topics include embedded system architecture, use of advanced programmable counter/timer arrays, analog interfaces, serial communication, and interrupts.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Industrial Controls",
        "subjectCode": "ECET",
        "courseCode": "30201",
        "instructor": [
            "Rashmi Bahuguna Deodeshmukh",
            "Shawn Richard Oltz",
            "Grant P Richards"
        ],
        "description": "This course examines the concepts, devices and common practices associated with control systems with a primary focus on industrial implementations. Additionally, the course provides a hierarchical examination of the implantation of control theory. Programmable logic controllers serve as the primary platform for presenting applications in interfacing and control of electromechanical and pneumatic devices. Electrical industrial safety standards are presented and emphasized throughout the course.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Foundations Of Audio Electronics",
        "subjectCode": "ECET",
        "courseCode": "31800",
        "instructor": [
            "James Michael Jacob"
        ],
        "description": "The design, fabrication, and testing of the electronics that comprise audio signal transduction, transmission, processing, amplification and delivery to a loudspeaker are studied at an introductory level. Computer-aided analysis of circuits is used.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Electric Vehicle Systems",
        "subjectCode": "ECET",
        "courseCode": "32300",
        "instructor": [
            "Keenan Arthur Estese"
        ],
        "description": "The course is an introduction to electric vehicle (EV) technology analysis and configuration. The course explores the integrated mechanical and electrical power and control systems including the management of integrated power and control systems within an electric vehicle. Students perform detailed analysis of and develop design approaches for electrically powered vehicles.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Instrumentation And Data Acquisition Design",
        "subjectCode": "ECET",
        "courseCode": "32700",
        "instructor": [
            "Rashmi Bahuguna Deodeshmukh",
            "John R Ulrich",
            "Matthew J Turner"
        ],
        "description": "This course builds upon the prerequisite knowledge and covers implementation of electric systems to measure and record mechanical, electrical, and biological parameters. Signal characteristics, transducer specification and selection, signal conditioning and transmission design, data conversion, software, and an overall system error budget are developed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Embedded Digital Systems",
        "subjectCode": "ECET",
        "courseCode": "32900",
        "instructor": [
            "Suranjan Panigrahi"
        ],
        "description": "This course focuses on the study and application of real-time embedded systems.  Real-time operating systems (RTOS) are introduced and applied. Students learn and use programming and scripting languages to discover the advantages and limitations of RTOS application in the lab.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Power Electronics In Energy Systems",
        "subjectCode": "ECET",
        "courseCode": "33300",
        "instructor": [
            "Shawn Richard Oltz",
            "Mark T Carnes"
        ],
        "description": "A study of fundamentals and applications of switch-mode DC-DC and DC-AC power electronic converters. The emphasis is given to hardware development aspects. Students will learn how to safely work with high power and high voltage circuits.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Continuous Systems Analysis And Design",
        "subjectCode": "ECET",
        "courseCode": "33700",
        "instructor": [
            "James Michael Jacob"
        ],
        "description": "This is an advanced course in continuous systems analysis and design. Systems may include RCL circuits, op amp circuits, and DC permanent magnet motors. Systems analyses using differential equations and Laplace Transform techniques are developed, culminating in active filter and closed loop PID system design. Software tools, circuit simulation, and advance calculators are used to solve differential, integral, and differential equation problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Continuous Control Electronics",
        "subjectCode": "ECET",
        "courseCode": "37201",
        "instructor": [
            "Nghia T Le"
        ],
        "description": "A study of the electronic design of the elements of closed-loop analog and digital systems. Topics include characteristics of process and servo systems, analysis and design of the electronics used to acquire the process variable; condition, transmit, and receive the signal; implement a single loop control algorithm, and provide proportional power. Several sensor types and interpretation of their static and dynamic specifications are included. Controllers employed include student designed analog, and embedded microprocessor, and commercial single loop controllers. Software is used to model components and analyze open and closed-loop systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Applied Electronic Drives",
        "subjectCode": "ECET",
        "courseCode": "37300",
        "instructor": [
            "Xiaonan Lu"
        ],
        "description": "This course covers operational principles and application development consideration of all subsystems that make up electric drives: electric machines, power-electric based converters, mechanical system requirements, feedback controller design, and the interaction of drives with the utility grid. State of the art drive development tools are introduced through hands-on activities.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Global Professional Issues In Engineering Technology",
        "subjectCode": "ECET",
        "courseCode": "38001",
        "instructor": [
            "Sarah E Huber"
        ],
        "description": "This course addresses professional ethics, legal issues, professional development, technology transfer, and corporate culture as they relate to EET graduates and our global society. Information relating to personal job and career choices, resumes, and interviews are included.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Electrical Vehicle Integration And Fabrication",
        "subjectCode": "ECET",
        "courseCode": "42301",
        "instructor": [
            "Jeffrey J Richardson"
        ],
        "description": "This course requires students to develop a detailed design, develop a time/action plan, perform research on existing electronic vehicle systems, develop a procurement plan for electronic vehicle components, design and fabricate custom electric vehicle components, and construct an electric vehicle. The completed electric vehicle is extensively tested for safety, performance, and energy efficiency.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Electrical Power Transmissions, Distribution, And Smart Control",
        "subjectCode": "ECET",
        "courseCode": "43600",
        "instructor": [
            "Adel Elshahat Sayedahmed"
        ],
        "description": "A course on the simple modeling and simulation of the power grid systems, power flow analysis, and advanced meter infrastructure (AMI). The fundamentals learned in this course will be useful in the study of the effects of distributed energy resources and storage in Smart Grid environment.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Digital Signal Processing",
        "subjectCode": "ECET",
        "courseCode": "43900",
        "instructor": [
            "Walter Daniel Leon-Salas"
        ],
        "description": "The course builds on the basic principles and applications of Digital Signal Processing with a view to implementing advanced DSP techniques. These techniques are chosen to form some of the building blocks that are used in specialization areas such as the biomedical, communications and energy management fields.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Programming Robots With ROS",
        "subjectCode": "ECET",
        "courseCode": "44200",
        "instructor": [
            "Dongming Gan"
        ],
        "description": "  Robot Operating Systems (ROS) will be used as a programming platform to explore the topics of computer vision, SLAM (Simultaneous Localization and Mapping), path planning, grasping, and social interaction in robotic systems, as well as programming large systems for physical interaction with the world. Self-contained implementation projects are core to the class. Student knowledge of a procedural programming language, familiarity with robotics, and a rudimentary understanding of matrices is assumed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Adv Acoustics & Audio Eng Tech",
        "subjectCode": "ECET",
        "courseCode": "49900",
        "instructor": [
            "Noori Kim"
        ],
        "description": "Hours and subject matter to be arranged by staff. Cannot be used to replace EET 48000, 49600, or 49700. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            9
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced DSP",
        "subjectCode": "ECET",
        "courseCode": "58100",
        "instructor": [
            "Suranjan Panigrahi",
            "Walter Daniel Leon-Salas"
        ],
        "description": "Advanced study of technical and professional topics. Emphasis is on new developments relating to technical, operational, and training aspects of industry and technology education.",
        "capacity": 0,
        "credits": [
            0,
            8
        ],
        "term": "Spring 2024"
    }
]