[
    {
        "title": "Principles Of Economics",
        "subjectCode": "ECON",
        "courseCode": "21000",
        "instructor": [
            "Benjamin J Van Kammen"
        ],
        "description": "This course presents the principles upon which the social science of economics is based. Specifically, it examines how individuals, firms, and the government interact through markets. It also examines several important macroeconomic issues including unemployment, inflation, international trade, and economic growth.  Students are expected to be able to apply these economic principles to analyze current events, work decisions, and personal choices. CTL: ISH 1040 Introduction To Economics",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Microeconomics",
        "subjectCode": "ECON",
        "courseCode": "25100",
        "instructor": [
            "Jacob Alan Brindley",
            "Melanie Elizabeth Fox",
            "Abigail R Banan"
        ],
        "description": "Microeconomics studies the choices individuals make and the incentives that influence those choices.  Emphasis is on the incentives that determine market prices and resource allocation. The role of public policy in influencing incentives and efficiency is also addressed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Macroeconomics",
        "subjectCode": "ECON",
        "courseCode": "25200",
        "instructor": [
            "Andres J Vargas"
        ],
        "description": "This course examines how the US economy functions and provides an overview of important macroeconomic issues including: unemployment, inflation, social security, national debt, international trade, the sub-prime crisis, and business cycles. Emphasis is placed upon the role and limits of government fiscal and monetary policy in promoting economic growth and stable prices. CTL: ISH 1041 Macroeconomics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Economics Scholars Program",
        "subjectCode": "ECON",
        "courseCode": "29000",
        "instructor": [
            "Melanie Elizabeth Fox",
            "Timothy N Bond"
        ],
        "description": "Arrange with instructor before enrolling. Investigation in a specific economics field. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Managerial Economics",
        "subjectCode": "ECON",
        "courseCode": "30100",
        "instructor": [
            "Abigail R Banan"
        ],
        "description": "This course provides a practical and business-focused approach to microeconomic theory. The course covers topics from consumer behavior and demand, decision under uncertainty, production and cost, factor demand, market structure, pricing strategies, and strategic behavior. Emphasis is placed on the tools used to analyze decisions made by managers at firms. This is a required course for several majors in the School of Management and for the business economics minor, but is not intended for economics majors.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Economics Of Public Policy",
        "subjectCode": "ECON",
        "courseCode": "32200",
        "instructor": [
            "Jillian B Carr"
        ],
        "description": "The examination and analysis of public finance practices and problems in the federal fiscal system. Government activities that involve spending and taxation are analyzed applying basic principles of economics. Topics include public education, social security, healthcare, environment and tax systems. State and local government issues are also addressed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Intermediate Microeconomic Theory",
        "subjectCode": "ECON",
        "courseCode": "34000",
        "instructor": [
            "Timothy N Cason",
            "Benjamin J Van Kammen"
        ],
        "description": "This course provides students with the techniques needed to model and analyze the behavior of individual economic agents. It introduces a variety of techniques that will allow students to solve business problems and make informed personal economic decisions. The course covers topics from consumer behavior and demand, decisions under uncertainty, production and cost, factor demand, market structure, pricing strategies, and strategic behavior. This is an upper-division economics course required for all economics majors and it serves as a foundation for higher level elective courses in economics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Intermediate Macroeconomics",
        "subjectCode": "ECON",
        "courseCode": "35200",
        "instructor": [
            "Cathy M Zhang"
        ],
        "description": "This course offers a rigorous introduction to macroeconomic theory and empirics with real-world applications. We examine longstanding stylized facts about long-run economic growth, short-run economic fluctuations (booms and recessions), and the aggregate effects of government policy. We study determinants of equilibrium in labor, consumption, investment, and money markets as well as the role of fiscal and monetary policies in closed and open economies.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Econometrics",
        "subjectCode": "ECON",
        "courseCode": "36000",
        "instructor": [
            "Victoria L Prowse"
        ],
        "description": "This course examines the statistical techniques economists use to analyze data, estimate causal effects, make predictions, and test economic theory. It emphasizes estimating multiple regression models including models of firm output, product prices, and wages. Students learn to make statistical and practical inferences about the true causal relationships. The course covers the data analysis skills required for careers as a consultant, financial analyst, researcher, or economist in the private and public sectors. The skills practiced in the course include using statistical software to analyze data.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Antitrust And Regulation",
        "subjectCode": "ECON",
        "courseCode": "36100",
        "instructor": [
            "Stephen Martin"
        ],
        "description": "This course studies the influence of laws and regulations on market performance and on the functioning of a free-enterprise system. The focus is on two types of government policies: antitrust law and economic regulation. Antitrust laws define the rules by which firms are supposed to compete. Regulations may require that firms obtain approval to set prices, change prices, or enter new markets. They may require firms to adhere to environmental or safety standards. The focus is on current topics in both areas, including comparison of U.S. practice with that of European Union and elsewhere.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "History Of Economic Thought",
        "subjectCode": "ECON",
        "courseCode": "36500",
        "instructor": [
            "Kelly H Blanchard"
        ],
        "description": "The course traces the development of theories of value and economic growth from the seventeenth century to Karl Marx. Among the authors studied are the mercantilists, Hume, Smith, Ricardo, and Marx. Excerpts from the original works are read and evaluated in light of modern theory.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "International Trade",
        "subjectCode": "ECON",
        "courseCode": "37000",
        "instructor": [
            "J Ryan Umbeck",
            "Chong Xiang"
        ],
        "description": "Develops an understanding of the economics of globalization, including the movement of goods, people, capital, and ideas across countries. Using the tools of intermediate economic theory, we discuss the benefits and costs of globalization, the implications of globalization for wages, earnings, and national welfare, and their intersection with government policies.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Money And Banking",
        "subjectCode": "ECON",
        "courseCode": "38000",
        "instructor": [
            "Seungki Hong"
        ],
        "description": "The course analyzes the economics of money, monetary systems, investments, and financial intermediaries in modern industrial economies. Topics considered include the origin of money and the banking industry, financial asset markets, the role of central banks, and the effects of various monetary policies. The theory will be presented side by side with current economic and financial news, and the students will learn how to track financial and economic data via The Wall Street Journal.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Labor Economics",
        "subjectCode": "ECON",
        "courseCode": "38500",
        "instructor": [
            "Miguel A Sarzosa"
        ],
        "description": "The purpose of this course is to introduce important topics, theories, institutions, and policy issues relating to the functioning of labor markets. Topics to be considered include labor supply decisions, investments in human capital, compensating wage differentials, labor contract theory, unions, compensation programs, signaling in labor markets, the economics of unemployment, and government employment, retirement, and workplace safety.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Development Economics",
        "subjectCode": "ECON",
        "courseCode": "39000",
        "instructor": [
            "Ben Zou"
        ],
        "description": "Investigation into a specific topic area of economics. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Game Theory",
        "subjectCode": "ECON",
        "courseCode": "45100",
        "instructor": [
            "Bettina S Klose",
            "David Gill"
        ],
        "description": "In the course, economic, political, and social interactions are represented as games, in which strategies and resulting outcomes can be analyzed. The analysis of these interactions is then used to demonstrate how one can make optimal decisions under uncertainty. This course uses Calculus.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Urban Economics",
        "subjectCode": "ECON",
        "courseCode": "45600",
        "instructor": [
            "Ben Zou"
        ],
        "description": "Examines the market forces that lead to the development, growth, and size of cities. In addition, this course covers the theory of location and land use, principles of local public finance, policy problems in the areas of urban housing, transportation, crime, and pollution.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Data Analysis And Machine Learning",
        "subjectCode": "ECON",
        "courseCode": "46300",
        "instructor": [
            "Victoria L Prowse"
        ],
        "description": "This is an advanced applied econometrics course that introduces students to a variety of techniques and methods for the empirical study of economic data. This course focuses on the practical aspects of economic data analysis, including data organization (such as merging and appending datasets) and the implementation of econometric models. This course will cover multivariate linear regression, non-linear least squares, models for binary and categorical outcomes, model selection using machine learning, and panel data models. As part of the course, students will learn to conduct empirical analysis of economic data using Stata, a statistical software package.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Behavioral Economics",
        "subjectCode": "ECON",
        "courseCode": "47100",
        "instructor": [
            "Jacob Alan Brindley"
        ],
        "description": "Students learn about human behavior in economic environments, with a strong emphasis on classroom laboratory exercises.  Topics considered include behavior in a variety of markets - for example, markets with price controls, markets for financial assets and auction markets -- and behavior in social dilemmas that arise when people try to provide public goods voluntarily or when sellers try to conspire to fix prices. Students will also learn how people bargain with, trust each other, and show social preferences towards others. Decision-making and anomalies for risky and uncertain choices will also be covered.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Economics Of Racial And Gender Discrimination",
        "subjectCode": "ECON",
        "courseCode": "48500",
        "instructor": [
            "Timothy N Bond"
        ],
        "description": "This course focuses on quantifying the extent of, and determining the underlying causes of racial and gender disparities in the labor market. Topics include the impact of prejudice on labor market outcomes, statistical discrimination, early childhood factors and differences in environment, and fertility and reproductive technology.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Intermediate Economics II",
        "subjectCode": "ECON",
        "courseCode": "51200",
        "instructor": [
            "J Ryan Umbeck"
        ],
        "description": "Course content includes money and banking, national income and aggregative economics; the analysis of the determination of national income, employment, the price level, and the balance of payments. Consideration of both theory and economic policy. Not open to students with credit in ECON 35200.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Financial Econometrics",
        "subjectCode": "ECON",
        "courseCode": "57300",
        "instructor": [
            "Yong Bao"
        ],
        "description": "This course offers an introduction of basic principles of econometric analysis that will help students understand finance theories and their empirical applications. It will also equip students with appropriate statistical techniques for doing applied financial research. The statistical techniques are particularly well suited for analyzing financial time-series data. Permission of department required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Microeconomics III",
        "subjectCode": "ECON",
        "courseCode": "60900",
        "instructor": [
            "Matthew Luke Kovach"
        ],
        "description": "An advanced course in game theory and general equilibrium theory. Among the topics covered are: games in strategic form, games in extensive form, games of incomplete information, cooperative games with side payments, mechanism design, consumer choice theory, Pareto optimality, the Arrow-Debreu-McKenzie model, and the existence and stability of competitive equilibria. Prerequisite:  ECON 60600.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Macroeconomic Theory II",
        "subjectCode": "ECON",
        "courseCode": "61100",
        "instructor": [
            "Cathy M Zhang"
        ],
        "description": "An introduction to selected topics in macroeconomics, including theories of business cycles, economic growth, microfoundations of labor markets and some miscellaneous issues. Topics covered include: theories of business cycles (real business cycles, information imperfections, coordination failures), economics of growth (neoclassical model, human capital model, endogenous growth), microfoundations of labor markets (recursive competitive equilibrium models, search and matching models, efficiency wages, implicit contracts, insider-outsider model), miscellaneous issues including monetary economics (cash-in-advance constraint models), the Lucas critique, time inconsistency, and endogenous cycles. Prerequisite:  ECON 60800.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Macroeconomic Theory III",
        "subjectCode": "ECON",
        "courseCode": "61200",
        "instructor": [
            "Seungki Hong"
        ],
        "description": "Selected topics in contemporary research in macroeconomic theory. Emphasis on the implications of uncertainty in macroeconomic theory, including such topics as search theory, asset selection under uncertainty, stochastic optimal control, and asymmetric information.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Economics Of Information",
        "subjectCode": "ECON",
        "courseCode": "61400",
        "instructor": [
            "Matthew Luke Kovach"
        ],
        "description": "An introduction to the economics of information. Key topics considered are non-expected utility theory and the various implications of asymmetric information-either hidden action(s) and/or hidden types, including extensions of the basic principal-agent model as well adverse selection issues, mechanism design, and screening/signaling models. Other topics that may be considered include the value of information/real option theory, herd behavior, capital asset pricing models, stochastic calculus and options pricing models, organizational decision making, search theory and price dispersion models, and herd behavior. Prerequisite:  ECON 60600.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "International Trade",
        "subjectCode": "ECON",
        "courseCode": "63400",
        "instructor": [
            "Chong Xiang"
        ],
        "description": "Application of microeconomic techniques to international trade. Topics include: classical, neoclassical, and modern theories of international trade; the theory of tariffs and commercial policy, (including aspects of political economy), welfare aspects of trade and tariff theory, and related topics. The material is selected from current journal articles. Prerequisite:  ECON 60700.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Labor Economics II",
        "subjectCode": "ECON",
        "courseCode": "65600",
        "instructor": [
            "Miguel A Sarzosa"
        ],
        "description": "This course is the third in the PhD Labor Economics sequence. This course is designed to be primarily a \"topics\" course. Class will focus on some of the most popular open questions in labor economics, however, we will take a long view to these questions in order to understand the progress that has been made over the last half-century.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Topics In Applied Economics",
        "subjectCode": "ECON",
        "courseCode": "66800",
        "instructor": [
            "Yong Bao"
        ],
        "description": "Applied micro workshop. Topics on applied macroeconomics are presented by departmental and external speakers.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Econometrics II",
        "subjectCode": "ECON",
        "courseCode": "67200",
        "instructor": [
            "Mohitosh Kejriwal"
        ],
        "description": "Topics include generalized method of moments, estimation and inference with weak instruments, panel data models and bootstrap methods. Prerequisite: ECON 67100.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Time Series Econometrics",
        "subjectCode": "ECON",
        "courseCode": "67300",
        "instructor": [
            "Yong Bao"
        ],
        "description": "This advanced course gives an up-to-date and comprehensive treatment of modern time series analysis and empirical macroeconomics. Topics include: ARIMA processes, spectral analysis, forecasting, covariance-stationary vector processes, vector auto regressions, state space representations in the Kalman filter, non-stationary time series and fractional integrated processes, and time series models of heteroscedasticity.  Prerequisite: ECON 67200.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Experimental Economics II",
        "subjectCode": "ECON",
        "courseCode": "68600",
        "instructor": [
            "Timothy N Cason"
        ],
        "description": "Covers topics different from ECON 685, and they vary from year to year. May be taken prior to ECON 685. Course readings are primarily from journal articles.  Prerequisite: ECON 60700. 61000.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Experimental And Behavioral Economics",
        "subjectCode": "ECON",
        "courseCode": "68900",
        "instructor": [
            "David Gill"
        ],
        "description": "The course will cover: (i) experimental methodology; (ii) statistical considerations in experiments; (iii) behavioral game theory (including psychological games and boundedly rational thinking in games); (iv) loss aversion and reference points (including prospect theory, expectations-based reference points, and goal setting); and (v) experiments on gender. We will also discuss how to develop good research ideas in experimental economics, and how to write papers in a way that appeals to top journals in the field.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Adv Tpcs Panel & Spatial Econ",
        "subjectCode": "ECON",
        "courseCode": "69000",
        "instructor": [
            "Jillian B Carr",
            "Mario J Crucini",
            "Yong Bao"
        ],
        "description": "Advanced individual reading and investigation in a specific economic field at the graduate level. Open to individual students with superior records. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Research Methods In Economics",
        "subjectCode": "ECON",
        "courseCode": "69700",
        "instructor": [
            "Anson Soderbery"
        ],
        "description": "  The first steps in doing a thesis research paper, proposal/idea, growing the proposal/idea. Developing a set of critical professional skills. Pre-requisite: ECON 60700 and ECON 60800.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Spring 2024"
    }
]