[
    {
        "title": "Special Populations Seminar: English Language Learners And Students With Gifts And Talents",
        "subjectCode": "EDCI",
        "courseCode": "20002",
        "instructor": [
            "Ali Kushki"
        ],
        "description": "(EDCI 20002) This seminar is focused on special populations of learners for teacher education majors with an emphasis on students who are English learners and students with gifts, talents and creativity. Students will engage in mentoring activities and ongoing support in their development as a professional. The goal of the seminar is to connect theory to practice by engaging in an immersive field experience that connects to content and courses taken concurrently. The seminar provides an environment conductive to fostering rich relationships with schools and communities, pursuing common inquiry, thinking critically about theory, content and practice and advocation for equitable schooling. This seminar is intended to be taken concurrently with EDPS 24000 & EDCI 37001.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Exploring Teaching As A Career",
        "subjectCode": "EDCI",
        "courseCode": "20500",
        "instructor": [
            "Comfort Temitope Aje",
            "Muna Sapkota",
            "Xuwei Luo",
            "Margie Cubillo Araya"
        ],
        "description": "Students will become familiar with the work of teachers and begin to develop their educational philosophies through examining what it means to teach and to learn and the nature and purpose of schools. Students will critically evaluate teaching as their chosen profession.   This course includes a required weekly field-based experience in an elementary, middle, or high school classroom.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Education Scholars II",
        "subjectCode": "EDCI",
        "courseCode": "21100",
        "instructor": [
            "Nadine E Dolby"
        ],
        "description": "This is the second course in a two course, introductory sequence for College of Education students enrolled in the Honors College and/or Devito Program scholarship recipients. In this course, students will work on a research project with a faculty mentor, will participate in reflection and discussion of that research experience, will participate in seminars with faculty to read and discuss research, and continue to explore their own research interests and campus resources.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Teaching History: Standards And Strategies",
        "subjectCode": "EDCI",
        "courseCode": "21610",
        "instructor": [
            "Chrystal S Johnson"
        ],
        "description": "Course prepares students for teaching history in powerful, exciting and innovative ways through a topical study (e.g., American Civil Rights Movement) approach. Required for all Social Studies Education majors.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Teaching Civics And Government: Standards And Strategies",
        "subjectCode": "EDCI",
        "courseCode": "21810",
        "instructor": [
            "Kathryn M Obenchain"
        ],
        "description": "Course prepares students for teaching civics and government in powerful, exciting and innovative ways through a study of civics and political science concepts with the framework of inquiry design model (IDM) and an inquiry-based curriculum. Required for all Social Studies Education majors.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Knowing The World Through Mathematics",
        "subjectCode": "EDCI",
        "courseCode": "22200",
        "instructor": [
            "Doris Fulwider",
            "Hillary Ongoyo Omoze",
            "Abigail Erskine"
        ],
        "description": "In this course, Knowing the World Through mathematics, students will connect their situated experiences to larger trends in equity and social justice around the globe through mathematical investigations embedded in the context of the United Nations 2030 agenda (United Nations, 2015). Students in this course will make use of mathematics and global policy documents to critically interpret, model, and represent world phenomena.  Students will collaboratively analyze quantitative information gathered through trustworthy, globally representative data sets and individual survey and questionnaire items to investigate local experiences in relation to students' area(s) of interest. Students will learn about and utilize the GAISE Framework for Statistical Problem Solving (Franklin et al., 2005) and the Four Dimensions of Equity in Mathematics Education (Gutierrez, 2012) to ground their discussions and deliverables for Knowing the World Through Mathematics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Mathematics Education Seminar",
        "subjectCode": "EDCI",
        "courseCode": "22550",
        "instructor": [
            "Jill A Newton"
        ],
        "description": "In this course, students will be introduced to many aspects of mathematics education, including pedagogies, professional organizations, standards, research, lesson planning, technology, etc. In addition, they will have opportunities to get to know others in their major earlier in their program.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Professional Development In Family And Consumer Sciences Education",
        "subjectCode": "EDCI",
        "courseCode": "25000",
        "instructor": [
            "Alyson Lois Mcintyre Reiger"
        ],
        "description": "This course focuses on students' professional development as family and consumer sciences educators.  Characteristics and relationships among middle and high school family and consumer sciences standards, resources, and learning experiences; the Purdue Family and Consumer Sciences Education program; and expectations for Indiana FCS teacher-licensure are emphasized.  Includes participation in professional organizations and meetings.",
        "capacity": 0,
        "credits": [
            1,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Multiculturalism And Education",
        "subjectCode": "EDCI",
        "courseCode": "28500",
        "instructor": [
            "Jason A Ware",
            "Nadine E Dolby",
            "Asenath Aoko Odondi",
            "Stephen I Smith",
            "Mahreen Mamoon"
        ],
        "description": "This course integrates an understanding of multiculturalism with principles of democratic education. Historical, sociological, cultural, political, philosophical, and pedagogical foundations of multiculturalism are explored and related to issues of pedagogy in a pluralistic society.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Inquiry Into Teaching And Learning In K-2",
        "subjectCode": "EDCI",
        "courseCode": "30101",
        "instructor": [
            "Kathleen A Martin"
        ],
        "description": "The goal of the seminar is to connect theory to practice by engaging in an immersive field experience that connects to content and courses taken concurrently through cycles of inquiry. In particular, this seminar is intended to be an inquiry space for questions and topics related to teaching using pedagogies of care in the K-2 classroom. Admission to Teacher Education required. Cannot be taken concurrently with EDCI 30002.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Inquiry Into Teaching And Learning In 3-6",
        "subjectCode": "EDCI",
        "courseCode": "30102",
        "instructor": [
            "Kathleen A Martin"
        ],
        "description": " The goal of the seminar is to connect theory to practice by engaging in an immersive field experience that connects to content and courses taken concurrently through cycles of inquiry. In particular, this seminar is intended to be an inquiry space for questions and topics related to teaching using pedagogies of care in the 3-6 classroom. Admission to Teacher Education is required. Cannot be taken concurrently with EDCI 30101.  ",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Reading In Middle And Secondary Schools: Methods And Problems",
        "subjectCode": "EDCI",
        "courseCode": "30900",
        "instructor": [
            "Alex M Carignan"
        ],
        "description": "For prospective teachers at junior and senior high schools. An overview of reading processes, fundamentals of reading instruction, factors that influence the ability to read text materials, strategies and materials for identifying and reducing reading problems, school resources, and programs for normal and deficient readers. Concurrent enrollment with program-specified methods course.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Integrating Media In The K-2 Classroom",
        "subjectCode": "EDCI",
        "courseCode": "31101",
        "instructor": [
            "Nancy A Boes"
        ],
        "description": "The goal of the course is for teacher candidates to understand how to choose and evaluate children's literature and media to use in K-2 classroom, develop ways to integrate literature and understanding of literature and media using a variety of methods, select appropriate materials for individual student's needs, and assess student's learning. Admission to Teacher Education is required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Integrating Media In The 3-6 Classroom",
        "subjectCode": "EDCI",
        "courseCode": "31102",
        "instructor": [
            "Nancy A Boes"
        ],
        "description": "The goal of the course is for teacher candidates to understand how to choose and evaluate children's literature and media to use in the 3-6 classroom, develop ways to integrate literature and media throughout the curriculum, support students' understanding of literature and media using a variety of methods, select appropriate materials for individual student's needs, and assess students' learning.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Physical Education In The Elementary School",
        "subjectCode": "EDCI",
        "courseCode": "32250",
        "instructor": [
            "Andrea Kay Bornino",
            "Danae M Rush"
        ],
        "description": "Current conceptions of elementary school physical education, with a particular emphasis on curriculum implementation.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Literacy In The Early Childhood Classroom",
        "subjectCode": "EDCI",
        "courseCode": "32500",
        "instructor": [
            "Fay Elizabeth Mentzer"
        ],
        "description": "Students will study how children's oral language develops, how children learn to read and write in early childhood/K3 settings,  and the teacher's role in this process.  Students will learn how phonemic awareness, phonics, fluency, vocabulary and comprehension influence children's literacy development.  Students will learn how to select appropriate instructional materials; employ teaching strategies to meet the cognitive and affective literacy needs of all children; and collect, interpret, and use data from various types of assessments to inform literacy teaching and learning processes.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Teaching Literacy In K-2",
        "subjectCode": "EDCI",
        "courseCode": "32501",
        "instructor": [
            "Whitney Marie Rippy"
        ],
        "description": "Students will study how children's oral language develops, how children learn to read and write in primary grade settings, and the teacher's role in this process. Students will learn how phonemic awareness, phonics, fluency, vocabulary and comprehension influence children's literacy development. Students will learn how to select appropriate instructional materials; employ teaching strategies to meet the cognitive and affective literacy needs of all children, and collect, interpret, and use data from various types of assessments to inform literacy teaching and learning processes.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Teaching Literacy In 3-6",
        "subjectCode": "EDCI",
        "courseCode": "32602",
        "instructor": [
            "Inna Abramova"
        ],
        "description": "Students will build on material learned in EDCI 32501. They will concentrate on increasing student's literacy skills with a focus on fluency, phonics, strategic reading, vocabulary, literary analysis, content area reading, the writing process, and building comprehension skills. They will learn to select appropriate materials, employ strategies to meet the cognitive and affective literacy needs of all children, and create integrate, and use data from various forms of assessment to inform the teaching and learning process.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Reading Instruction For Tier 1 And Tier 2",
        "subjectCode": "EDCI",
        "courseCode": "33500",
        "instructor": [
            "Melanie R Kuhn",
            "Jennifer Elaine Smith"
        ],
        "description": "Given the needs of struggling/striving readers throughout the educational system, this class will focus on effective interventions from the primary grades through high school. Instructors will present a balance of theoretical and practitioner-oriented aspects of reading development and instruction. The course will also examine a number of reading models and instructional approaches designed to ensure all students have access to effective, research-based literacy instruction. The goal is to ensure students complete the semester with a range of essential tools for working with this population.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Community Issues & Applications For Educators",
        "subjectCode": "EDCI",
        "courseCode": "35000",
        "instructor": [
            "Stephanie Scherer",
            "Daniela Reyes",
            "Jennifer Jane Call",
            "Crystal Snow Webb"
        ],
        "description": "This course is an examination of diverse individual, family, and community characteristics and issues, and potential impacts on teaching and learning processes.  Includes service learning with human service agencies and personnel in the school and community.  As part of this course, students complete certification to meet the Indiana Department of Education suicide prevention training requirement for teacher licensure.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Tanzania Seminar",
        "subjectCode": "EDCI",
        "courseCode": "35001",
        "instructor": [
            "Jill A Newton"
        ],
        "description": "  In this course, we will prepare for the Maymester in Tanzania study abroad program in a variety of ways, including investigating the history and culture of Tanzania, beginning to learn Kiswahili, conceptualizing service learning experiences, and collaborating on a plan for program logistics.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "International Comparative Education",
        "subjectCode": "EDCI",
        "courseCode": "35002",
        "instructor": [
            "Joann I Phillion"
        ],
        "description": "In this course, students will explore the education system in an international context and compare particular aspects of the system (e.g., equity, funding, language, accessibility) to their own experiences with, and knowledge of, education in the United States. Students will consider the range of schools and policies in both countries in terms of issues of social justice (e.g., redistribution, recognition, representation).",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Curriculum And Instruction In Family And Consumer Sciences: Middle School",
        "subjectCode": "EDCI",
        "courseCode": "36000",
        "instructor": [
            "Janine Marie Duncan"
        ],
        "description": "Instructional program development for family and consumer sciences.  Developmental needs and issues of early adolescents; study of adolescent literacy; and curriculum integration of language arts, math, and other content areas are emphasized.  Development of a comprehensive unit of instruction that incorporates standard-based curriculum, assessment, and instruction for family and consumer sciences is a major component of the course.  Includes observations and interactions with family and consumer sciences teachers and students and participation in professional meetings.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Teaching Social Studies In K-2",
        "subjectCode": "EDCI",
        "courseCode": "36101",
        "instructor": [
            "John Patrick Broome"
        ],
        "description": "This course provides students with an overview of the field of social studies, of selected issues in the field, and of best practice strategies for teaching social studies to children in the K-2 classroom. Students will work to identify the most important social studies knowledge, skills and dispositions; investigate how K-2 children learn social studies most effectively. Students will then use their new understandings to implement lessons, analyzing the effectiveness of their instruction for children in the K-2 grades. Admission to Teacher Education is required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Teaching Social Studies In 3-6",
        "subjectCode": "EDCI",
        "courseCode": "36102",
        "instructor": [
            "John Patrick Broome",
            "Cheryl A Mcilrath",
            "Kathryn M Obenchain"
        ],
        "description": "This course provides students with an overview of the field of social studies, of selected issues in the field, and of best practices strategies for teaching social studies to children in the 3-6 classroom. Students will work to identify the most important social studies knowledge, skills and dispositions; investigate how 3-6 children learn social studies most effectively. Students will then use their new understandings to implement lessons, analyzing the effectiveness of their instruction for children in the 3-6 grades.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Literacy Teaching And Assessment In K-6",
        "subjectCode": "EDCI",
        "courseCode": "36303",
        "instructor": [
            "Whitney Marie Rippy",
            "Fay Elizabeth Mentzer"
        ],
        "description": "This course is an undergraduate, elementary education course designed to provide preservice teachers with classroom and practicum experiences focused on literacy instruction for children experiencing difficulty learning to read and write. Students learn to administer and analyze individual assessments to determine the strengths and needs of a struggling reader/writer and set tutoring goals based on these results. Application of appropriate instructional strategies for developing comprehension, letter and word study, vocabulary, and fluency is the focus of twice-weekly, 30 minute tutoring sessions (22+ total) in local elementary schools. Teaching is designed around children's social justice concerns. Admission to Teacher Education is required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Mathematics In The Elementary School",
        "subjectCode": "EDCI",
        "courseCode": "36400",
        "instructor": [
            "Sezai Kocabas"
        ],
        "description": "Focuses on teaching mathematics in the elementary school. Students learn what it means to teach mathematics when reasoning, problem solving, communication, and connections are the foci. Includes a field-based experiential component.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Teaching Mathematics In K-2",
        "subjectCode": "EDCI",
        "courseCode": "36401",
        "instructor": [
            "Laura C Bofferding"
        ],
        "description": "This course focuses on teaching mathematics in the elementary school, grades K-2, and encouraging children as mathematical problem posers. Students learn what it means to teach math interactionally using children's ideas, beliefs, and experiences as primary resources. Eliciting and interpreting children's mathematical thinking as well as mathematical reasoning, problem solving, communication, and connections are foci. Admission to Teacher Education required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Teaching Mathematics In Grades 3-6",
        "subjectCode": "EDCI",
        "courseCode": "36402",
        "instructor": [
            "Yi Zhu",
            "Doris Fulwider",
            "Amber Nicole Brown"
        ],
        "description": "Focuses on teaching mathematics in the elementary school grades 3-6.  Students learn what it means to teach mathematics interactionally using children's ideas, beliefs, and experiences as primary resources. Mathematical reasoning, problem solving, communication, and connections are foci.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Science In The Elementary School",
        "subjectCode": "EDCI",
        "courseCode": "36500",
        "instructor": [
            "Jenna Rae Gist"
        ],
        "description": "Investigates ways children learn science as a basis for planning, enacting, and assessing science curriculum and instruction. State and national standards, teaching cases, and science lab experiences are used as tools for reflecting on practice. Includes a field-based experiential component. Taken concurrently with EDCI 36400 and EDCI 37000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Teaching Science Through Design In Grades K-2",
        "subjectCode": "EDCI",
        "courseCode": "36501",
        "instructor": [
            "Gina Marie Zaccagnini"
        ],
        "description": "One of the primary goals of this course is to provide you with opportunities to enhance your pedagogical knowledge and skills so that you can become a culturally inclusive and effective teacher. Hence, learning to teach science in this class will involve conceptualizing science as a verb and not as a noun. To make the distinction more precise, we prefer to use the term critical cross-cultural science education instead of science education when referring to the teaching and learning of science in the increasingly culturally diverse context of schools in the US. Critical cross-cultural science education is defined as the process of actively engaging students in collaborative inquiry about what science is; whose interests are served by science; who decides what science is and what gets funded as science; and what kinds of individual and collective roles individuals could play as informed and responsible citizens in supporting the advancement of science to benefit society. Admission to teacher education required. At least 9 credits of science content required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Teaching Science Through Design In Grades 3-6",
        "subjectCode": "EDCI",
        "courseCode": "36502",
        "instructor": [
            "Rebekah Jane Hammack",
            "Elizabeth Andrew Thiel",
            "Dean M Ballotti"
        ],
        "description": "The aim of this course is to prepare students to teach science, engineering, and computational thinking with grade 3-6 learners by building on existing pedagogical and subject matter knowledge in science. Students will engage in science and engineering learning experiences; identify and analyze children's ideas and background experiences; and examine instructional strategies for leveraging students' sense making. Using this knowledge, students will plan for and implement standards-based lessons, reflecting on the strengths and areas of improvement of their instruction for grade 3 through 6 learners. At least 9 credits of science content courses are required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Teaching And Learning English As A New Language",
        "subjectCode": "EDCI",
        "courseCode": "37001",
        "instructor": [
            "Ali Kushki",
            "Brenda Sarmiento-Quezada"
        ],
        "description": "This course builds foundational knowledge on the theories and practices related to the English language development of English language learners in the P-12 contexts. Particular attention is given to the current issues as well as on techniques for instructing and assessing students at different stages of English language development in the school context. Students will learn to identify students' strengths and current needs in English, to design classroom experiences across the curriculum, and to assess student performance using current WIDA standards.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "The Teaching Of Social Studies In Secondary Schools",
        "subjectCode": "EDCI",
        "courseCode": "42300",
        "instructor": [
            "Anatoli Rapoport"
        ],
        "description": "The purpose of this course is the development of a theoretical framework and pedagogical skills necessary to teach social studies to middle and high school students. Students are introduced to the general issues involved in planning and organizing a social studies curriculum.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Teaching Of Secondary Mathematics",
        "subjectCode": "EDCI",
        "courseCode": "42500",
        "instructor": [
            "Abigail Erskine"
        ],
        "description": "This is the first of two methods courses designed for students who are planning to be secondary mathematics teachers. The course content is organized around principles of equity, curriculum, teaching, learning, assessment and technology. It also focuses on the cycle of effective teaching, which includes justifying planning decisions, analyzing teaching, and using data to inform instruction. The courses addresses NCTM's principles and standards, as well as the content and process standards included in Indiana Academic Standards for Mathematics, and pedagogical strategies for teaching these in ways that serve the diverse population of mathematics learners.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Teaching Of World Languages",
        "subjectCode": "EDCI",
        "courseCode": "42700",
        "instructor": [
            "Melinda Dianne White"
        ],
        "description": "This is one of the two methods courses required for World Language Teaching major. While LC 47500 is a theoretical course, this course is a practical course on world language teaching in secondary school.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Teaching Science In The Middle And Junior High School",
        "subjectCode": "EDCI",
        "courseCode": "42800",
        "instructor": [
            "Austin Ryan Jenkins"
        ],
        "description": "Designed to prepare preservice teachers to teach science in the middle and junior high school (grades 5-9). No undergraduate students may be enrolled in any of these undergraduate courses until they have been admitted to teacher education.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Social Studies Methods",
        "subjectCode": "EDCI",
        "courseCode": "43300",
        "instructor": [
            "Chrystal S Johnson"
        ],
        "description": "Foundations of social studies; methods, techniques, strategies of teaching, and activities - with special attention to skills of planning, questioning, and testing. Includes observation, participation, and microteaching in social studies classrooms. No undergraduate students may be enrolled in any of these undergraduate courses until they have been admitted to teacher education.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Literacy Teaching And Learning In Secondary Schools",
        "subjectCode": "EDCI",
        "courseCode": "43400",
        "instructor": [
            "TBA"
        ],
        "description": "Exploration and development of various instructional methods and materials appropriate for supporting adolescent literacy in secondary English (i.e., middle and high school English Language Arts), including the teaching of reading. Content-area literacy methods and materials are also addressed. Includes a field experience of up to 20 hours in a secondary English school setting.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Supv Tch Soc Std Ed",
        "subjectCode": "EDCI",
        "courseCode": "49800",
        "instructor": [
            "Mary Ellen Lennon",
            "Charles A German",
            "Rachael H Kenney"
        ],
        "description": "Teaching full time in a school classroom under the supervision of the teacher in charge of the class and a University supervisor.  Completion of education methods courses and other Gate requirements for the major area and admittance to teacher education required.",
        "capacity": 0,
        "credits": [
            8,
            16
        ],
        "term": "Spring 2024"
    },
    {
        "title": "The Nature Of Science In Science Teaching",
        "subjectCode": "EDCI",
        "courseCode": "51800",
        "instructor": [
            "Khanh Quoc Tran"
        ],
        "description": "Explores philosophical issues related to the scientific enterprise, such as the production and validation of scientific knowledge; the role of the scientific community; and the influence of gender and culture on doing science. Also examines the implications of these issues for science teaching and learning, as well as for research in science education.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Learning Theories And Instructional Design",
        "subjectCode": "EDCI",
        "courseCode": "53100",
        "instructor": [
            "Sunnie L Watson"
        ],
        "description": "This course has been designed to help you learn how theories of human learning and motivation can be applied to the instructional process in order to make the process more effective, efficient, and/or appealing. The focus of the course is on two areas: 1) the theoretical principles that have contributed to the field of Instructional Design (ID), and 2) how those principles can be applied within practical settings.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To K-12 Integrated Science, Technology, Engineering And Mathematics (STEM) Education",
        "subjectCode": "EDCI",
        "courseCode": "53900",
        "instructor": [
            "Graham Pierce Lyon"
        ],
        "description": "This course will provide students with a conceptual understanding of integrated K-12 Science, Technology, Engineering and Mathematics (STEM) education and the nature of the disciplines of STEM. Students will explore implications for the teaching and learning of integrated STEM in a K-12 context through an evaluation of integrated approaches to STEM, national teaching standards and current research.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Teaching STEM Through Agriculture, Food, And Natural Resources",
        "subjectCode": "EDCI",
        "courseCode": "54501",
        "instructor": [
            "Neil A Knobloch"
        ],
        "description": "The course focuses on the background and history of STEM movement and agricultural education, contemporary models, strategies, and justification for incorporation of science, technology, engineering and mathematics (STEM) concepts and practices into K-12 formal and non-formal agricultural education programs. Consider and develop the best practices for STEM teaching and learning and enhancement of STEM content in agriculture, food and natural resources (AFNR) context. The goal of the course is to help students develop knowledge about STEM integration and equip them with teaching knowledge and skills for designing K-12 lesson plans by using integrated STEM through AFNR.  Students will learn strategies that promote engagement in integrated STEM through AFNR activities. At the end of the course, students should be able to design and implement research-based integrated STEM through AFNR lesson plans and assessment plans.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Educational Video Game Design",
        "subjectCode": "EDCI",
        "courseCode": "55600",
        "instructor": [
            "William R Watson"
        ],
        "description": "Designed to provide an introduction to the design of educational video games. The focus of the course is on two areas: 1) the learning, instructional design, and game design theories which can inform the design of effective and engage in educational video games, and 2) how to apply those theories within practical settings.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To E-Learning",
        "subjectCode": "EDCI",
        "courseCode": "56900",
        "instructor": [
            "Luke Bennett"
        ],
        "description": "This course examines how the design and development of instruction are impacted by the use of the computer as delivery system. A primary focus is on effective learning design strategies for e-learning. Learners will identify and apply effective design practices with emphasis on project management, planning, and implementation. Education or training materials will be developed using appropriate authoring tools as determined by the instructional context. Learners will design an E-Learning module with end-to-end documentation of the design process (Project Plan, Design Document, Storyboard). Opportunities for collaborative feedback and evaluation will also be featured elements of the course experience.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Multicultural Education",
        "subjectCode": "EDCI",
        "courseCode": "58500",
        "instructor": [
            "Amber M Neal-Stanley"
        ],
        "description": "The course aims to develop understanding of multicultural education as an on-going reform process that addresses social justice issues through an examination of race, class, gender, ethnicity, language, sexual orientation, etc.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Science/STEM Grad Seminar",
        "subjectCode": "EDCI",
        "courseCode": "59000",
        "instructor": [
            "Lynn A Bryan"
        ],
        "description": "Opportunities for students to study particular problems under the guidance of a member of the This plan of individualized instruction may be used in any field of education or vocational education. Does not include thesis work. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Social Theory For Education",
        "subjectCode": "EDCI",
        "courseCode": "59100",
        "instructor": [
            "Steven J Burdick",
            "Breanya Charise Hogue",
            "Amogh Sirnoorkar"
        ],
        "description": "Group study of a current problem or special topic of interest to professional educational personnel. Intensive study of research, theory, or practical aspects of a particular issue within the usual graduate class format.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Qualitative Research Methods In Education",
        "subjectCode": "EDCI",
        "courseCode": "61500",
        "instructor": [
            "Steven J Burdick",
            "Stephanie M Zywicki"
        ],
        "description": "Focuses on expanding graduate students' research skills to include knowledge of the theories and methods associated with qualitative and qualitative-quantitative combined research. Prerequisite: EDPS 53300.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Qualitative Data Collection And Analysis In Educational Research",
        "subjectCode": "EDCI",
        "courseCode": "61600",
        "instructor": [
            "Amber M Neal-Stanley"
        ],
        "description": "This course focuses on expanding and applying students' knowledge of qualitative data collection and analysis with an emphasis on multiple approaches to data collection, analysis, and interpretation. Prerequisite: EDCI 61500 or permission of instructor.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Dev Math Ed Researcher",
        "subjectCode": "EDCI",
        "courseCode": "62000",
        "instructor": [
            "Rachael H Kenney"
        ],
        "description": "Selected topics in mathematics education. Typical topics considered are: (1) problem solving; (2) instructional strategies; (3) cognitive structure; (4) current curriculum; (5) current research. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Place Based Tching & Learning",
        "subjectCode": "EDCI",
        "courseCode": "62200",
        "instructor": [
            "Rebekah Jane Hammack"
        ],
        "description": "Current issues in science education. Typical topics considered are: (1) science curriculum; (2) concept learning; (3) teacher education; (4) intellectual developments; (5) current research.  Prerequisite: EDCI 51700, 51800.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Curriculum And Instruction Doctoral Seminar II",
        "subjectCode": "EDCI",
        "courseCode": "63800",
        "instructor": [
            "Ofelia Schepers"
        ],
        "description": "This course consists of an examination of current educational research. EDCI and other faculty will present and lead discussions of their research. Students will be exposed to research within multiple paradigms and perspectives. This course is intended for all new doctoral students in the Department of Curriculum and Instruction and should be taken within the first year to doctoral study. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Assessment In Career And Technical Education",
        "subjectCode": "EDCI",
        "courseCode": "64900",
        "instructor": [
            "James P Greenan"
        ],
        "description": "Goals and rationale for evaluation in education and work training contexts; assessment and measurement methods, techniques, and procedures; reliability, validity, and accuracy; construction and selection of instruments; data and information collection, analysis, and interpretation; meta evaluation; adaptations and modifications for special needs populations; and using assessment data and information.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Seminar In Career And Technical Education",
        "subjectCode": "EDCI",
        "courseCode": "65300",
        "instructor": [
            "James P Greenan"
        ],
        "description": "Current trends, theory, and practices related to educational contexts and careers.",
        "capacity": 0,
        "credits": [
            1,
            9
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Issues And Methods In Learning Systems Design Research",
        "subjectCode": "EDCI",
        "courseCode": "67300",
        "instructor": [
            "Adrie Anne Koehler-Blair"
        ],
        "description": "  Provides preparation to conduct independent research in the field of learning design and technology through direct participation in the research process: critically reviewing research, designing and conducting a research study, synthesizing and presenting results in written and oral formats. Prerequisites: EDPS 53300, EDCI 67600, EDCI 67700.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Unpacking Research: Writing Literature Reviews In Learning Design And Technology",
        "subjectCode": "EDCI",
        "courseCode": "67600",
        "instructor": [
            "Victoria L Lowell"
        ],
        "description": "  This course is designed to introduce the learner to the process of analyzing and preparing literature reviews on topics relevant to the field of Learning Design and Technology. Emphasis is placed on helping the learner to understand, critique, and synthesize the research literature in order to apply it to their own personal research agenda. Course activities and assignments are designed to help the learner develop the knowledge, tools, and strategies needed to become thoughtful consumers and producers of research and to use this knowledge to inform their practice. Learning experiences revolve around two major themes: 1) the examination and thoughtful critique of current research and 2) preparation of a thorough literature review that provides a rationale for continued study. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Indigenous Perspective On Rsch",
        "subjectCode": "EDCI",
        "courseCode": "68400",
        "instructor": [
            "Stephanie M Zywicki"
        ],
        "description": "A course designed to allow for the in-depth exploration of specialized and timely topics in curriculum theory, practice, and reform. Though all specialized topics address both theory and practice, some topics focus more heavily on practice, and others focus more heavily on theory.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    }
]