[
    {
        "title": "Academic And Career Planning",
        "subjectCode": "EDPS",
        "courseCode": "10500",
        "instructor": [
            "Edward S Vana",
            "Katy Marie Panozzo",
            "Lynette J Bleed",
            "Jessica N Chapman",
            "Ashlyn M Ruff"
        ],
        "description": "Builds understanding of career interests and personality characteristics related to academic and career decisions. Expands knowledge of Purdue academic programs and of the world of work. Introduces decision-making strategies.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Learning And Regulation Strategies For College Success",
        "subjectCode": "EDPS",
        "courseCode": "17700",
        "instructor": [
            "Brenda K Downing"
        ],
        "description": "This course is designed to help students improve their college academic success by studying more efficiently and effectively, through strategic engagement, learning, and performance. We examine and apply evidence-based learning, motivation, and regulation strategies beneficial for college and lifelong learning. Educational psychology provides the theoretical framework for practical application of intentional and informed learning, cognition, motivation and behavior regulation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Special Populations Seminar: Focus On Students With Disabilities And Differentiation Approaches",
        "subjectCode": "EDPS",
        "courseCode": "20001",
        "instructor": [
            "Jasmine L Begeske"
        ],
        "description": "(EDCI 20001) This seminar is focused on special populations of learners for teacher education majors with an emphasis on exceptional students and approaches to curricular differentiation. Students will engage in mentoring activities and ongoing support in their development as a professional. The goal of the seminar is to connect theory to practice by engaging in an immersive field experience that connects to content and courses taken concurrently. The seminar provides an environment conducive to fostering rich relationships with schools and communities, pursuing common inquiry, thinking critically about theory, content and practice and advocating for equitable schooling. This seminar includes a field experience targeting schools and classrooms including exceptional students. This seminar is intended to be taken concurrently with EDPS 24800 and EDPS 26501.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Special Education Law, Policy, And Ethical Guidelines",
        "subjectCode": "EDPS",
        "courseCode": "21100",
        "instructor": [
            "Jennifer Elaine Smith"
        ],
        "description": "This course provides opportunities for analysis and practical application of special education law and policy through discourse and advocacy. It is designed to provide students with a foundational understanding of special education, including the historical context for special education and the laws, policies, and ethical guidelines that have driven current special education legislation. Special education professionals hold multiples roles: teacher, case manager, general education consultant, instructional aid supervisor, research, and administrator to name a few. Moreover, there are numerous responsibilities required to successfully work in each of these roles and in this course we focus on law, policy, and ethical guidelines where they are relevant to special education pre-service teachers and support personnel.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Collaboration And Family Engagement To Support Students With Disabilities",
        "subjectCode": "EDPS",
        "courseCode": "21200",
        "instructor": [
            "Juliana Aguilar"
        ],
        "description": "Students will learn strategies for communicating and collaborating with a variety of team members. Finally culture will be explored. Strategies for collaborating with family members, administrators, paraprofessionals and related service personnel will be explored. This course includes a field experience.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Learning And Motivation",
        "subjectCode": "EDPS",
        "courseCode": "23500",
        "instructor": [
            "Brenda K Downing"
        ],
        "description": "Introduction to concepts of learning and motivation in educational contexts (i.e., Educational Psychology).  Influence of development, culture, and individual differences on learning and motivation. Uses of assessment and technology in promoting learning and motivation. A field-based experiential component is included.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "The Inclusive Classroom",
        "subjectCode": "EDPS",
        "courseCode": "26501",
        "instructor": [
            "Scott E Opsahl"
        ],
        "description": "This course is designed to provide an overview of the characteristics of children (birth through age 21) with disabilities, causes of disability, assessment techniques, and instructional strategies. Emphasis is placed upon the development of an inclusive lesson plan based on student needs in the field experience classroom. Characteristics addressed include learning, behavioral, social-emotional, and communicative abilities and needs for students with mild and intense support needs. Issues related to cultural differences and family impact will also be addressed. A field-based component is included.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Student Leadership Development",
        "subjectCode": "EDPS",
        "courseCode": "30000",
        "instructor": [
            "Melissa D Gruver"
        ],
        "description": "Leadership in students is developed through lectures and experiential activities. Topic areas include leadership styles; campus organizational structures; program planning; social and intellectual activities; human relations and cultural differences; motivation; team building; public relations. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Peer Counseling Training",
        "subjectCode": "EDPS",
        "courseCode": "30100",
        "instructor": [
            "Miaya Elise Scott"
        ],
        "description": "Students are trained to help peers deal with their problems and concerns. Training modules are used to build knowledge and skills in the duties of peer helpers; student development, communication, goal setting, and use of community resources are stressed. (EDPS 30100 and 30100 are for Horizon students only.). Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Special Education Seminar: Perspectives On Disability",
        "subjectCode": "EDPS",
        "courseCode": "30500",
        "instructor": [
            "Jasmine L Begeske"
        ],
        "description": "This course is designed to broaden student understanding of disability by exploring across related fields including disability studies, neurodiversity, speech language development, and behavioral characteristics. The goal of this seminar is for students to make connections between special education theory and practice and theories and views of disability beyond special education. Through lecture, discussion, and reflection, students will learn about the construct of disability and how individual strengths, needs, services, and supports extend across the lifespan and beyond the special education classroom.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Supporting Exceptional Learners: Foundations And Mathematics",
        "subjectCode": "EDPS",
        "courseCode": "31100",
        "instructor": [
            "Yan Ping Xin"
        ],
        "description": "Teaching students with special needs requires the ability to locate evidence-based interventions, implement those interventions with fidelity, and track student performance over time. Mathematics is a content area in which success or failure yields major ramifications for postsecondary success. This course will cover the common math interventions employed for mild to severe disabilities across grade levels K-12.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Inclusive Practices In Cross-Content Curriculum",
        "subjectCode": "EDPS",
        "courseCode": "31200",
        "instructor": [
            "Jennifer Elaine Smith"
        ],
        "description": "This course aims to teach best practices for cross-content integration in an inclusive or self-contained classroom.  It develops pre-service teacher understanding of core curricula along with how to integrate the curricula across subject areas. This course will also cover curricula to implement a well-rounded education (e.g., visual arts, dance, theater, music, etc.), provide methods for inclusive practices within the content, and discuss the implementation of collaborative approaches to cross-content planning and delivery.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Collaborative Leadership: Interpersonal Skills",
        "subjectCode": "EDPS",
        "courseCode": "31500",
        "instructor": [
            "Emily Lauren Boswell"
        ],
        "description": "The purpose of this course is to provide integrated study of listening as a collaborative leadership skill necessary for interpersonal and intrapersonal development. Focus is on the development of professional listening skills, and the understand of the role listening plays in collaborative leadership conflict resolution, interviewing, team building, and ethics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Collaborative Leadership: Cross-Cultural Settings",
        "subjectCode": "EDPS",
        "courseCode": "31600",
        "instructor": [
            "Emily Lauren Boswell"
        ],
        "description": "In this course, students will explore the cultural nuances of leadership in the United States as well as around the world. This course will include impact of globalism as a context for leadership, conflict resolution in a global environment, and other important factors that impact culturally diverse or global teams.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Collaborative Leadership: Mentoring",
        "subjectCode": "EDPS",
        "courseCode": "31700",
        "instructor": [
            "Emily Lauren Boswell"
        ],
        "description": "The purpose of this course is to provide a theoretical and experiential overview of the basic elements of mentoring as a key aspect of effective collaborative leadership. The learning experience is designed to promote development of the knowledge, skills, and dispositions required for competent mentorship. Emphasis on workplace and youth mentoring.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Foundations Of Adapted Physical Education",
        "subjectCode": "EDPS",
        "courseCode": "32600",
        "instructor": [
            "Elizabeth J All"
        ],
        "description": "Lecture and physical education practicum in teaching children with disabilities. An introduction to the basic concepts and techniques of adapted physical education. Laboratory experience in carrying out adapted physical education programs for children is provided.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Classroom Assessment",
        "subjectCode": "EDPS",
        "courseCode": "32700",
        "instructor": [
            "Panayota Y Mantzicopoulos-James"
        ],
        "description": "Evaluating the impact of instruction on student performance is one of the most important skills for an educator. Effective teachers ask themselves, \"How do I know if students are truly learning? Are they meeting educational objectives in the content area?\" Using well-chosen assessment approaches, teachers can address these questions. In this course, students will acquire assessment literacy: the ability to gather accurate information about student achievement, and use that information to make instructional decisions that will improve learning. Course activities will focus on assessment tasks relevant to P- 12 classroom settings.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Positive Behavioral Supports",
        "subjectCode": "EDPS",
        "courseCode": "36201",
        "instructor": [
            "Juliana Aguilar"
        ],
        "description": "This course provides an overview of the theory, principles, and application of applied behavior analysis within positive behavior interventions and support. The course focuses on pre-service teacher preparation in designing and implementing group and individual behavior supports. Emphasis is on universal supports, targeted interventions, and data-driven decision-making.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "K-12 Reading Methods For Exceptional Learners",
        "subjectCode": "EDPS",
        "courseCode": "40200",
        "instructor": [
            "Jennifer Elaine Smith"
        ],
        "description": "This course is designed to meet the exceptions of CEC, NCTQ, and REPA 3 and prepare students in the science of reading for exceptional learners (including students with dyslexia and those with intensive needs) in Tiers 2 and 3. This course will provide implementation details on Response to Intervention (RTI) and Multi-tiered Systems of Support (MTSS). The course will present strategies and programs used in strategic and intensive intervention efforts for those learners needing additional, unique, and/or more focused remediation efforts. Topics will include understanding reading intervention research, the behavior analytic and learning sciences' contributions to understanding the reading process, the sequence of learning to read (systematic instruction), reading to learn, and the five components of reading instruction for both K-3 and 4-12 learners. This course will specifically address the REPA 3 Standard: Focused work using (\"interventions that are direct, explicit, and multi-sensory) as a component of scientifically-based reading.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Individual Social, Emotional, Behavioral Supports",
        "subjectCode": "EDPS",
        "courseCode": "40300",
        "instructor": [
            "Juliana Aguilar"
        ],
        "description": "This course is designed to prepare students with advanced knowledge and skills in designing and delivering individualized social-emotional and behavioral supports for learners. Emphasis will be placed on functional behavior assessment and function-based interventions and supports.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Special Education Knowledge And Skills For General Educators",
        "subjectCode": "EDPS",
        "courseCode": "41700",
        "instructor": [
            "Jasmine L Begeske"
        ],
        "description": "This course is the capstone course for the Special Education certificate and pathway. This course is designed to expose students to innovative strategies and best practices for promoting inclusive education. Students in this course will develop the habits of ongoing training and professional development to support the variety of student needs in inclusive general education classes.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Creating And Managing Learning Environments",
        "subjectCode": "EDPS",
        "courseCode": "43000",
        "instructor": [
            "David A Sears"
        ],
        "description": "The purpose of this course is to enable you to develop a supportive, challenging, and growth-enhancing classroom community for students in elementary grades. Teachers need insightful understanding and strong skills to create a classroom community that enhances achievement, welcomes diversity, makes effective use of technology, and provides appropriate educational experiences for students with diverse needs, backgrounds, and developmental levels.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Secondary Creating And Managing Learning Environments",
        "subjectCode": "EDPS",
        "courseCode": "43010",
        "instructor": [
            "David A Sears"
        ],
        "description": "This course is designed to develop advanced pre-service teachers' skills in recognizing classroom processes and understanding how teachers' beliefs and practices affect secondary students' engagement, learning, and motivation. It focuses on Effective Teaching, what it is, what it looks like, and different ways to enact it in the classroom.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Assistive Technology",
        "subjectCode": "EDPS",
        "courseCode": "45901",
        "instructor": [
            "David Max Jackson"
        ],
        "description": "  This course explores the use of Universal Design for Learning as a framework for Differentiated Instruction. Additionally, this course addresses the use of Augmentative and Alternative Communication and Assistive Technology by individuals with disability requiring mild, moderate, and intense intervention.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Life Skills Sucess & Leadershp",
        "subjectCode": "EDPS",
        "courseCode": "49000",
        "instructor": [
            "Catherine Jean Wright-Eger"
        ],
        "description": "Primarily for teacher candidates requiring special, individualized experience in research or teaching. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            8
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Counseling Multicultural And Diverse Populations",
        "subjectCode": "EDPS",
        "courseCode": "50700",
        "instructor": [
            "Amanda Sommerfeld Case"
        ],
        "description": "Counseling strategies for multicultural and diverse populations encountered by helping professionals. Among the populations considered are ethnic and cultural minorities, older persons, the gifted, and the disabled.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Educational Research I: Methodology",
        "subjectCode": "EDPS",
        "courseCode": "53300",
        "instructor": [
            "Yingying Jiang",
            "Helen Patrick"
        ],
        "description": "This course presents a sequence of journal articles and exercises that help introduce the foundational concepts of the course, including: research design, reliability and validity, various methodologies commonly used in educational research, and basic quantitative and qualitative data analyses. In addition, contrasting research conclusions are shown in the articles to help students learn why careful analysis of articles and their theoretical framing is critical to evaluating their conclusions.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Educational Research II: Measurement Consideration",
        "subjectCode": "EDPS",
        "courseCode": "53400",
        "instructor": [
            "Panayota Y Mantzicopoulos-James"
        ],
        "description": "This course is designed to provide an overview of introductory quantitative data analysis methods in education. The course in specially designed to enhance students' quantitative reasoning and skills through discussions of issues in educational data and authentic data analysis experiences of a variety of education data. The topics to be covered in this course include data collection and description, sampling distributions, methods of quantitative data analysis often used in education research. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Achievement Motivation And Performance",
        "subjectCode": "EDPS",
        "courseCode": "53600",
        "instructor": [
            "Helen Patrick"
        ],
        "description": "Study of current theory and research on the nature and development of achievement motivation. Motivation for intellectual and academic performance will be emphasized. Applications of theory in educational settings will be considered.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Foundations And Principles Of Applied Behavior Analysis",
        "subjectCode": "EDPS",
        "courseCode": "54700",
        "instructor": [
            "Juliana Aguilar"
        ],
        "description": "This course will provide a historical perspective of Applied Behavior Analysis as well as the core principles of ABA. The learner will be exposed to the foundational concepts and methods of ABA including defining behaviors, collecting data, and understanding the three-term contingency of behavior. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Ethics And Professional Practice Of Applied Behavior Analysis",
        "subjectCode": "EDPS",
        "courseCode": "54800",
        "instructor": [
            "Juliana Aguilar"
        ],
        "description": "This course will address the professional and ethical responsibilities of behavior analysts. Key issues of responsible conduct as it relates to areas such as confidentiality, consent, consultation, treatment planning, and research will be discussed and applied through case studies. Learners will be able to apply ABA techniques within the bounds of both legal and ethical frameworks. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Practicum In Applied Behavior Analysis",
        "subjectCode": "EDPS",
        "courseCode": "55100",
        "instructor": [
            "Juliana Aguilar"
        ],
        "description": "University-supervised fieldwork in applied behavior analysis. This practicum will facilitate development and fluency of essential professional and ethical skills necessary for the delivery of high-quality ABA services. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Application Of Applied Behavior Analysis To Manage And Support Personnel",
        "subjectCode": "EDPS",
        "courseCode": "55300",
        "instructor": [
            "Juliana Aguilar"
        ],
        "description": "This course will teach students how to use applied behavior analysis to maximize the potential of an organization. Students will learn the role of a Behavior Analyst in implementing principles of applied behavior analysis to motivate employees, intervene with challenges in the organization, evaluate the program, and collect and deliver ongoing performance feedback. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Quantitative Data Analysis Methods In Education II",
        "subjectCode": "EDPS",
        "courseCode": "55700",
        "instructor": [
            "Sheila F Hurt"
        ],
        "description": "This online course is the second quantitative data analysis methods sequences within the college of education. This course is specially designed to enhance students' quantitative reasoning and skills through discussions of issues in educational data and authentic data analysis experiences of a variety of education data. The topics to be covered in this course include simple/multiple linear regression, different types of group comparison methods (including n-way ANOVA, ANCOVA, Repeated-measures ANOVA, and Mixed ANOVA). The course is specifically designed: 1) to understand how the quantitative methods covered in the course can be used appropriately to address proposed research questions in education, and 2) to interpret quantitative results meaningfully for a given context. It is expected that all students who enroll in this course have completed at least one semester of introductory statistics course (e.g. STAT 50100 or equivalent). Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Creativity In Education",
        "subjectCode": "EDPS",
        "courseCode": "59100",
        "instructor": [
            "Nielsen Ls Pereira"
        ],
        "description": "Group study of a current problem or special topic of interest to professional educational personnel. Intensive study of research, theory, or practical aspects of a particular issue within the usual graduate class format.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Mixed Methods Research Designs And Applications",
        "subjectCode": "EDPS",
        "courseCode": "60700",
        "instructor": [
            "Toni K Rogat"
        ],
        "description": "This course provides an overview of mixed methods research designs within social science and educational research. The focus of the course will emphasize the philosophical pragmatism embedded in enacting mixed methods research. Further, the course will demonstrate the utility and plausibility of integrating quantitative and qualitative data into a single study. This demonstration will be accomplished through reviewing the historical context of qualitative and quantitative research in social sciences and students' application of mixed methods research within their respective fields of study. Prerequisites: EDPS 53300, EDPS 55600, and EDPS 55700 and an introductory qualitative methods course (one of COM 58500, EDCI 61500, SOC 68600).",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Counseling Psychology Research Practicum",
        "subjectCode": "EDPS",
        "courseCode": "61900",
        "instructor": [
            "Eric D Deemer"
        ],
        "description": "Application of qualitative and quantitative research designs in counseling psychology. Concurrent prerequisite: EDPS 61800 and (PSY 60100 or STAT 50200) and Doctoral student standing enrolled in the Counseling Psychology Program.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Multicultural Counseling Theory And Practice",
        "subjectCode": "EDPS",
        "courseCode": "62100",
        "instructor": [
            "Xiang Zhou"
        ],
        "description": "Advanced study and clinical application of racial and cultural theories in counseling.  Knowledge and practicum components are integrated to facilitate development of awareness and skill competencies central to \"Guidelines on Multicultural Education, Training, Research, Practice and Organizational Change for Psychologists\" of the American Psychological Association.  Prerequisite: EDPS 50700. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Off-Site Counseling Practicum And Supervision Theory",
        "subjectCode": "EDPS",
        "courseCode": "62400",
        "instructor": [
            "Xiang Zhou"
        ],
        "description": "Supervised use of personal and/or career counseling and assessment applied to complex and difficult client situations.  Critical analysis of counseling supervision theories.  Prerequisite: EDPS 61400.  Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "The Behavior Analyst As Supervisor",
        "subjectCode": "EDPS",
        "courseCode": "62800",
        "instructor": [
            "Juliana Aguilar"
        ],
        "description": "This course will address the provision of supervision of behavior analysis trainees and technicians utilizing principles and procedures of applied behavior analysis. Application of goal development, behavioral skills training, and progress monitoring within a behavioral analytic framework will be explored. Must be enrolled in ABA Certificate or Masters Program. Pre-requisite: EDPS 61200. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Research Procedures In Education",
        "subjectCode": "EDPS",
        "courseCode": "63000",
        "instructor": [
            "Yingying Jiang"
        ],
        "description": "Development of a philosophy of educational research and consideration of the methods for the selection and evaluation of techniques used in educational research. Techniques discussed are methods to control variables, sampling procedures, data collection procedures, statistical procedures, and research proposal development and writing.  Prerequisite: EDPS 53300, (PSY 60100 or EDPS 53300), STAT 50200.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Gifted Ed Seminar",
        "subjectCode": "EDPS",
        "courseCode": "63100",
        "instructor": [
            "Nielsen Ls Pereira"
        ],
        "description": "This seminar seeks to promote professionalism, research and scholarly productivity and collegial support among graduate students in gifted, creative (GCT), and talented studies, associated graduate students, visiting scholars, and interested others. A secondary purpose involves assisting GCT students, COE students, and associates with successful study and career preparation by focusing on research, grants, thesis preparation, graduate writing, proposal development, professional development, and degree completion. Finally, seminar offers students the opportunity to discuss, learn and mess around with current issues in the field and of personal interest. Seminar creates time and incentive for students to become more productive with their scholarship efforts, and offers students credit for work completed and formal support for the professional development and scholarship processes. In this course students should expect to attend, contribute, and participate. A variety of formats will be used, including, but not limited to: discussion, simulations, group work, lecture, guest speakers, and peer feedback. Prerequisite: EDPS 63000 and one graduate course in Statistics.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Meta-Analysis",
        "subjectCode": "EDPS",
        "courseCode": "63200",
        "instructor": [
            "Yukiko Maeda",
            "Anne Traynor"
        ],
        "description": "Experimental, field study, scientific survey, and prediction study methods in education. Internal and external validity, identification and development of research problems, criteria development, common methodological errors, strategies of analysis, and sources of acceptable educational research literature will be reviewed. Critical analyses of the research methodology of educational research reports in the student's field.  Prerequisite:  EDPS 63000 or 53300 and course work in Statistics.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Item Response Theory",
        "subjectCode": "EDPS",
        "courseCode": "63600",
        "instructor": [
            "Hua-Hua Chang"
        ],
        "description": "Models and model-data fit, estimation of ability and item parameters, item and test information, test construction, obtaining evidence of test reliability and validity, differential item functioning, norming, and equating.   Prerequisite:  EDPS 53100, (PSY 60100 or STAT 50200 or 51200).",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Review And Implications Of Research In Special Education",
        "subjectCode": "EDPS",
        "courseCode": "66100",
        "instructor": [
            "Yan Ping Xin"
        ],
        "description": "Investigation and research in (1) special issues; (2) mental retardation; (3) learning disabilities; (4) emotional disturbance; (5) early education for exceptional children; (6) curriculum development; (7) career education; (8) parent education; and (9) other relevant topics. One or more topics are dealt with in each enrollment period.  Prerequisite: Must have post-master's status.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    }
]