[
    {
        "title": "First-Year Composition",
        "subjectCode": "ENGL",
        "courseCode": "10600",
        "instructor": [
            "Michelle E Parsons-Powell",
            "Wendy Kay Hammer",
            "Sae Na Hong",
            "Dylan Lee Henderson",
            "Harris J Bras",
            "Michael Douglas Johnson",
            "Sidney Ducleroir",
            "Beth A Jones",
            "George Travis Hein"
        ],
        "description": "This 4-credit hour composition course includes student-teacher conferences. Students in this course produce between 7,500-11,500 words of polished writing (or 15,000-22,000 total words, including drafts or the equivalent). Within the course, students will learn to write with a rhetorical awareness of diverse audiences, situations, and contexts; critically think about writing and rhetoric through reading, analysis, and reflection; provide constructive feedback and incorporate feedback into their own writing; perform research and evaluate sources to support claims; and engage multiple digital technologies for different purposes.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Accelerated First-Year Composition",
        "subjectCode": "ENGL",
        "courseCode": "10800",
        "instructor": [
            "Catherine Jean Shukle",
            "Jacob William Baumgartner",
            "Thomas E Daniel",
            "Jessica A Weatherford",
            "Carla B Rosell",
            "Jessica M Mercado"
        ],
        "description": "In this 3-credit hour composition course students should expect an emphasis on self-guided work. Students in this course produce between 7,500-11,500 words of polished writing (or 15,000-22,000 total words, including drafts or the equivalent). Within the course, students will learn to write with a rhetorical awareness of diverse audiences, situations, and contexts; critically think about writing and rhetoric through reading, analysis, and reflection; provide constructive feedback and incorporate feedback into their own writing; perform research and evaluate sources to support claims; and engage multiple digital technologies for different purposes.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "American Language And Culture For International Students I",
        "subjectCode": "ENGL",
        "courseCode": "11000",
        "instructor": [
            "Parvaneh Rezaee",
            "Heejeon K Bras"
        ],
        "description": "The course takes a social science-based approach to investigating the American university by examining contemporary college life, the history of the American academy, social and environmental issues on campus, and opportunities for engagement with the wider community. Students will improve their speaking, listening, reading, writing skills in English so that they can actively participate in social and academic communication.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "American Language And Culture For International Students II",
        "subjectCode": "ENGL",
        "courseCode": "11100",
        "instructor": [
            "Deborah Hannah Bush",
            "Jacob Russell Spears",
            "Nadezda Pimenova",
            "Armand Edward Affricano",
            "Ty C Climer",
            "Negin H Goodrich",
            "Charles Allen Brown",
            "Stephen W Moriarty",
            "Minsun Kim",
            "Haiyan Li"
        ],
        "description": "Students will continue to develop the foundational language skills and knowledge that they need to succeed in their other classes at Purdue and to prepare for further academic and professional opportunities. Students will also deepen their understanding of American culture and improve their ability to think about cultural differences in positive ways. In a sense, this class will be a bridge to help you transition to other language-intensive courses at Purdue where you need to read, write, and speak frequently and/or work in groups (such as business, engineering, literature, public speaking, and social sciences).",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Engaging English",
        "subjectCode": "ENGL",
        "courseCode": "20200",
        "instructor": [
            "Paul Ryan Schneider",
            "Michael Robert Johnston"
        ],
        "description": "This theme-based course introduces students to the field of English, and provides foundational liberal arts skills. It teaches, for instance, critical and creative thinking, reading, and writing using a variety of genres, texts, and media.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Research For Professional Writers",
        "subjectCode": "ENGL",
        "courseCode": "20300",
        "instructor": [
            "Patricia A Sullivan"
        ],
        "description": "Introduction to research sources and methods useful for professional writers, including electronic resources. Focus on collecting print and online information, interviewing, surveying, and conducting observations; and on evaluating, summarizing, analyzing, and reporting research.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Science Fiction Writing",
        "subjectCode": "ENGL",
        "courseCode": "20400",
        "instructor": [
            "Casey M Gray"
        ],
        "description": "A course in writing, with the special topic selected by the instructor.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Creative Writing",
        "subjectCode": "ENGL",
        "courseCode": "20500",
        "instructor": [
            "Aiya Yasir Sakr",
            "Monir Gholamzadeh Bazarbash",
            "Joshua Albert Brewer",
            "Melissa Ann Fraterrigo",
            "Casey M Gray",
            "Kanika Ahuja"
        ],
        "description": "Practice in writing short prose narratives and poetry for students who have finished composition and wish to develop their skills further. Workshop criticism.  CTL:IEL 1230 Introduction To Creative Writing",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Inventing Languages",
        "subjectCode": "ENGL",
        "courseCode": "21500",
        "instructor": [
            "Elaine J Francis"
        ],
        "description": "\"Invented languages\" include linguistic systems created for fictional worlds, such as Dothraki (Game of Thrones), Na'vi (Avatar), Elvish (Lord of the Rings) and Klingon (Star Trek), as well as languages invented for international communication by real speakers, such as Esperanto. In this course, you will study these systems, learn the major properties of natural human languages, and construct your own rudimentary languages.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Figures Of Myth And Legend I: Monsters",
        "subjectCode": "ENGL",
        "courseCode": "21700",
        "instructor": [
            "Shaun F D Hughes"
        ],
        "description": "This course traces specific monster case studies across a variety of genres and media from the ancient to the modern period. It explores the way monsters define and police the boundaries of what it means to be human, and provide a common language for crystallizing specific social, ethnic, and national practices.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Elements Of Linguistics",
        "subjectCode": "ENGL",
        "courseCode": "22700",
        "instructor": [
            "Chien-Min Kuo",
            "Eunice Opoku",
            "Golsa Khodadadi",
            "Vanessa Sheu"
        ],
        "description": "A summary of what is known about human language, its structure, its universality, and its diversity; language in its social setting; language in relation to other aspects of human inquiry and knowledge. Credit will not be awarded for both ENGL 22700 and LC 26100. CTL:IEL 1260 Introduction To Linguistics",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Great Narrative Works",
        "subjectCode": "ENGL",
        "courseCode": "23000",
        "instructor": [
            "Wendy S Flory"
        ],
        "description": "Reading and discussion of great narratives from Homer's Odyssey to the present, considering works from a variety of cultures and time periods in order to develop an understanding of their ideas, structures, styles, and cultural values.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Intro To Islamic Civ & Cul",
        "subjectCode": "ENGL",
        "courseCode": "23200",
        "instructor": [
            "Ahmed Idrissi Alami"
        ],
        "description": "Examination of a particular theme, such as the hero, death, or the city, and the techniques by which it is treated in various literary works, usually in more than one genre. Current offerings available from counselors.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Literature And The Environment",
        "subjectCode": "ENGL",
        "courseCode": "23400",
        "instructor": [
            "Geraldine S Friedman"
        ],
        "description": "Literary study of nature writing; writing from the natural sciences; and canonical poetry, fiction, and essays through an ecological lens.  Introduces students to ecocritical thought and environmental literary history.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Fiction",
        "subjectCode": "ENGL",
        "courseCode": "23800",
        "instructor": [
            "Daniel C Morris",
            "Arkady Plotnitsky"
        ],
        "description": "Reading and discussion of fiction from different periods aimed at enhancing the student's understanding of genre, form, and style; how fiction grows out of and speaks to its historical moment; and how fiction addresses pressing social issues.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "British Literature Before 1789",
        "subjectCode": "ENGL",
        "courseCode": "24000",
        "instructor": [
            "Michael Robert Johnston"
        ],
        "description": "A historically oriented survey of genres, authors, and texts from the medieval to the Romantic period.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Great American Books",
        "subjectCode": "ENGL",
        "courseCode": "25000",
        "instructor": [
            "Daniel C Morris"
        ],
        "description": "What makes great American books so compelling? This course examines the dynamic history of American literature and explores how canonical and contemporary books have shaped the cultural landscape of the U.S. and the world.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Greek And Roman Classics In Translation",
        "subjectCode": "ENGL",
        "courseCode": "26200",
        "instructor": [
            "Charles Steele Campbell"
        ],
        "description": "Study of important works of Greek and Roman literature, their intrinsic literary values, and their influence on later European and American writing and thinking.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "World Literature: From 1700 A.D. To The Present",
        "subjectCode": "ENGL",
        "courseCode": "26700",
        "instructor": [
            "Ching Jen Sun"
        ],
        "description": "(CMPL 26700) World literature in translation. A comparative and chronological survey of the masterpieces of Eastern and Western literature.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "The Movies",
        "subjectCode": "ENGL",
        "courseCode": "28600",
        "instructor": [
            "Paul W White",
            "Alexandra McKindrick Anderson"
        ],
        "description": "Introduction to the movies from classic to contemporary films.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Ways Of Reading",
        "subjectCode": "ENGL",
        "courseCode": "30100",
        "instructor": [
            "Arkady Plotnitsky"
        ],
        "description": "Introduction to literary theory and practice. Close reading of and significant writing about selected literary texts informed by a variety of critical and/or theoretical perspectives.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Composition",
        "subjectCode": "ENGL",
        "courseCode": "30400",
        "instructor": [
            "Linda E Haynes"
        ],
        "description": "Designed for students who wish additional training in composition beyond the basic requirements. Extensive practice in the writing of mature expository, critical, and argumentative prose. (The course satisfies the Indiana certification requirement of three hours of advanced composition.)",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Professional Writing",
        "subjectCode": "ENGL",
        "courseCode": "30600",
        "instructor": [
            "Michael J Salvo"
        ],
        "description": "Development of skill in analyzing rhetorical situations in the workplace. Practice in planning, writing, evaluating, and revising a variety of documents typical of those used in the arts and industry.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Digital Design And Production",
        "subjectCode": "ENGL",
        "courseCode": "30900",
        "instructor": [
            "Jessica Erin Berchtold"
        ],
        "description": "The development of the ability to write and design documents using electronic publishing technologies. Students will receive instruction in writing, graphics, and publishing software and will write, design, produce, and critique a number of publications.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Craft Of Fiction From A Writer's Perspective",
        "subjectCode": "ENGL",
        "courseCode": "31600",
        "instructor": [
            "Sharon D Solwitz"
        ],
        "description": "This course focuses on the craft of fiction with some consideration of its underlying principles from a writer's perspective.  Topics of study may include works of fiction, statements of aesthetics and craft, and various fictional forms.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Craft Of Poetry From a Writer's Perspective",
        "subjectCode": "ENGL",
        "courseCode": "31700",
        "instructor": [
            "Aiya Yasir Sakr"
        ],
        "description": "This course focuses on the craft of poetry with some consideration of its underlying principles from a writer's perspective.  Topics of study may include works of poetry, statements of aesthetics and craft, and various poetic forms.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Word, Image, Media",
        "subjectCode": "ENGL",
        "courseCode": "32200",
        "instructor": [
            "Christopher J Lukasik"
        ],
        "description": "This course explores what images are, how they mean, and how they interact with literature, language, technology, and culture. From decoding advertising images to determining the truth of digital photography, this course will explore a broad range of questions in a variety of contemporary contexts such as new media, vision as information processing, and biometrics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "English Language II: Structure And Meaning",
        "subjectCode": "ENGL",
        "courseCode": "32800",
        "instructor": [
            "Elena E Benedicto"
        ],
        "description": "The structure of American English and its dialects, with emphasis on syntax and semantics, including parts of speech, sentence structure, and meaning. Implications of recent theory for the teaching of English. Credit will not be given for both ENGL 32800 and LING 32100.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "English Language III: Sound And Form",
        "subjectCode": "ENGL",
        "courseCode": "32900",
        "instructor": [
            "Olga Dmitrieva"
        ],
        "description": "The structure of American English and its dialects, with emphasis on phonology and morphology. Implications of recent theory to the teaching of English.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Games And Diversity",
        "subjectCode": "ENGL",
        "courseCode": "33000",
        "instructor": [
            "Samantha Blackmon"
        ],
        "description": "This course looks critically at diversity in games, game development, and in the larger mainstream games community. Students will analyze and play games that related to women, minorities, members of the LGBTQ community, and/or those who lack access because of disability.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Environmental Ethics, Policy, And Sustainability",
        "subjectCode": "ENGL",
        "courseCode": "34400",
        "instructor": [
            "Robert P Marzec"
        ],
        "description": "Environmental Ethics, Policy and Sustainability is an interdisciplinary course designed to open new pathways into ethical and eco-critical inquiry in the Anthropocene age. The course analyzes disciplinary differences in approaching the ethical, the human, and environmental problems such as sustainability, development, biodiversity, global security, and climate change. Students will explore what it means to be ethical in and through an interrogation of our contemporary conceptions of what it means to be human. These interrogations in turn will prompt us to reconsider human creations such as knowledge, culture, and technology, which will push us to genuinely think how humans as a species situate their creations within the realm of what they call Nature. Students will be introduced to the history of environmental studies in the discipline, to the rise of what is now known as \"postcolonial ecocriticism\" to theoretical inquiry into modern technology, and to other recent developments in the fields of environmental studies.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "American Literature After 1865",
        "subjectCode": "ENGL",
        "courseCode": "35100",
        "instructor": [
            "John N Duvall"
        ],
        "description": "A survey of American literature from the Civil War to the present.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Native American Literature",
        "subjectCode": "ENGL",
        "courseCode": "35200",
        "instructor": [
            "Nancy J Peterson"
        ],
        "description": "Study of literature by Native American authors in a variety of genres-novels, short stories, poetry, autobiography--using literary analysis, as well as historical, legal, and ethnographic materials.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Asian American Literature",
        "subjectCode": "ENGL",
        "courseCode": "35400",
        "instructor": [
            "Aparajita Sagar"
        ],
        "description": "Study of Asian American Literature covering issues such as immigration, identity, class, and gender.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Black Drama",
        "subjectCode": "ENGL",
        "courseCode": "35800",
        "instructor": [
            "Paul Ryan Schneider"
        ],
        "description": "A critical analysis and discussion of selected representative works by African American dramatists - from William Wells Brown to the moderns.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Gender And Literature",
        "subjectCode": "ENGL",
        "courseCode": "36000",
        "instructor": [
            "Geraldine S Friedman"
        ],
        "description": "An introduction to feminist approaches to the study of literature, including poetry, drama, fiction, and/or autobiography. Examines how gender intersects with race, ethnicity, sexual orientation, and class in shaping authorship, reading, and representation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Mystery And Detective Fiction",
        "subjectCode": "ENGL",
        "courseCode": "36700",
        "instructor": [
            "Shaun F D Hughes"
        ],
        "description": "An introduction to the detective genre, examining its origins, its characteristics, and its intersections with empiricism, forensic science, race, class, gender, sex, and empire.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Science Fiction And Fantasy",
        "subjectCode": "ENGL",
        "courseCode": "37300",
        "instructor": [
            "Thomas E Daniel"
        ],
        "description": "Representative works of science fiction and fantasy examined in relation to both mainstream and popular literature. Emphasis is on technique, theme, and form.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Issues In Rhetoric And Public Life",
        "subjectCode": "ENGL",
        "courseCode": "38000",
        "instructor": [
            "Harry C Denny"
        ],
        "description": "Study of how language and media create belief and change. Examines ancient and contemporary rhetorical theory as it applies to public discourse, media, and technology.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Practicum In Tutoring Writing",
        "subjectCode": "ENGL",
        "courseCode": "39000",
        "instructor": [
            "Jacob William Baumgartner"
        ],
        "description": "A practicum to teach undergraduates to teach writing in the one-to-one setting of a writing lab.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Young Adult Literature",
        "subjectCode": "ENGL",
        "courseCode": "39200",
        "instructor": [
            "Mary Ellen Lennon"
        ],
        "description": "This course examines the construct of Young Adult Literature as a genre crafted specifically for adolescents. Using both classic and contemporary novels, as well as relevant theoretical and research texts, this course explores how YA literature is defined, what it offers to adolescent readers, and how it is situated in the literary landscape.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Games Writing, Writing Games",
        "subjectCode": "ENGL",
        "courseCode": "39600",
        "instructor": [
            "Samantha Blackmon",
            "Olga V Lyanda-Geller"
        ],
        "description": "A course in the study of a special topic directed by an instructor in whose particular field of specialization the content of the course falls.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Review Writing",
        "subjectCode": "ENGL",
        "courseCode": "40600",
        "instructor": [
            "Thomas J Rickert"
        ],
        "description": "Intensive practice in the writing of book, film, and theatre criticism, as well as reviews of musical programs and art exhibits. Readings in critics to serve as possible models. Audience analysis of newspapers and periodicals that would be potential markets.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Intermediate Poetry Writing",
        "subjectCode": "ENGL",
        "courseCode": "40700",
        "instructor": [
            "Adam B Giannelli"
        ],
        "description": "Study and practice of methods of composing poetry, with primary emphasis on the student's own work. Workshop criticism and discussion of published writing.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Intermediate Fiction Writing",
        "subjectCode": "ENGL",
        "courseCode": "40900",
        "instructor": [
            "Sharon D Solwitz",
            "Brian J Leung"
        ],
        "description": "Study and practice of methods of composing fiction, with a primary emphasis on the student's own work. Workshop criticism and discussion of published fiction.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Cont Am Writers Re-Memory Past",
        "subjectCode": "ENGL",
        "courseCode": "41300",
        "instructor": [
            "Nancy J Peterson"
        ],
        "description": "A study of literature or film produced during a well-defined historical period from the view of its social, political, religious, and economic contexts. A project-based capstone seminar containing a significant research component. May be repeated for credit only with a different topic.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Studies In Literature And Culture",
        "subjectCode": "ENGL",
        "courseCode": "41400",
        "instructor": [
            "Aparajita Sagar"
        ],
        "description": "A study of literature or film from the perspective of the cultural norms and values it expresses, celebrates, and challenges. A project-based capstone seminar containing a significant research component. May be repeated for credit only with a different topic.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Multimedia Writing",
        "subjectCode": "ENGL",
        "courseCode": "41900",
        "instructor": [
            "Christopher Joseph Barber",
            "Robert Steven Beck"
        ],
        "description": "Multimedia writing for networked contexts. Emphasizes principles, and practices of multimedia design, implementation, and publishing. Typical genres include Web sites, interactive media, digital video, visual presentations, visual argument, and user documentation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Business Writing",
        "subjectCode": "ENGL",
        "courseCode": "42000",
        "instructor": [
            "Melissa Kay Defrench"
        ],
        "description": "Workplace writing in networked environments for management contexts. Emphasizes organizational context, project planning, document management, ethics, research, team writing. Typical genres include management memos, reports, letters, e-mail, resumes (print and online), oral presentations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Technical Writing",
        "subjectCode": "ENGL",
        "courseCode": "42100",
        "instructor": [
            "Michael J Salvo",
            "Dan Mccormick",
            "Tracy L Clark",
            "Elizabeth A Jendrzey"
        ],
        "description": "Workplace writing in networked environments for technical contexts. Emphasizes context and user analysis, data analysis/display, project planning, document management, usability, ethics, research, team writing. Typical genres include technical reports, memos, documentation, Web sites.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Writing For The Health And Human Sciences",
        "subjectCode": "ENGL",
        "courseCode": "42201",
        "instructor": [
            "Kaden C Milliren"
        ],
        "description": "This course applies rhetorical principles to writing in health, hospitality, nutrition, nursing and related fields in the Health and Human Sciences.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Writing For High Technology Industries",
        "subjectCode": "ENGL",
        "courseCode": "42400",
        "instructor": [
            "Patricia A Sullivan"
        ],
        "description": "Applies principles of effective professional writing to the planning, production, and evaluation of computer user manuals and other writing tasks.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Writing Proposals And Grants",
        "subjectCode": "ENGL",
        "courseCode": "43300",
        "instructor": [
            "C Bradley Dilger"
        ],
        "description": "Writing Proposals and Grants is a professional writing workshop that teaches students to write workplace proposals and grants in for-profit and not-for-profit companies and organizations. Students will also learn how to write business plans, a specialized form of proposal.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Internship In Professional Writing",
        "subjectCode": "ENGL",
        "courseCode": "48800",
        "instructor": [
            "Jennifer L Bay"
        ],
        "description": "This course provides on-the-job experience in various kinds of professional writing, combined with a seminar in applied rhetoric. Students work in selected internship settings, participate in seminar discussions of their work, and read selections appropriate to their internship. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            6
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Literature In The Secondary Schools",
        "subjectCode": "ENGL",
        "courseCode": "49200",
        "instructor": [
            "Kelly Jo Carpenter"
        ],
        "description": "Exploration of the theory, research and pedagogy supporting the teaching of literature at the secondary level. Topics include text selection, instructional strategies, adolescent literacy, student engagement and the use of alternative texts.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Prac Teach Cr Writing",
        "subjectCode": "ENGL",
        "courseCode": "50200",
        "instructor": [
            "Donald O Platt"
        ],
        "description": "Reading professional literature, preparing syllabi; evaluating student papers, leading discussions. Required of all teaching assistants in their initial semesters.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Approaches/Creative Wr",
        "subjectCode": "ENGL",
        "courseCode": "50500",
        "instructor": [
            "Donald O Platt"
        ],
        "description": "Reading professional literature on the teaching of writing, linguistics, and ESL. Studies of methodologies, issues of assessment, and the relationship between theory and pedagogy. This course is not part of the degree requirement. Open only to teaching assistants in the Department of English. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Poetry Writing",
        "subjectCode": "ENGL",
        "courseCode": "50700",
        "instructor": [
            "Donald O Platt"
        ],
        "description": "Study and practice of advanced methods of composing poetry, with primary emphasis on the student's own work. Workshop criticism and discussion of published writing.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Semantics",
        "subjectCode": "ENGL",
        "courseCode": "51100",
        "instructor": [
            "Ronnie B Wilbur"
        ],
        "description": "(AUSL 58800) An introduction to and survey of current semantic theories and methods with an emphasis on English. Basic concepts of linguistic semantics and its relation to the other semantics. Compositional (transformational), model-theoretical (truth-conditional), pragmatic, and contextual semantics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Teaching English As A Second Language: Principles And Practices",
        "subjectCode": "ENGL",
        "courseCode": "51800",
        "instructor": [
            "Clyde Joseph Sorell"
        ],
        "description": "Studies of issues and principles in ESL/EFL program development. Emphasis is on practical application of theory in a variety of English learning and teaching contexts in the U.S. and abroad.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Modern American Poetry",
        "subjectCode": "ENGL",
        "courseCode": "56000",
        "instructor": [
            "Wendy S Flory"
        ],
        "description": "A survey of modern American poetry. Emphasis will be on major writers such as Eliot, Pound, Frost, Stevens, and Lowell, but attention will be paid to lesser figures.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Historical Linguistics",
        "subjectCode": "ENGL",
        "courseCode": "56300",
        "instructor": [
            "John D Sundquist"
        ],
        "description": "(ANTH 56300, LC 56300) A survey of mechanisms and motivations of linguistic change. Topics include: phonological, morphological, semantic and syntactic change, comparative and internal reconstruction, linguistic variation, language contact, and linguistic typology.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Sociolinguistics",
        "subjectCode": "ENGL",
        "courseCode": "56500",
        "instructor": [
            "Felicia D Roberts"
        ],
        "description": "(ANTH 56500, COM 56500, LC 56500, LING 56500) An introduction to language in its social context, focusing on uses and users of language. Topics include social class, ethnic group, gender, language attitudes, and bilingualism.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Semiotics",
        "subjectCode": "ENGL",
        "courseCode": "57000",
        "instructor": [
            "Myrdene Anderson"
        ],
        "description": "(ANTH 51900, AUSL 58900, COM 50700, LC 57000)  The study of languages, literatures, and other systems of human communication. Includes a wide range of phenomena which can be brought together by means of a general theory of signs. The course deals with three fundamental areas: 1) verbal communication, 2) nonverbal communication (iconic systems, gestures, body language, etc.), and 3) communication through art forms. Typically offered Fall Spring.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Teaching Literature At The College Level",
        "subjectCode": "ENGL",
        "courseCode": "60100",
        "instructor": [
            "Derek Andrew Pacheco"
        ],
        "description": "Focuses on the practical and theoretical issues related to teaching literature at the college level. Topics include course design, literary canons and text selection, teaching and learning styles, close reading, writing about literature, assessment, and professional ethics. Prerequisite: ENGL 50100 or consent of department. Restricted to graduate students in the Department of English.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Seminar In Poetry Writing",
        "subjectCode": "ENGL",
        "courseCode": "60600",
        "instructor": [
            "Adam B Giannelli"
        ],
        "description": "An advanced course in the writing of poetry. Workshop criticism. Study of the work of established writers. Prerequisite: admission to the MA program in creative writing.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Classroom Communication In ESL For Teaching Assistants",
        "subjectCode": "ENGL",
        "courseCode": "62000",
        "instructor": [
            "Alex Russell Dunn",
            "Kyle Robert Swanson",
            "Judson Criswell Wright",
            "Beth A Lageveen",
            "Xiaorui Li"
        ],
        "description": "Student must be enrolled in the Graduate School and a non-native speaker of English. Permission of department required.",
        "capacity": 0,
        "credits": [
            5,
            5
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Written Communication For International Graduate Students",
        "subjectCode": "ENGL",
        "courseCode": "62100",
        "instructor": [
            "Harris J Bras"
        ],
        "description": "A course in English composition for non-native English-speaking graduate students.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Syntax II",
        "subjectCode": "ENGL",
        "courseCode": "62700",
        "instructor": [
            "Elaine J Francis",
            "Elena E Benedicto"
        ],
        "description": "Investigation of a topic in advanced linguistics research.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Sem In Black Feminist Studies",
        "subjectCode": "ENGL",
        "courseCode": "69600",
        "instructor": [
            "Jennifer Lynn Freeman Marshall"
        ],
        "description": "Advanced study of special subjects.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    }
]