[
    {
        "title": "Environmental Science And Conservation",
        "subjectCode": "FNR",
        "courseCode": "12500",
        "instructor": [
            "John B Dunning"
        ],
        "description": "(AGRY 12500, EAPS 12500, NRES 12500) Introduction to environmental science and conservation includes topics in ecological principles, conservation and natural resource management, human impacts on the environment, toxic waste disposal, climate change, energy, air and water pollution, environmental geology and geologic hazards.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Marine Biology",
        "subjectCode": "FNR",
        "courseCode": "20100",
        "instructor": [
            "Scott T Koenigbauer"
        ],
        "description": "An introduction to the major groups of marine organisms and their habitats. Emphasis on application of ecological principles to the conservation of important marine species. Offered in even-numbered years.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Natural Resource Information Management",
        "subjectCode": "FNR",
        "courseCode": "21000",
        "instructor": [
            "Brady S Hardiman"
        ],
        "description": "Introduction to natural resource and land information systems and data management technologies. Principles of data storage, organization, and retrieval for both textual and spatial data (geographic information systems), data acquisition, accuracy assessment, mapping, and use of this data in natural resource management are presented.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Ecology And Systematics Of Mammals And Birds",
        "subjectCode": "FNR",
        "courseCode": "25150",
        "instructor": [
            "John B Dunning"
        ],
        "description": "Introduction to the ecology and systematics of mammals and birds. Discuss the evolutionary adaptations and ecological processes of these vertebrate groups at the individual, population, and community levels. Examine the roles of phylogeny, physiology, morphology, and behavior in influencing organismal responses to the environment. Assess issues related to the conservation of mammals and birds.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Landscape-Level Planning",
        "subjectCode": "FNR",
        "courseCode": "27000",
        "instructor": [
            "Kara A Salazar"
        ],
        "description": "The main objective of this course is to teach students about natural resources planning with an emphasis on critical skills for developing landscape-level management plans. This one credit course uses guest speakers, lectures, in-class activities, group presentations and take-home assignments to facilitate student learning.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Global Sustainability Issues",
        "subjectCode": "FNR",
        "courseCode": "30200",
        "instructor": [
            "Eva Haviarova"
        ],
        "description": "This course explores global sustainability issues in natural resources with emphasis on forestry, wood products manufacturing, conservation, water management, energy and their impact on the targeted geographic location (such as Central America, Eastern Europe) and the rest of the world. The purpose of this course is to present students, regardless of their disciplinary background, with an overview of the interdisciplinary aspects of sustainable natural resource management. This colloquium course will examine global sustainable natural resources and related issues (including population, poverty, pollution, climate change, deforestation, invasive species, urbanization, habitat loss, cultural traditions, water management, energy, education, technology, and international collaboration).",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Identification And Basic Properties Of Wood",
        "subjectCode": "FNR",
        "courseCode": "31110",
        "instructor": [
            "Eva Haviarova"
        ],
        "description": "The identification of macro characteristics of North American wood species and discussion of their availability, distribution, and unique characteristics. Basic physical, mechanical and working properties of wood, including orthotropic nature of wood, grain, texture, moisture content, shrinking, specific gravity, machining, thermal properties, electrical properties, strength prosperities, natural characteristics affecting mechanical properties, also the effect of manufacturing and service environment on mechanical properties through laboratory exercises and field trips. Students will study the cellular structure and arrangement of woody biomaterials, their manufacturing characteristics and uses.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Wildlife Investigational Techniques",
        "subjectCode": "FNR",
        "courseCode": "34800",
        "instructor": [
            "Elizabeth A Flaherty"
        ],
        "description": "An introduction to current wildlife research techniques that are used in managing populations and habitats. Laboratory and field exercises are used to gather and analyze data; basic data analysis and written dissemination of results is emphasized.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Natural Resources Measurement",
        "subjectCode": "FNR",
        "courseCode": "35300",
        "instructor": [
            "Songlin Fei"
        ],
        "description": "An introduction to sampling techniques and fundamental principles for measuring natural resources.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Quantitative Methods For Resource Management",
        "subjectCode": "FNR",
        "courseCode": "35500",
        "instructor": [
            "Jingjing Liang"
        ],
        "description": "Application of analytical and computational techniques for the purpose of making decisions regarding the management of forests.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Human Dimensions of Natural Resource Management",
        "subjectCode": "FNR",
        "courseCode": "37500",
        "instructor": [
            "Zhao Ma"
        ],
        "description": "An introduction to the human dimensions of forestry, wildlife, and recreation; students will learn how values, attitudes, community, and behavior relate to natural resource management and decision-making; various natural resource management stakeholders such as private landowners, natural resource agencies, the judiciary, and environmental and natural resource interest groups will be discussed; course will utilize case studies specific to Indiana and the Midwest; course includes weekly discussions during recitations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Statistics For Natural Resources",
        "subjectCode": "FNR",
        "courseCode": "38400",
        "instructor": [
            "TBA"
        ],
        "description": "Methods of statistical analysis and modeling for data and problems encountered in natural resources conservation, science and management. Emphasis is on application of methods and interpretation of results in the context of natural resource problems. Topics include introductory sampling design, exploratory analyses, general linear models, generalized linear models, introduction to resampling methods, likelihood-based model selection, and model goodness-of-fit.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Fish Biology And Ecology",
        "subjectCode": "FNR",
        "courseCode": "38500",
        "instructor": [
            "Paris D Collingsworth"
        ],
        "description": "Advanced study of the biology and ecology of fishes. In particular, the course covers aspects of the morphology, physiology, development, behavior, evolution, and diversity of fishes throughout the world. The relationship of fishes to the physical, chemical, and biological features of the environment in both natural and perturbed aquatic ecosystems will be explored. An emphasis will be placed on diversity in morphology, behavior, feeding, and reproductive strategies as they relate to individual, population, community structure, and anthropogenic effects.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Forest Economics",
        "subjectCode": "FNR",
        "courseCode": "40700",
        "instructor": [
            "Mo Zhou"
        ],
        "description": "Implications of unique economic characteristics of forest resources, including a tree as both capital and output, high capital-to-output ratio, location utility of in-forest uses, long investment periods, and non-market outputs.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Forest Resources Management",
        "subjectCode": "FNR",
        "courseCode": "40910",
        "instructor": [
            "Mo Zhou"
        ],
        "description": "This course focuses on the long-term sustainable management of forests for the production of wood fiber, ecological services, and other market and non-market goods and services.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Human-Wildlife Conflicts",
        "subjectCode": "FNR",
        "courseCode": "43200",
        "instructor": [
            "Lee A Humberg"
        ],
        "description": "Exploration of conflicts between human interests and wildlife and the regulations policies and legislation used to minimize conflicts. Negative interactions may be real or perceived, economic or aesthetic, social or political, and may pose risks to human health and safety. Emphasis on the causes of conflict and resolutions that seek to balance protection or conservation of wildlife with protection of other public resources and individual property owners. Prior knowledge of college-level general biology and ecology is expected.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Grand Challenges In Forest Management",
        "subjectCode": "FNR",
        "courseCode": "43300",
        "instructor": [
            "Michael A Jenkins"
        ],
        "description": "This course will guide students through readings, discussions, and presentations of the grand challenges that face the field of forest management. These topics will vary with each iteration of the class but may include topics such as climate change, invasive species, pressure on forest lands from a growing population, altered disturbance regimes, development of new silvicultural techniques, economic pressure at multiple scales, and shifting public perceptions on the management of forests. Students will examine and discuss these challenges from the vantage points of multiple stakeholders to gain insight into their complexity and importance. Students will read and discuss on average 2-4 research or review articles, book chapters, or other sources per week.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Aquaculture",
        "subjectCode": "FNR",
        "courseCode": "45200",
        "instructor": [
            "TBA"
        ],
        "description": "Historical perspectives and current practices in aquaculture, including production systems, feeds, water quality requirements, and diseases of commercially important species.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Marine Biology",
        "subjectCode": "FNR",
        "courseCode": "45800",
        "instructor": [
            "Reuben R Goforth"
        ],
        "description": "Focus is placed on the structure and function of major marine ecosystems, including estuarine, mangrove, coastal, coral reef, open ocean, and deep ocean environments. Course content will include rigorous treatment of the biogeochemical processes that support these ecosystems, as well as the biology and ecology of characteristic flora and fauna.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Ecological Sensors And Data",
        "subjectCode": "FNR",
        "courseCode": "49800",
        "instructor": [
            "Jarred M Brooke",
            "Maria Soledad Sepulveda",
            "Jacob Daniel Hosen"
        ],
        "description": "Topics vary. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Theory And Application Of Natural Resource Extension Programming",
        "subjectCode": "FNR",
        "courseCode": "50600",
        "instructor": [
            "Brian J Macgowan"
        ],
        "description": "This course will provide an opportunity for students to develop and implement extension activities based on their research interests. The course will focus on important natural resources issues, identify common target audiences, provide examples of extension programming, discuss outputs developed from various extension programs, and outline metrics used to evaluate program impact.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Disease Ecology",
        "subjectCode": "FNR",
        "courseCode": "52900",
        "instructor": [
            "Jason T Hoverman"
        ],
        "description": "Study of the ecological and evolutionary complexity inherent to host-pathogen interactions. Includes case studies from a diverse array of systems, including plants, animals, aquatic and terrestrial systems. Emphasis is on the interactions between multiple hosts and pathogens within complex, dynamic environments. Introduction to parasite and pathogen diversity, host-pathogen coevolution, community ecology and the importance of pathogens in conservation and management.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Ecology Of Disturbance",
        "subjectCode": "FNR",
        "courseCode": "53600",
        "instructor": [
            "Michael A Jenkins"
        ],
        "description": "Advanced lecture- and discussion-based class examining how disturbance shapes the composition and structure of communities and landscapes across major terrestrial biomes. Students will examine and discuss the relationships between disturbance intensity, frequency, and spatial extent and how these characteristics affect ecological processes and ecologically-based management of forest and grassland ecosystems. The class will also examine the synergistic effects of multiple disturbances and the restoration of endemic disturbance regimes in contemporary ecosystems. Course is reading intensive; students will read and discuss on average 3-8 journal articles per week. Typically offered in even years.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Mammalogy",
        "subjectCode": "FNR",
        "courseCode": "56700",
        "instructor": [
            "TBA"
        ],
        "description": "The class explores approaches to mammalian research and wildlife management through readings, discussions, field, and laboratory exercises. Topics such as mammalian behavior, ecology, phylogeny, taxonomy, and conservation are emphasized. The intention of this class is to help students who have a sincere interest in mammalian research and management to progress beyond identification in their understanding of mammals.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Big Data, AI, And Forests",
        "subjectCode": "FNR",
        "courseCode": "57400",
        "instructor": [
            "Jingjing Liang"
        ],
        "description": "  This course is focused on introductory big data analysis, artificial intelligence, and associated applications in large-scale forest research. The lecture will cover the challenges we encounter in big data ecological research, and the approaches to overcome these challenges. Real-time forest inventory and wildlife survey data at national and continental levels will be utilized in this course, and actual high-impact research projects will be introduced as case studies to inform students of the state-of-the-art in this subject area. High-performance computing clusters will be utilized for big data analysis. This course is also open to non-forestry majors. We will introduce basic machine learning techniques that are applicable to other subject areas. Guest lectures may cover big data analyses in different fields, internet-of-things, and/or data management and optimization/decimation for collaborative Virtual Reality experiences. The class will be evaluated through a final project, for which students will work independently or in a group setting to develop a 'mini' research manuscript with a title of their own selection. All the groups are encouraged to submit their manuscript for publication at peer-reviewed journals, and those whose manuscripts have passed the initial journal screening will get extra bonus points.   ",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Teaching In Natural Resources",
        "subjectCode": "FNR",
        "courseCode": "59000",
        "instructor": [
            "Elizabeth A Flaherty"
        ],
        "description": "This applied course introduces topics related to teaching science courses to facilitate and support the success of teaching assistants in Forestry and Natural Resources. Students will read and review assigned reading and then participate in a discussion at a weekly class meeting. Students also will have an opportunity to practice and apply concepts through development and presentation of a lesson plan. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Data Mgmt Best Practices-Intro",
        "subjectCode": "FNR",
        "courseCode": "59800",
        "instructor": [
            "Jacqueline M Getson"
        ],
        "description": "Subjects and problems of interest to the student. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    }
]