[
    {
        "title": "Orientation To Current Issues In Human Development And Family Science",
        "subjectCode": "HDFS",
        "courseCode": "10000",
        "instructor": [
            "Cezanne M Elias"
        ],
        "description": "  Introduction to fields related to Human Development and Family Science, including majors and career paths. You will meet faculty, alumni, and professionals working in related areas. You will be matched with an advanced student mentor who will help you learn how to become successful as a HDFS student and beyond. Required of all students majoring in the department. Non-majors interested in learning more about HDFS majors are also welcome. ",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Relationship And Family Science",
        "subjectCode": "HDFS",
        "courseCode": "20100",
        "instructor": [
            "Marissa Claire Knox",
            "Janet Marian Rhodes-Carlson"
        ],
        "description": "An examination of interpersonal processes involved in forming and maintaining quality relationships with family members and close others. Emphasis is on relationship dynamics and family functioning across the life course. Also considered are linkages between relationship and family processes and the broader social environment. Basic components of the research process will be introduced.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Human Development",
        "subjectCode": "HDFS",
        "courseCode": "21000",
        "instructor": [
            "Laura Marie Elenbaas",
            "Elliot M Friedman"
        ],
        "description": "This course provides an introduction to the development of individuals from the prenatal period to adulthood and old age. Theories and research findings related to physical growth, cognitive and language development and social and emotional development will be discussed. CTL:ISH 1021 Developmental Psychology.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Diversity In Individual And Family Life",
        "subjectCode": "HDFS",
        "courseCode": "28000",
        "instructor": [
            "Annabelle Lin Atkin",
            "Megan Nicole Norris"
        ],
        "description": "Students are introduced to aspects of individual and family life in diverse cultures, particularly racially and/or ethnically diverse families in the United States. The nature of relationships between dominant and minority cultures is considered. Implications of diversity for practice with diverse populations are emphasized throughout the course.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Guidance In Early Childhood",
        "subjectCode": "HDFS",
        "courseCode": "31000",
        "instructor": [
            "Shawna Guinevere Harbin"
        ],
        "description": "This course presents a developmental, child-centered approach to the guidance and discipline of young children, including children with disabilities. Influential theories, relevant research, and effective guidance methods for the early childhood teachers and other professionals working with young children and families, including families from different cultural and economic backgrounds, are discussed. Admitted to Gate B.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Child Development",
        "subjectCode": "HDFS",
        "courseCode": "31100",
        "instructor": [
            "Mehreen Zehra Hassan",
            "Deborah L Nichols"
        ],
        "description": "This course addresses the study of development from infancy through childhood. It includes processes of physical, cognitive, language, social, and emotional development. Processes are discussed within the framework of historical and contemporary theories and current research. In addition, it covers topics related to methodologies used in the study of infant and child development. Finally, the conditions of children in different parts of the world are considered.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Adolescent Development",
        "subjectCode": "HDFS",
        "courseCode": "31300",
        "instructor": [
            "Paul Anthony Robbins"
        ],
        "description": "An overview of the normative developmental changes that occur during adolescence, with specific attention to individual and relational adjustment.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Atypical Child Development",
        "subjectCode": "HDFS",
        "courseCode": "31400",
        "instructor": [
            "Amy J M Schwichtenberg"
        ],
        "description": "Atypical child development from conception to adolescence can emerge from genetic, medical/health, educational, psychological, and/or contextual factors. This course will survey factors (e.g., premature birth, obesity, neurodevelopmental disorders, learning difficulties, child abuse, and war) that contribute to atypical child development. It will assess how and when typical and atypical developmental trajectories diverge and the roles of measurement and intervention.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Health And Health Care For Children And Families",
        "subjectCode": "HDFS",
        "courseCode": "32500",
        "instructor": [
            "Kameron Jean Moding"
        ],
        "description": "This course discusses leading causes of child health problems as well as examines the child and family reactions and adjustment to illness and disability. A developmental perspective on coping with health problems from early childhood through adolescence is presented. An overview on global child health disparities is also addressed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Skills For Helping Professionals In Individual, Family And Group Settings",
        "subjectCode": "HDFS",
        "courseCode": "33100",
        "instructor": [
            "Davina Nicole Santos Quichocho"
        ],
        "description": "This course is an introduction to skills commonly used in helping professions, including relationship-building skills, beginning interviewing skills, and group process skills. Attention is paid to cultural competence and professional ethics. This course includes a weekly lab experience involving practice of the helping skills, as well as a service-learning project in which helping skills are used in a community setting.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Stress And Coping In Contemporary Families",
        "subjectCode": "HDFS",
        "courseCode": "33200",
        "instructor": [
            "Kimberly A Updegraff"
        ],
        "description": "Examines theoretical perspectives related to family stress and resilience in multicultural and diverse family settings, and connects these perspectives to empirical work on family dynamics, coping, and dysfunction across the lifespan. Topics such as economic stress and poverty, immigrant families, single-parent families, homeless families, adoption, military families, maltreatment, and families coping with illness are explored. The class focuses on environmental, cultural, as well as biological contributions to both risk and resilience processes in individuals and families.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Working With Parents",
        "subjectCode": "HDFS",
        "courseCode": "34100",
        "instructor": [
            "Shawna Guinevere Harbin"
        ],
        "description": "This course focuses on developing and maintaining effective relationships between parents and professionals working with children, within the context of family-centered practices. Issues related to cultural, linguistic, economic, and developmental differences that affect relations between families and professionals are examined.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Assessment And Case Management",
        "subjectCode": "HDFS",
        "courseCode": "34300",
        "instructor": [
            "Natasha D Watkins"
        ],
        "description": "This course is an introduction to case management as a service delivery approach for helping individuals and families in need.  This course provides opportunities to practice basic helping and case management skills such as building rapport, assessing client needs, developing intervention plans, professional ethics, and professional writing.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Research Design And Program Evaluation",
        "subjectCode": "HDFS",
        "courseCode": "34600",
        "instructor": [
            "Kirsten Lee Anderson",
            "Deborah L Nichols"
        ],
        "description": "This course is an introduction to research methods as used in community programs for children and families including review and application of existing research literature, generating research questions, conducting program needs assessments, evaluating processes and outcomes of existing programs, designing and interpreting applied research studies, and understanding ethical responsibilities in the use and application of research. Instruction has been designed to provide the skills necessary to use existing research and generate new data to benefit programs.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Appl Of Mindfulness & Cmpssn",
        "subjectCode": "HDFS",
        "courseCode": "39000",
        "instructor": [
            "Marissa Claire Knox"
        ],
        "description": "Supervised readings, discussion, lectures and/or research on special topics in family and individual development. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Mathematics In Preschool And Primary Grades",
        "subjectCode": "HDFS",
        "courseCode": "40600",
        "instructor": [
            "Sarah Henkel Eason"
        ],
        "description": "This course focuses on teaching mathematics in preschool and primary grade classrooms. It covers the developmental foundations and curriculum applications of mathematics teaching and includes ways to plan, implement and evaluate developmentally appropriate mathematics instructions for children with and without disabilities and children who are learning English. Field-based experiences in preschool or primary-grade classrooms are included.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Science In Preschool And Primary Grades",
        "subjectCode": "HDFS",
        "courseCode": "40900",
        "instructor": [
            "Jennifer K Finders"
        ],
        "description": "This course focuses on teaching science in preschool and primary grade classrooms. Developmental foundations and curriculum applications of science teaching including ways to plan, implement and evaluate developmentally appropriate science instruction for young children with and without disabilities and those who are learning English.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Music And Movement In Preschool And Primary Grades",
        "subjectCode": "HDFS",
        "courseCode": "41200",
        "instructor": [
            "Megan L Purcell"
        ],
        "description": "This course focuses on music and movement in preschool and primary grade classrooms. It covers the developmental foundation and curriculum applications of music and movement activities and includes ways to plan, implement and evaluate developmentally appropriate music and movement instruction for children with and without disabilities and children who are learning English.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Approaches To Early Childhood Education",
        "subjectCode": "HDFS",
        "courseCode": "41500",
        "instructor": [
            "Elizabeth C Schlesinger-Devlin"
        ],
        "description": "The historical and theoretical basis for early childhood education and early intervention is emphasized. Relations between theory and practice are examined and illustrated with model early childhood programs. Addresses cultural/developmental diversity, ethics, and standards in early childhood education and intervention.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Understanding Autism",
        "subjectCode": "HDFS",
        "courseCode": "41800",
        "instructor": [
            "Brandon M Keehn"
        ],
        "description": "(PSY 41800, SLHS 41800) This course will explore the etiology, neuroscience, diagnosis, and treatment of autism spectrum disorder (ASD). Approached from a multi-disciplinary perspective this course brings together gene, brain, and behavioral sciences with the aim of developing a better understanding of autism. The course will begin with an overview of ASD as a complex behavioral phenotype. This will include discussion of the history ASD and the expansion of the diagnostic criteria associated with the disorder. This introduction will be followed by several classes in which we will examine some of the key domains of impairment in ASD: reciprocal social interaction, language and communication, and restricted and repetitive behaviors. We will also consider the deficits associated with, but not defining of ASD, and examine co-morbid conditions frequently present in individuals with ASD. We will then address the topics of brain architecture, neurochemistry, and genetics and gene expression, all of which we will attempt to relate back to the behavioral features of autism. We will end the course with a review of treatment practices and their efficacy and an examination of impact of ASD on the family and society.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Internship & Career Preparation For Human Services",
        "subjectCode": "HDFS",
        "courseCode": "45100",
        "instructor": [
            "Cezanne M Elias"
        ],
        "description": "This course includes an overview of HDFS-related professions, self-evaluation, career search skills, exploration of internship opportunities, and professional development. Students will complete arrangements for their field placement.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Internship & Career Preparation For Developmental And Family Science",
        "subjectCode": "HDFS",
        "courseCode": "45400",
        "instructor": [
            "Cezanne M Elias"
        ],
        "description": "This course includes an overview of HDFS-related professions, self-evaluation, career search skills, exploration of internship opportunities, and professional development. Students will complete arrangements for their field placement.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Quantitative Methods II",
        "subjectCode": "HDFS",
        "courseCode": "59000",
        "instructor": [
            "Robert J Duncan"
        ],
        "description": "Special subjects for investigation and experiment according to the individual student's interest and need. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            5
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Families And Health Across The Life Course",
        "subjectCode": "HDFS",
        "courseCode": "60000",
        "instructor": [
            "Melissa M Franks"
        ],
        "description": "Interpersonal processes of family members and close others in the promotion of individual health choices and management of disease across the life course are covered. Course topics include involvement of family and close others in: health promotion and disease prevention; disease management; interactions with healthcare providers; and informal caregiving in the family context.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Family Studies",
        "subjectCode": "HDFS",
        "courseCode": "60200",
        "instructor": [
            "Shelley Margaret Macdermid Wadsworth"
        ],
        "description": "Integrative and comprehensive assessment of both classic and recent contributions in the field of family studies. Other topics include major theory and research, historical, current, and future critical issues in family studies. Prerequisite: 12 hours of social sciences including six hours of advanced undergraduate courses preparing student for the study of the family.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Quantitative Methods II: Regression",
        "subjectCode": "HDFS",
        "courseCode": "61700",
        "instructor": [
            "Robert J Duncan"
        ],
        "description": "This course has two primary goals: 1) provide students with foundational knowledge related to linear regression statistical analyses, and 2) provide students with the opportunity to practice writing, interpreting, and presenting regression analyses for the purposes of dissemination. Prerequisite: HDFS 61300 or PUBH 60100 or STAT 50100 or PSY 64600. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Interventions Across Developmental And Family Contexts",
        "subjectCode": "HDFS",
        "courseCode": "62900",
        "instructor": [
            "Catherine Alexandra McBride"
        ],
        "description": "This course will focus on the scientific foundations of designing and conducting interventions for improving the human condition across diverse developmental and family contexts. A particular emphasis in this course will be on experimental and quasi-experimental designs for making causal inferences and understanding mechanisms of intervention effects. Students will gain specific knowledge of intervention design, implementation and fidelity, and scale-up of interventions, as well as how to evaluate proposed or existing interventions. Co-design processes with intervention users and qualitative methods for understanding intervention needs and implementation will also be examined. Prerequisite: none.  ",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Graduate Student Colloquium",
        "subjectCode": "HDFS",
        "courseCode": "69700",
        "instructor": [
            "Shelley Margaret Macdermid Wadsworth"
        ],
        "description": "Research presentations by faculty members and graduate students and invited speakers. Includes attention to: (1) the responsible conduct of research, (2) professional/scholarly and teaching development, and (3) diversity, equity, and inclusion.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    }
]