[
    {
        "title": "Introduction To The Medieval World",
        "subjectCode": "HIST",
        "courseCode": "10300",
        "instructor": [
            "Melinda S Zook"
        ],
        "description": "Barbarians, kings, queens, peasants, witches, saints, teachers, students, heretics, Muslims, Jews, Christians, love, death, monks, farm life, city life, ordinary men, women, and children as Europe develops from A.D. 500 to 1500.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To The Modern World",
        "subjectCode": "HIST",
        "courseCode": "10400",
        "instructor": [
            "Deborah L Fleetham"
        ],
        "description": "Traces the expansion of Europe into the Americas, Africa, and Asia. The French Revolution, nationalism, and the development of western European states from the era of the Reformation to the present are studied.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Survey Of Global History",
        "subjectCode": "HIST",
        "courseCode": "10500",
        "instructor": [
            "Tithi Bhattacharya",
            "Rebekah A Klein-Pejsova"
        ],
        "description": "A survey of the interaction between the civilizations of Asia, Africa, Europe, and the Americas since 1500, with attention to cultural comparisons over time, and to the implications of global interdependence for the environment, health, economy, and geopolitics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "History At Work",
        "subjectCode": "HIST",
        "courseCode": "12300",
        "instructor": [
            "Of The Ford"
        ],
        "description": "Students will learn how history majors' distinctive skills and expertise can help them achieve success in many different careers. Participants will explore the value of historical thinking in daily life, including causality, contingency, and contextualization, and will refine practical reading, thinking, and communication skills crucial to career success. Permission of department required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "American History To 1877",
        "subjectCode": "HIST",
        "courseCode": "15100",
        "instructor": [
            "Trenton C Jones"
        ],
        "description": "A study of the development of American political, economic, and social institutions from the early explorations and colonial settlements through Reconstruction. CTL:ISH 1010 American History I",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "United States Since 1877",
        "subjectCode": "HIST",
        "courseCode": "15200",
        "instructor": [
            "Randy W Roberts",
            "Jonathan Dean Soucek"
        ],
        "description": "A study of the growth of the United States from 1877 to the present. The new industrialism, agrarian problems, depression, the New Deal, the two world wars, the cold war, and similar topics are analyzed. CTL:ISH 1011 American History II",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "East Asia In The Modern World",
        "subjectCode": "HIST",
        "courseCode": "24100",
        "instructor": [
            "Margaret M Tillman"
        ],
        "description": "The response of China, Japan, and Korea to the coming of the West in modern times, with special stress on the effect of Western ideas and machines. Approximately 1600 to the present.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "South Asian History And Civilizations",
        "subjectCode": "HIST",
        "courseCode": "24300",
        "instructor": [
            "Tithi Bhattacharya"
        ],
        "description": "Survey history of India, Pakistan, and Bangladesh, from the origins of South Asian civilization to the present. Topics include ancient India, the Mughal Empire, the colonial experience, the independence movement, and conflict and popular culture.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Modern Middle East And North Africa",
        "subjectCode": "HIST",
        "courseCode": "24600",
        "instructor": [
            "Stacy E Holden"
        ],
        "description": "This course explores the political, social, and cultural factors that have contributed to the formation of the modern Middle East. Course includes short stories and a selection of documentary films from the region.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Modern Latin American History (1810 To The Present)",
        "subjectCode": "HIST",
        "courseCode": "27200",
        "instructor": [
            "Ariel E De La Fuente"
        ],
        "description": "The purpose of this general survey course is to introduce students to the study of the major economic, political, social, and cultural processes that shaped modern Latin American nations since independence. No prior knowledge of Latin American history is required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Money, Trade, And Power: The History Of Capitalism",
        "subjectCode": "HIST",
        "courseCode": "27800",
        "instructor": [
            "William G Gray"
        ],
        "description": "This course examines the origins of capitalist institutions and their changes over time, including banks, joint-stock companies, and modern corporations -- all viewed with respect to their impact on industrialization, colonial expansion, business cycles, and the emergence of a global economy.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Intro Jewish Studies",
        "subjectCode": "HIST",
        "courseCode": "30200",
        "instructor": [
            "Olga V Lyanda-Geller",
            "Spencer Dean Stewart"
        ],
        "description": "This variable-title course deals with broad historical topics that transcend and collapse traditional analytical, chronological, and geographic boundaries. Content will vary with faculty member teaching the class.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "The United States In The World 1898-Present",
        "subjectCode": "HIST",
        "courseCode": "30505",
        "instructor": [
            "David C Atkinson"
        ],
        "description": "This course explores the central issues and themes of American foreign relations during the twentieth century with a primary focus on the expansion of American political military, economic, and cultural power.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Technology And War In U.S. History",
        "subjectCode": "HIST",
        "courseCode": "30605",
        "instructor": [
            "Zachary M Loeb"
        ],
        "description": "War has been a central component of U.S. statecraft from the war of independence through the war on terror. This lecture class examines the complicated relationship between technology and war from the colonial period through the present day.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "History Of Biotechnology",
        "subjectCode": "HIST",
        "courseCode": "30902",
        "instructor": [
            "Kathryn Grace Maxson"
        ],
        "description": "This class examines historical intersections between engineering and biology in the Western world. The course begins by considering several possible meanings of \"biotechnology.\" It examines how and why different biotechnologies from the life sciences, biology, and medicine have arisen in specific historical contexts, changed over time, and affected society from the late 19th century to the present. We will study vaccines and beer-making in the 19th century, cell culture, birth control pills, and DNA sequencing in the 20th century, and 21st-century genome editing and synthetic biology, for example. Overall, this course argues that biotechnologies have always forced human beings to consider whether living and non-living entities are made up of the same fundamental \"stuff,\" the implications of manipulating living things, and the nature of life itself.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "History Of Human Rights",
        "subjectCode": "HIST",
        "courseCode": "33805",
        "instructor": [
            "Rebekah A Klein-Pejsova"
        ],
        "description": "This course explores human rights' genealogy and uneven historical development from Atlantic Revolutionary articulations through the late 20th Century and experience of globalization.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Traditional Japan",
        "subjectCode": "HIST",
        "courseCode": "34300",
        "instructor": [
            "Nissanka Subodhana Megavarna Wijeyeratne"
        ],
        "description": "The course considers Japanese civilization from its origins to the establishment of the Tokugawa Shogun (1603). Divided between political and cultural history, it will emphasize the development of traditional institutions in Japanese society, religion, philosophy, art, and literature.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Sports In America",
        "subjectCode": "HIST",
        "courseCode": "35305",
        "instructor": [
            "Randy W Roberts"
        ],
        "description": "Today sports virtually dominate American culture. From fantasy leagues and 24-hour a day news shows to business decisions and off-the-field troubles to the games themselves, sports entertain Americans at the same time as they define American culture and social norms. This course will look at the growth of the sport industry in the 20th Century. It will examine the lives and importance of Babe Ruth, Joe Louis, Jackie Robinson, Muhammad Ali, and other athletes, as well as the economic, social, and medical impact of the games we watch.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "History And Culture Of Native America",
        "subjectCode": "HIST",
        "courseCode": "37700",
        "instructor": [
            "Dawn Gay Marsh"
        ],
        "description": "This course explores the societies of Native North America in a historical context, from pre-historic times to the present, examining Native world views and belief systems to understand their historical relations with each other, and with Europeans and their descendants.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "History Of United States Agriculture",
        "subjectCode": "HIST",
        "courseCode": "38001",
        "instructor": [
            "Ray Douglas Hurt"
        ],
        "description": "This course surveys the main development in North American agricultural history, emphasizing the continental United States. Topics include early American agriculture, the plantation system, land policy, scientific and technological change, agrarian politics, water rights, migrant labor, and agricultural policy.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "History Of The Space Age",
        "subjectCode": "HIST",
        "courseCode": "38700",
        "instructor": [
            "Michael G Smith"
        ],
        "description": "The historical interaction between human values and space exploration in the contemporary age, focusing on issues of global interdependence. Topics include the international competition in rocketry, the Cold War in space, the moon missions, space disasters, and satellite technology.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Famine In World History",
        "subjectCode": "HIST",
        "courseCode": "39500",
        "instructor": [
            "Ray Douglas Hurt",
            "Dawn Gay Marsh"
        ],
        "description": "Variable title seminar for history majors in their junior year intended to teach historical skills, including research in primary sources, analytical skills, and forming historical arguments. It is a writing-intensive course and counts as one of the major requirements.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Rebels And Romantics: Europe 1815-1870",
        "subjectCode": "HIST",
        "courseCode": "40600",
        "instructor": [
            "Deborah L Fleetham"
        ],
        "description": "Examines the dramatic social, cultural, and political developments in Europe following the defeat of Napoleon through various rebellious and romantic personalities, as well as figures who supported conservative or reformist solutions to the upheavals of industrialization, revolution, and nationalism.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Communist China",
        "subjectCode": "HIST",
        "courseCode": "43900",
        "instructor": [
            "Margaret M Tillman"
        ],
        "description": "The evolution of the Communist movement (1921-1949) and the development of the Communist government (since 1949) in China. Attention is given to political, economic, social, and cultural changes.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Pol Polarization Mod America",
        "subjectCode": "HIST",
        "courseCode": "48500",
        "instructor": [
            "Kathryn C Brownell"
        ],
        "description": "This course deals with broad thematic and chronologically defined topics in American political history from the Revolutionary Era to the late twentieth century. Content will vary with the faculty member teaching the class.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Sky Sand Sea Explrtion E Asia",
        "subjectCode": "HIST",
        "courseCode": "49200",
        "instructor": [
            "Nissanka Subodhana Megavarna Wijeyeratne"
        ],
        "description": "Course description will vary according to specific topic proposed to study.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "World War I In The Middle East",
        "subjectCode": "HIST",
        "courseCode": "49500",
        "instructor": [
            "Jennifer L Foray",
            "Stacy E Holden"
        ],
        "description": "This course is designed to train history majors in the fundamentals of historical research and writing. Course descriptions vary according to specific topics proposed for study by instructors.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Eur &/In Early Mod & Mod World",
        "subjectCode": "HIST",
        "courseCode": "60100",
        "instructor": [
            "Jennifer L Foray"
        ],
        "description": "Bibliography and historiography of selected fields of topics in European history; may vary in subject matter from semester to semester. Prerequisite: Master's student standing.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "History: Research Practicum",
        "subjectCode": "HIST",
        "courseCode": "61100",
        "instructor": [
            "Ekaterina Babintseva"
        ],
        "description": "The second half of a two-semester sequence for new graduate students intended to acquaint them with important issues regarding the modern practice of historical scholarship. This course is a research seminar in which students shape and execute their own research projects resulting in original article-length historical essays. In addition, matters relating to ethical conduct of research and problems of historical writing and argumentation are discussed. Prerequisites: HIST 61000 or 59800. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Global Environmental History",
        "subjectCode": "HIST",
        "courseCode": "64100",
        "instructor": [
            "Frederick R Davis"
        ],
        "description": "Individual and group study of topics in global history. Topics reflect the research, teaching, or historiographic specialties of the faculty offering the course. Subtitles indicate the focus of the research seminar. Prerequisite: Master's student standing.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Research Semnr In Gender Hist",
        "subjectCode": "HIST",
        "courseCode": "64200",
        "instructor": [
            "Wendy K Kline"
        ],
        "description": "Individual and group study of topics in global history. Topics reflect the research, teaching, or historiographic specialties of the faculty offering the course. Subtitles indicate the focus of the research seminar. Prerequisite: Master's student standing.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    }
]