[
    {
        "title": "Honors First Yr Experience II",
        "subjectCode": "HONR",
        "courseCode": "19902",
        "instructor": [
            "Elizabeth B Brite",
            "Nicole Marie Fadellin",
            "Christie Nicole Shee",
            "Anish Vanaik",
            "Muiris Macgiollabhui",
            "Dwaine H Jengelley",
            "Jason A Ware",
            "Zahra A Tehrani",
            "Md Sanoar Rahman",
            "Nathan W Swanson",
            "Ashima Krishna",
            "Kristen Marie Bellisario",
            "Jonathan P Moore"
        ],
        "description": "All JMHC students take this course each semester (fall and spring) of their first year. This course is designed to introduce students to college-level honors education. Learning outcomes include how to be flexible thinkers, inclusive collaborators, and ethical leaders. This course is the second half of the required course sequence taken by all students entering the Honors College. Restricted to Honors College students.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Interdisciplinary Approaches In Writing",
        "subjectCode": "HONR",
        "courseCode": "19903",
        "instructor": [
            "Nicole Marie Fadellin",
            "Jonathan P Moore"
        ],
        "description": "This course is a writing-intensive course in which students learn how to find, evaluate, and use credible information, how to express themselves well in a variety of different written genres, and how to write for different audiences.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Solutions Lab Global: Italy",
        "subjectCode": "HONR",
        "courseCode": "22200",
        "instructor": [
            "Leighton A Buntain"
        ],
        "description": "In this course, students from Purdue University (West Lafayette, Indiana) and at universities abroad will collaborate virtually in interdisciplinary teams to identify solutions to a major global challenge. Each semester, the theme of the global challenge changes. At the start of the course, students at both universities will meet together as a class to learn about the topic from a range of disciplinary perspectives through guest lectures, assigned readings, and class discussions. Students will then be divided into interdisciplinary teams with members from both universities and provided a prompt related to the semester's theme. Teams will spend several weeks of the course focused on researching, developing, and packaging their solutions, before presenting them publicly at the end of the term. In addition to increasing knowledge of the topic and improving teamwork skills, students in this course will advance in intercultural knowledge, skills, and attitudes through their international collaborative experience.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "High Tech Entrepreneurship",
        "subjectCode": "HONR",
        "courseCode": "29900",
        "instructor": [
            "Adam E Watkins",
            "Heidi Ione Fahning",
            "Temitope Folasade Adeoye",
            "Ed Zschau",
            "Jacqueline C Linnes"
        ],
        "description": "These interdisciplinary topics seminars are designed to offer experiential learning on campus, in the community, and around the world. Courses are limited to 20 participants or fewer, may be team-taught, and emphasize close interaction between the professor(s) and the students. Students will participate in active learning exercises that may include study away and study abroad, workshops, research and creative skill building, community collaboration, and/or service learning. Seminar topics will vary from semester to semester.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Jazz",
        "subjectCode": "HONR",
        "courseCode": "31200",
        "instructor": [
            "Jason A Ware"
        ],
        "description": "Jazz artists \"speak to each other in the language of music.\" In Jazz, we will explore the nature of this artistic conversation with many of its cultural influences, geographical variations, and temporal iterations. Throughout our time together we will interrogate varying facets of the social impact such a conversation facilitates. Furthermore, we will explore the musical language of jazz with its power to make collective performance stronger. And we will investigate the ways in which this artists' talk became the \"talk of the town\" and country as a medium through which people could break from dominant cultures. We will make sense of and process our journey by creating our own jazz ensemble, featuring the layered textures of our lives as inspiration for the note and lyric.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "STS: Eugenics Then & Now",
        "subjectCode": "HONR",
        "courseCode": "31300",
        "instructor": [
            "Maren T Linett",
            "Christie Nicole Shee"
        ],
        "description": "  Science and technology are deeply intertwined with the distribution of costs and benefits in human society, underscoring the need for critical perspectives. This project-based course will examine the social and ethical implications of science and technology using interdisciplinary methodologies/approaches. Students will have the opportunity to address questions such as: How have particular scientific discoveries and technologies emerged or evolved? How have they shaped society, and how has society shaped science and technology? How have science and technology compounded social inequalities (race, class, gender), and how can they be changed to reduce inequalities? Topics that will be explored will vary each semester.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Human Epoch: Climate Solutions",
        "subjectCode": "HONR",
        "courseCode": "31400",
        "instructor": [
            "Elizabeth B Brite",
            "Ashima Krishna",
            "Anish Vanaik"
        ],
        "description": "  In this course, students will explore the entangled relations between humanity and the environment from multiple social contexts and time periods. Throughout the class, students will read, analyze, and discuss interdisciplinary scholarship from the social and behavioral sciences. Classroom activities will take the form of discussion, projects and group assignments, and writing assignments, with an emphasis on peer-to-peer learning. Students will create a project aimed at a public audience that demonstrates knowledge about key course topics and communicates connections between social/behavioral knowledge and personal, civic, ethical, or global decisions and policies. As a result of taking this course, students will be able to understand and evaluate critical questions about humanity and its ecologies, recognize the importance of those questions for various audiences, and draw connections between course materials and their own perspectives about the world.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Across Differences",
        "subjectCode": "HONR",
        "courseCode": "31500",
        "instructor": [
            "Matthew Eric Pessar Joseph"
        ],
        "description": "To understand and combat systemic injustices, our students must be equipped to engage with the historical and present-day racial and ethnic \"reckonings\" that define the United States, and large parts of the globe. This course offers students an opportunity to focus on cultural landscapes/contexts, to learn how race and ethnicity permeate cultural texts, genres, and industries. The course trains students to recognize how race-and-ethnicity-based inequities intersect with issues of class, gender, and/or sexuality, and how these intersections articulate themselves in/through culture. Students will grapple with the colonial, national, transatlantic, trans-cultural, and diasporic underpinnings of culture. Topics that will be explored will vary each semester, but to attend to the diverse ways in which students learn and demonstrate their learning, all sections will use interdisciplinary materials like songs, films, video games, sporting events, poems, neighborhood maps, photographs, fine art pieces, oral histories, interviews, and newspapers, in addition to traditional/scholarly publications.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Sports & Politics",
        "subjectCode": "HONR",
        "courseCode": "39900",
        "instructor": [
            "Dwaine H Jengelley",
            "Cara C Putman",
            "Aparajita Jaiswal",
            "Nadine E Dolby",
            "Megha Anwer"
        ],
        "description": "This course is designated for a wide range of honors seminars that stress interdisciplinary understanding, intellectual flexibility, creative thought, and group discussion. Topics vary by semester. Open to students at all levels.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Technological Justice",
        "subjectCode": "HONR",
        "courseCode": "46000",
        "instructor": [
            "Mayari Illarij Serrano anazco"
        ],
        "description": "In this course, students will study interdisciplinary approaches to technology ethics for responding to today's pressing technological dilemmas in a range of contexts, from healthcare, mass incarceration, and airport security to social media, smart cities, and space travel. Students will grapple with how historical and present-day inequalities, institutional environments, decision-making cultures, and regulatory systems impact the technological design process and distribution of technology's risks and rewards in society. We will ask ourselves how relations of power inform the ways technologies are designed and experienced, as well as how power shapes dominant and insurgent approaches to achieving technological justice. The primary deliverable in this class is for you to conceive of and carry out your own \"Technological Justice\" Project, based on your interests, passions, and personal and/or professional goals.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Research Thinking Portfolio",
        "subjectCode": "HONR",
        "courseCode": "46300",
        "instructor": [
            "Kathryn Frances Dilworth"
        ],
        "description": "This course establishes a new pathway for Honors completion through a critical engagement with the Undergraduate Research pillar of the college. This course will empower Honors students to leverage their research, scholarly, and creative experiences in curricular as well as co- and extra-curricular experiences toward completing the HC curriculum. Our course will combine workshops, hands-on laboratories, group discussion, and one-on-one meetings. The major assignment is a reflective portfolio, which will serve as a record of your past experiences and an opportunity to reflect on the ways in which your time as an Honors College student has shaped your research thinking and helped prepare you for life beyond the university. Successful completion of the course fulfills the scholarly project requirement of the HC curriculum.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Scholarly Project:Sonic Biodiv",
        "subjectCode": "HONR",
        "courseCode": "46400",
        "instructor": [
            "Katherine M Jarriel",
            "Muiris Macgiollabhui",
            "Kristen Marie Bellisario",
            "Christie Nicole Shee"
        ],
        "description": "This course fulfills the scholarly project requirement of the Honors College curriculum. Students will engage in original research projects that produce new knowledge.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    }
]