[
    {
        "title": "Industrial Engineering Seminar",
        "subjectCode": "IE",
        "courseCode": "20000",
        "instructor": [
            "Patrick Alan Brunese"
        ],
        "description": "An orientation course to inform students of  the major options in the industrial engineering program, assistance in selection of appropriate electives to meet career objectives, introduction to the faculty, and selection of an academic advisor.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Probability And Statistics In Engineering I",
        "subjectCode": "IE",
        "courseCode": "23000",
        "instructor": [
            "Lucky Cho"
        ],
        "description": "An introduction to probability and statistics. Probability and probability distributions. Mathematical expectation. Functions of random variables. Estimation. Applications oriented to engineering problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Probability And Statistics In Engineering II",
        "subjectCode": "IE",
        "courseCode": "33000",
        "instructor": [
            "Pramiti Sarker"
        ],
        "description": "Introduction to statistical inference and experimental design. Correlation, regression, single and multi-factor ANOVA, non-parametric methods. Applications to statistical quality control.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Computing In Industrial Engineering",
        "subjectCode": "IE",
        "courseCode": "33200",
        "instructor": [
            "Mario Ventresca"
        ],
        "description": "Introduction to computing in industrial engineering. Reinforcement of scientific programming skills on typical IE tasks, together with introduction to simulation and related computer tools.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Operations Research",
        "subjectCode": "IE",
        "courseCode": "33500",
        "instructor": [
            "Lucky Cho"
        ],
        "description": "Introduction to deterministic optimization modeling and algorithms in operations research. Emphasis on formulation and solution of linear programs, networks flows, and integer programs.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Operations Research",
        "subjectCode": "IE",
        "courseCode": "33600",
        "instructor": [
            "Joaquin Goni Cortes"
        ],
        "description": "Introduction to probabilistic models in operations research. Emphasis on Markov chains, Poisson processes, and their application to queuing systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Engineering Economics",
        "subjectCode": "IE",
        "courseCode": "34300",
        "instructor": [
            "Behzad Esmaeili",
            "Mohamed Salama"
        ],
        "description": "Cost measurement and control in engineering studies. Basic accounting concepts, income measurement, and valuation problems. Manufacturing cost control and standard cost systems. Capital investment, engineering alternatives, and equipment replacement studies. Not open to students with credit in CE 39400.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Manufacturing Processes I",
        "subjectCode": "IE",
        "courseCode": "37000",
        "instructor": [
            "Ramses Martinez"
        ],
        "description": "Principal manufacturing processes; metal cutting, grinding and metal forming operations, machine tools, and tools and tooling. Nontraditional machining and welding. Introduction to computer-aided manufacturing and computer-aided graphics and design, N/C programming, robots, and flexible manufacturing systems. Classroom and laboratory demonstrations included. Not open to students with credit in ME 36300.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Integrated Production Systems I",
        "subjectCode": "IE",
        "courseCode": "38300",
        "instructor": [
            "Yuehwern Yih"
        ],
        "description": "Basic concepts in the design and operational control of integrated production systems. Includes topics on facility layout and material handling, material flow and information flow, resource and capacity planning, and shop floor control and scheduling.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Work Analysis And Design I",
        "subjectCode": "IE",
        "courseCode": "38600",
        "instructor": [
            "Pramiti Sarker"
        ],
        "description": "Fundamentals of work methods and measurement. Applications of engineering, psychological, and physiological principles to the analysis and design of human work systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Industrial Engineering Design",
        "subjectCode": "IE",
        "courseCode": "43100",
        "instructor": [
            "Syed Ahmad Helmi Bin Syed Hassan"
        ],
        "description": "Capstone design experience for industrial engineering students involving analysis and synthesis of unstructured problems in practical settings. Students work in teams to formulate issues, propose solutions, and communicate results in formal written and oral presentations. Prerequisite: all 30000-level industrial engineering courses required for the BS IE degree.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Manufacturing Processes II",
        "subjectCode": "IE",
        "courseCode": "47000",
        "instructor": [
            "Gary J Cheng"
        ],
        "description": "The interrelations of materials, processes, and design with various aspects of manufacturing.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Industrial Control Systems",
        "subjectCode": "IE",
        "courseCode": "47400",
        "instructor": [
            "Sivaranjani Seetharaman"
        ],
        "description": "Introduction to automatic controls with reference to automation of industrial machines and processes, including linear dynamic systems, feedback control, and elements of systems analysis. Introduction to digital control.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Integrated Production Systems II",
        "subjectCode": "IE",
        "courseCode": "48400",
        "instructor": [
            "Mohamed Salama"
        ],
        "description": "Extensions of topics on the design and operational control of integrated production systems. Includes production databases, facility layout, material handling, advanced control and scheduling, and physical distribution. Case studies, lab assignments, and projects.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Work Analysis And Design II",
        "subjectCode": "IE",
        "courseCode": "48600",
        "instructor": [
            "Anika Jannat Rimu"
        ],
        "description": "Continuation of IE 38600. Applications of engineering, computer sciences, information sciences, and psychological principles and methods to the analysis and design of human work systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Grnd Challngs In Accessibility",
        "subjectCode": "IE",
        "courseCode": "49000",
        "instructor": [
            "Ana Maria Estrada Gomez",
            "Bradley S Duerstock",
            "Stephan Robert Biller"
        ],
        "description": "Special topic courses and projects of contemporary importance or of special interest that are outside the scope of the standard undergraduate curriculum. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Quality Control",
        "subjectCode": "IE",
        "courseCode": "53000",
        "instructor": [
            "Dennis Kj Lin"
        ],
        "description": "Principles and practices of statistical quality control in industry. Control charts for measurements and for attributes. Acceptance sampling by attributes and by measurements. Standard sampling plans. Sequential analysis. Sampling inspection of continuous production.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Industrial Applications Of Statistics",
        "subjectCode": "IE",
        "courseCode": "53300",
        "instructor": [
            "Zachary J Hass"
        ],
        "description": "The application of statistics to the effective design and analysis of industrial studies relating to manufacturing and human factors engineering in order to optimize the utilization of equipment and resources. Emphasis on conducting these studies at the least cost.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Stochastic Models In Operations Research I",
        "subjectCode": "IE",
        "courseCode": "53600",
        "instructor": [
            "Vaneet Aggarwal"
        ],
        "description": "An introduction to techniques for modeling random processes used in operations research. Markov chains, continuous time Markov processes, Markovian queues, reliability and inventory models.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Nonlinear Optimization Algorithms And Models",
        "subjectCode": "IE",
        "courseCode": "53800",
        "instructor": [
            "Nagabhushana Prabhu"
        ],
        "description": "Survey of computational tools for solving constrained and unconstrained nonlinear optimization problems. Emphasis on algorithmic strategies and characteristic structures of nonlinear problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Economic Decisions In Engineering",
        "subjectCode": "IE",
        "courseCode": "54600",
        "instructor": [
            "Lu Liu"
        ],
        "description": "Topics in decision-making and rationality including decision analysis, decision-making under uncertainty, and various descriptive and prescriptive models from operations research, economics, psychology, and business. Applications are drawn from engineering decision-making, public policy, and personal decision-making. Attention also is paid to designing aids to improve decision-making.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Job Design",
        "subjectCode": "IE",
        "courseCode": "55600",
        "instructor": [
            "Vincent G Duffy"
        ],
        "description": "(PSY 55600) Task analysis, personnel selection and training, job and organization design, and criteria development and use. Human factors related to job design in order to increase job satisfaction and productivity.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Industrial Robotics And Flexible Assembly",
        "subjectCode": "IE",
        "courseCode": "57400",
        "instructor": [
            "Yu She"
        ],
        "description": "Lab by arrangement. Design, analysis, and operation of robotic systems. System components and their control. Languages for robot control. Application design and analysis. Part feeders and tooling for robot workstations and automated assembly. Methods for planning robotic and assembly applications.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Human Factors In Engineering",
        "subjectCode": "IE",
        "courseCode": "57700",
        "instructor": [
            "TBA"
        ],
        "description": "(PSY 57700) Survey of human factors in engineering with particular reference to human functions in human-machine systems, and consideration of human abilities and limitations in relation to design of equipment and work environments.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Simulation Design And Analysis",
        "subjectCode": "IE",
        "courseCode": "58100",
        "instructor": [
            "Susan R Hunter"
        ],
        "description": "An introduction to simulation of stochastic systems on digital computers. Emphasis is on the fundamentals of simulation as a statistical experiment. Topics include uniform random numbers, input modeling, random variate generation, output analysis, variance reduction, and optimization.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "e-Work And e-Service",
        "subjectCode": "IE",
        "courseCode": "58800",
        "instructor": [
            "Shimon Y Nof"
        ],
        "description": "e-Work is defined as the collaborative, computer-and-communication-supported work in highly distributed organizations of humans/robots/autonomous systems. This course is devoted to learning the basic principles, theories, and applications for the design of effective e-Work and e-Service systems. Relevant discoveries at Purdue and elsewhere are also presented.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Topics In Matl Process & Mfg",
        "subjectCode": "IE",
        "courseCode": "59000",
        "instructor": [
            "Hua Cai",
            "Salim Abed Semssar",
            "Reem Khir",
            "Srinivasan Chandrasekar",
            "Ramses Martinez",
            "Anika Jannat Rimu",
            "Steven R Dunlop",
            "Behzad Esmaeili",
            "Nga Hin Benjamin Fong"
        ],
        "description": "Selected topics in industrial engineering for seniors and graduate students. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Human Aspects In Computing",
        "subjectCode": "IE",
        "courseCode": "65900",
        "instructor": [
            "Brandon J Pitts"
        ],
        "description": "Advanced topics in ergonomic, cognitive, and social aspects of using computerized systems are discussed with regard to comfort and user satisfaction, ease and productive use of computerized systems, and effective implementation of computerized technologies in the workplace. Prerequisite: IE 55900.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Adv Topics In Mnfg Engineering",
        "subjectCode": "IE",
        "courseCode": "67000",
        "instructor": [
            "Srinivasan Chandrasekar",
            "Wenzhuo Wu"
        ],
        "description": "Advanced research topics and approaches in manufacturing engineering, including processes and equipment. Research methodology, nontraditional processes, manufacturing systems, and competitive aspects of manufacturing. Prerequisite: IE 57000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Fundls Of Reinforcement Learn",
        "subjectCode": "IE",
        "courseCode": "69000",
        "instructor": [
            "Gesualdo Scutari",
            "Vaneet Aggarwal",
            "David R Johnson",
            "Lu Liu",
            "Souvik Dhara"
        ],
        "description": "Advanced study in various fields of industrial engineering for graduate students. Credits and hours to be arranged.  Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Seminar",
        "subjectCode": "IE",
        "courseCode": "69700",
        "instructor": [
            "Ana Maria Estrada Gomez"
        ],
        "description": "Industrial engineering problems with particular emphasis on current research.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Spring 2024"
    }
]