[
    {
        "title": "Structure And Properties Of Materials",
        "subjectCode": "MSE",
        "courseCode": "23000",
        "instructor": [
            "Janelle P Wharry"
        ],
        "description": "The relationship between the structure of materials and the resulting mechanical, thermal, electrical, and optical properties. Atomic structure, bonding, atomic arrangement; crystal symmetry, crystal structure, habit, lattices, defects, and the use of X-ray diffraction. Phase equilibria and microstructural development. Applications to design.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Materials Properties Laboratory",
        "subjectCode": "MSE",
        "courseCode": "23500",
        "instructor": [
            "Rahim Rahimi"
        ],
        "description": "Laboratory experiments involving usage of standard equipment in the measurement of mechanical, microstructural, thermal, electrical, and optical properties. Introduction to computer-aided data analysis. Experiments are carried out with metal, ceramic, and polymeric materials to illustrate property-structure-processing relationships.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Physical Properties In Engineering Systems",
        "subjectCode": "MSE",
        "courseCode": "25000",
        "instructor": [
            "David R Johnson"
        ],
        "description": "Class connects math, science and engineering practice and applications. Presents foundational aspects of engineering problem solving, use of computer math tools for engineering problem solving, basic engineering statics, dynamics and mechanics, group problem solving approaches, and introductory aspects of design and materials selection.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Thermodynamics Of Materials",
        "subjectCode": "MSE",
        "courseCode": "26000",
        "instructor": [
            "Davin G Piercey"
        ],
        "description": "Fundamental laws of thermodynamics and their applications to material systems; criteria for equilibrium; reaction and phase equilibria; properties of solutions; thermodynamic origins of phase diagrams.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Atomistic Materials Science",
        "subjectCode": "MSE",
        "courseCode": "27000",
        "instructor": [
            "Mohamad Bilal Zbib"
        ],
        "description": "Introductory course with an atomistic view point on material properties. Three primary class sections: bonding crystallography and statistical mechanics. Bonding topics include introduction to quantum mechanics, emphasis on understanding of metallic, ionic and covalent bonding. Crystallography topics include crystal descriptions and symmetry principles. Statistical mechanics development with application to electronic and thermodynamic properties.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Processing And Properties Of Materials",
        "subjectCode": "MSE",
        "courseCode": "33000",
        "instructor": [
            "Kendra A Erk"
        ],
        "description": "An introduction to the relationships between the processing of materials and their properties. Heat treating, forming, casting, consolidation, and other more material-specific manufacturing processes. Elucidation of the role of phenomena such as heat flow, mass diffusion, nucleation, interfacial tension, elastic and plastic deformation, precipitation, grain growth.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Materials Characterization Laboratory",
        "subjectCode": "MSE",
        "courseCode": "33500",
        "instructor": [
            "TBA"
        ],
        "description": "The principles of analytical methods for characterization of materials for structure and composition; optical microscopy, scanning electron microscopy, X-ray spectroscopy and diffraction, atomic absorption, emission spectroscopy, and mass spectrometry. Laboratory experiments in X-ray spectroscopy, X-ray diffraction, optical microscopy, and scanning electron microscopy.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Transport Phenomena",
        "subjectCode": "MSE",
        "courseCode": "34000",
        "instructor": [
            "Matthew J M Krane"
        ],
        "description": "Mechanism and rates of heat, mass, and momentum transfer. Macroscopic and differential energy, mass, and momentum balances. Application to systems with phase transformations and chemical reaction.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Materials Processing Laboratory",
        "subjectCode": "MSE",
        "courseCode": "36700",
        "instructor": [
            "Danielle Lee Heichel"
        ],
        "description": "This laboratory is intended as an intensive experience in processing techniques used for ceramics, metals, and polymers. Sintering of a ceramic, casting and post-processing (work hardening, heat treatment, etc.) of a metal, and preparation and extrusion of a polymer are the suggested processes. The measurements (e.g., powder size, compaction force, temperature, grain size, molecular weight) applicable to the successful processing of the material and the final properties (e.g., hardness, ductility, strength, stiffness) will be emphasized.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Mechanical Response Of Materials",
        "subjectCode": "MSE",
        "courseCode": "38200",
        "instructor": [
            "Alejandro H Strachan"
        ],
        "description": "This course encompasses deformation-based microscopic mechanisms, including dislocation motion, diffusion, and viscoplasticity. Macroscopic mechanical response of metals, ceramics, polymers, and composites will be related to elasticity and plasticity concepts for single crystal, polycrystalline, and amorphous materials. Practical design considerations for deformation will be included as well as an introduction to fracture mechanisms.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Materials Engineering Seminar",
        "subjectCode": "MSE",
        "courseCode": "39000",
        "instructor": [
            "David F Bahr"
        ],
        "description": "Presentation and discussion of current topics in materials engineering.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Materials Processing And Design II",
        "subjectCode": "MSE",
        "courseCode": "44000",
        "instructor": [
            "David R Gildemeister"
        ],
        "description": "Continuation and completion of the materials project or study initiated in MSE 43000 and presentation of a written dissertation on the results and conclusions. Competence in technical writing is emphasized in the preparation of the dissertation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Defects In Solids",
        "subjectCode": "MSE",
        "courseCode": "50200",
        "instructor": [
            "Esteban E Marinero-Caceres"
        ],
        "description": "Structures and interactions of point, line, and planar defects in solids, with emphasis on properties of defects. Generic basis of defect energies and interactions, with reference to specific materials and material classes as examples. Types of point defects found in crystals, their origins, interactions, and motion. Overview of dislocation theory and point-defect/dislocation interactions. Structural aspects of surfaces and interfaces, including point and line defect interactions.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Microstructural Characterization Techniques",
        "subjectCode": "MSE",
        "courseCode": "51000",
        "instructor": [
            "Eric P Kvam"
        ],
        "description": "A broad variety of analytical tools will be presented. The intent is to allow the student to make an educated selection of characterization techniques, or critical analysis of published data, for materials and defect analysis. The techniques will be assessed in terms of the probe type and material response, of what device and specimen requirements are typical, and of what data can or cannot be derived from each type of analysis.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Materials For Hypersonics",
        "subjectCode": "MSE",
        "courseCode": "51700",
        "instructor": [
            "Rodney W Trice"
        ],
        "description": "  This course will include a brief history of hypersonic flight and design, along with a description of the aerothermal environment, to provide motivation for the use of ceramic materials as thermal protection systems and window materials. The classroom approach is to develop a fundamental understanding of materials structure, forming and sintering, and properties (mechanical and thermal) of ceramics, and then apply that knowledge for hypersonic applications such as ultra-high temperature ceramics (UHTCs including ZrB2), ceramic matrix composites (including Cf/SiC, SiCf/SiC, and Carbon/Carbon), and materials requirements for RF and IR radomes and windows. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Physical Ceramics",
        "subjectCode": "MSE",
        "courseCode": "52300",
        "instructor": [
            "Elliott B Slamovich"
        ],
        "description": "Physical and chemical processes responsible for microstructure development in modern ceramic materials, and the relationship between microstructures and physical properties. The material covered is divided into three parts: solid state processes, including structural defects, diffusion, sintering and grain growth, reaction rates, nucleation and growth, and microstructure development; mechanical and thermal behavior, including deformation, strength, thermal properties, and thermal and compositional stresses; and electrical and magnetic behavior, including electrical conductivity, dielectric properties, and magnetic properties. Offered in alternate years.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Struct-Property Relationships Of Engineering Polymers",
        "subjectCode": "MSE",
        "courseCode": "52500",
        "instructor": [
            "Carlos J Martinez"
        ],
        "description": "Structure-property relationships developed for commodity and engineering resins. Focus on connecting bonding and polymer structure (i.e., molecular weight, tacticity, crystallinity as it regards spherulites) to mechanical (yield phenomena and fracture) and thermomechanical behavior (viscoelasticity). Thermal characterization techniques, including DSC, TGA, TMA, and DMTA. Flow of polymer melts related to common melt processing techniques (i.e., extrusion and injection molding). Offered in alternate years.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Biomaterials",
        "subjectCode": "MSE",
        "courseCode": "52700",
        "instructor": [
            "Lia A Stanciu-Gregory"
        ],
        "description": "This course aims to introduce students to Biomaterials concepts: structure, properties, and applications. The class will cover the main classes of materials: metals, ceramics and polymers in the context of their use in medicine as implant materials, drug delivery vehicles, and as tissue engineering scaffolds. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Materials Processing In Manufacturing",
        "subjectCode": "MSE",
        "courseCode": "53000",
        "instructor": [
            "David R Gildemeister"
        ],
        "description": "Examination of the production/synthesis of engineering materials and the subsequent processing steps required to obtain a desired shape and microstructure. The course covers four major categories of materials processing: primary processing or materials synthesis, solidification processing, deformation processing, and powder processing, and provides specific examples from the processing of polymers, metals, and ceramics. The goal is to connect fundamental principles of materials processing to manufacturing processes. Credit will not be given for both MSE 5300 and 36700.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Lean Manufacturing Of Materials",
        "subjectCode": "MSE",
        "courseCode": "53500",
        "instructor": [
            "Paul R Mort"
        ],
        "description": "  This course provides perspectives on materials processing and product innovation with an economic lens on efficiency and elimination of waste. It includes an historical perspective of manufacturing via the transition from mass to lean production in the automotive industry; and extends manufacturing and product development in context of emerging trends in automation (e.g., control and PAT, I4.0), modular design, supply chain, and sustainability. The class covers lean tools, focusing on value stream analyses and optimization using simulations. As an elective, the course accommodates a range of student interest profiles. It includes both individual and interest-based group assignments. The mix of students adds to the effectiveness of group exercises. A term paper enables individuals to do a deeper dive into specific interests. Overall, the course has shown to be adaptable over a broad range of students representing a variety of departments and professional backgrounds. ",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Deformation Mechanisms In Crystalline Solids",
        "subjectCode": "MSE",
        "courseCode": "55500",
        "instructor": [
            "Nikhilesh Chawla"
        ],
        "description": "Focuses on the mechanisms for deformation and fracture of metal, intermetallic, and ceramic materials, with particular emphasis on high temperature properties. The industrial success of superalloys, dispersion-strengthened alloys, stainless steels, composites, and thermal barrier coatings will serve as the basis for exploring the relationship between composition, microstructure, and component application in high temperature performance. Topics included are alloying effects on dislocation climb and glide, grain boundary and lattice diffusion, and dynamic recrystallization. The interactions between environment and thermal and mechanical cycling also will be considered. Design tools for prediction and evaluation of component life will be investigated in detail, including an exploration of deformation mechanism maps. Offered in alternate years.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Polymer Synthesis",
        "subjectCode": "MSE",
        "courseCode": "56700",
        "instructor": [
            "Jeffrey P Youngblood"
        ],
        "description": "Analyze properties of polymers and correlate them to chemical structure. Apply methods and mechanisms of polymer chemistry to industrial and laboratory synthesis. Examine the kinetic and design factors that control polymer structures. Offered in alternate years.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Additive Manufacturing Of Materials",
        "subjectCode": "MSE",
        "courseCode": "56800",
        "instructor": [
            "Kevin P Trumble"
        ],
        "description": "  The course takes an MSE approach to additive manufacturing, integrating deposition processing, powder processing, and solidification processing principles in the full range of AM process configurations and kinematics. The overarching goal is to learn how microstructure development, and thus the resulting material properties, are controlled by the interaction of physical, chemical, thermal and mechanical phenomena in the shaping of materials by additive processing. All the main classes of materials and AM processes are covered. Additional objectives are to quantitatively analyze the capabilities and limitations of AM relative to established commercial shaping processes; and to critically analyze the AM research literature. ",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Materials Modeling And Informatics",
        "subjectCode": "MSE",
        "courseCode": "57000",
        "instructor": [
            "Arun Kumar Mannodi Kanakkithodi"
        ],
        "description": "  This course provides an introduction at the graduate level to theory and methods for simulating the structure and properties of materials. The course will provide a broad initial overview of many atomistic modeling techniques, followed by a detailed study of density functional theory (DFT) over several weeks, then a few lectures on classical molecular dynamics (MD) and Monte Carlo (MC) simulations, and finishing with an introduction to materials informatics techniques which rely on learning from materials data. Students will obtain an essential understanding of quantum and classical theory and become acquainted with practical methods for running DFT, MD and MC simulations, as well as combining such simulations with simple machine learning and data science methods for materials design. Existing and new tools on nanoHUB, access to open-source simulation software, and writing simple Python code will be utilized for all necessary coursework and exercises. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Corrosion",
        "subjectCode": "MSE",
        "courseCode": "57600",
        "instructor": [
            "David F Bahr"
        ],
        "description": "Rate-controlling steps in electrode processes; activation, ohmic, and concentration polarization; passivation; potentiostatic studies and alloy design; applications to engineering systems. Offered in alternate years.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Modeling&Simulation Materials",
        "subjectCode": "MSE",
        "courseCode": "59700",
        "instructor": [
            "Maria A Okuniewski",
            "Arun Kumar Mannodi Kanakkithodi",
            "Anter A El-Azab"
        ],
        "description": "Hours and credits to be arranged. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            18
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Seminar In Materials Engineering",
        "subjectCode": "MSE",
        "courseCode": "69000",
        "instructor": [
            "TBA"
        ],
        "description": "Required of all MSE graduate students.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Materls Engr Teach Experience",
        "subjectCode": "MSE",
        "courseCode": "69700",
        "instructor": [
            "John A Howarter"
        ],
        "description": "Hours and credits to be arranged.  Prerequisite: two upper-division mathematics courses: one on linear algebra and one on abstract algebra. Permission of instructor required. Typically offered Fall Spring.",
        "capacity": 0,
        "credits": [
            0,
            18
        ],
        "term": "Spring 2024"
    }
]