[
    {
        "title": "Environmental Science And Conservation",
        "subjectCode": "NRES",
        "courseCode": "12500",
        "instructor": [
            "John B Dunning"
        ],
        "description": "(AGRY 12500, EAPS 12500, FNR 12500) Introduction to environmental science and conservation includes topics in ecological principles, conservation and natural resource management, human impacts on the environment, toxic waste disposal, climate change, energy, air and water pollution, environmental geology and geologic hazards.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Survey Of Meteorology",
        "subjectCode": "NRES",
        "courseCode": "23000",
        "instructor": [
            "Andrea Elise Orton"
        ],
        "description": "(EAPS 22100) An introductory course for both science and non-science students. A general study of the atmosphere, basic meteorological principles, and weather systems. Relationships of the changing atmosphere to climate, ozone depletion, and other contemporary issues.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Soil Science",
        "subjectCode": "NRES",
        "courseCode": "25500",
        "instructor": [
            "Shams Rahman R Rahmani"
        ],
        "description": "(AGRY 25500) Differences in soils; soils genesis; physical, chemical, and biological properties of soils; relation of soils to problems of land use and pollution; soil management relative to tillage, erosion, drainage, moisture supply, temperature, aeration, fertility, and plant nutrition. Introduction to fertilizer chemistry and use. Not available to students who have taken AGRY 27000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Landscape-Level Planning",
        "subjectCode": "NRES",
        "courseCode": "27000",
        "instructor": [
            "Kara A Salazar"
        ],
        "description": "The main objective of this course is to teach students about natural resources planning with an emphasis on critical skills for developing landscape level management plans. This one credit course uses guest speakers, lectures, in-class activities, group presentations and take-home assignments to facilitate student learning.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Environmental Hydrology",
        "subjectCode": "NRES",
        "courseCode": "33700",
        "instructor": [
            "Laura C Bowling"
        ],
        "description": "(AGRY 33700) This course is designed to provide undergraduate students with both the basics of how water moves through the environment and current theories as to how hydrologic response is modified by environmental change at a variety of temporal and spatial scales.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Hazardous Waste Handling",
        "subjectCode": "NRES",
        "courseCode": "38010",
        "instructor": [
            "Laura C Bowling"
        ],
        "description": "This course trains individuals to stop the release or potential releases of hazardous substances. They have a more aggressive role than first responders at the operations level by approaching the point of the release to plug, patch, or otherwise stop it or manage offensive operations. This course satisfies the OSHA standards for completion of the 40-hour Hazardous Waste Operator/Emergency Response Technician certification, 29CFR1910.120. Topics covered include implementing an employer's emergency response plan; classification and identification of unknown materials using field survey instruments; functioning within the Incident Command System; specialized chemical protective equipment; hazard and risk assessment techniques; advanced product control operations; decontamination procedures; proper termination procedures; and basic chemical and toxicological terminology.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Hazardous Waste Certification Renewal",
        "subjectCode": "NRES",
        "courseCode": "48000",
        "instructor": [
            "Laura C Bowling"
        ],
        "description": "Upon completion of this course, students will be able to 1) analyze a response scene to stop the release or potential releases of hazardous substances, and 2) connect knowledge and awareness to meet OSHA requirements (20 CFR 1010.120) for working on projects that involve the handling of hazardous materials. Students successfully completing all requirements will receive their 40 hour HAZWOPER Certification.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Current Topics In Environmental Sciences",
        "subjectCode": "NRES",
        "courseCode": "49700",
        "instructor": [
            "Laura C Bowling"
        ],
        "description": "This course is part of the NRES capstone experience and helps students examine contemporary environmental issues through the diverse disciplinary lenses they have been exposed to through their NRES coursework.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    }
]