[
    {
        "title": "Introduction To Nuclear Pharmacy",
        "subjectCode": "NUPH",
        "courseCode": "49100",
        "instructor": [
            "Kara Duncan Weatherman"
        ],
        "description": "This course will serve as an introduction to nuclear pharmacy practice and serve as the first course in the nuclear pharmacy elective series. Successful completion of the nuclear pharmacy series can be used to meet the 200 hour didactic training requirement set forth by the Nuclear Regulatory Commission (NRC) towards achieving Authorized User status. This course will provide basic information about the profession of nuclear pharmacy, as well as an introduction to radioactive material and radiation safety concepts. The course will conclude with guest lectures from practitioners in several different areas of nuclear pharmacy practice to provide information about the different areas of practice available to nuclear pharmacists.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Regulatory Considerations For Nuclear Pharmacy Practice",
        "subjectCode": "NUPH",
        "courseCode": "49300",
        "instructor": [
            "Kara Duncan Weatherman"
        ],
        "description": "This is the second course in the nuclear pharmacy series, with an emphasis on the regulatory oversight of nuclear pharmacy practice. While the previous course dealt with radiation safety issues, this course outlines how these safety skills relate to the regulatory requirements set forth by the various regulatory agencies.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Clinical Aspects Of Nuclear Pharmacy Practice",
        "subjectCode": "NUPH",
        "courseCode": "49400",
        "instructor": [
            "Kara Duncan Weatherman"
        ],
        "description": "This course will be offered as a lecture course with some interactive discussion and problem solving applications. In addition, students will be required to complete several distance learning activities that relate to/enhance the materials that will be covered in the lecture period. This course is the final course in the NUPH series that can be used to count toward the 200 hours of didactic training required for Authorized Nuclear pharmacist (ANP) status.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    }
]