[
    {
        "title": "Introduction To The Study Of Religion",
        "subjectCode": "REL",
        "courseCode": "20000",
        "instructor": [
            "Daniel W Smith"
        ],
        "description": "This course will introduce students to the academic study of religion through an exploration of various methodologies available for a critical, reflective investigation of the study of religion.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Religions Of The East",
        "subjectCode": "REL",
        "courseCode": "23000",
        "instructor": [
            "Thomas W Ryba"
        ],
        "description": "(PHIL 33000) A study of the history, teaching, and present institutions of the religions of India, Southeast Asia, China, and Japan. This will include Hinduism, Jainism, Sikhism, Buddhism, Confucianism, Taoism, Shintoism, and Zoroastrianism.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Religions Of The West",
        "subjectCode": "REL",
        "courseCode": "23100",
        "instructor": [
            "Thomas W Ryba"
        ],
        "description": "(PHIL 33100) A comparative study of the origins, institutions, and theologies of the three major Western religions, Judaism, Christianity, and Islam.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "The Bible And Its Early Interpreters",
        "subjectCode": "REL",
        "courseCode": "31800",
        "instructor": [
            "TBA"
        ],
        "description": "This course will start with observation of the development of early themes in later parts of the Hebrew Bible and proceed to the on-going influence of these themes in Jewish literature outside the Hebrew canon (apocrypha, pseudepigrapha, targums, midrash, Josephus, Philo, and other Hellenistic Jewish authors), as well as in pagan literature of this era and in early Christian literature, particularly the New Testament.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "St Augustine",
        "subjectCode": "REL",
        "courseCode": "49100",
        "instructor": [
            "Thomas W Ryba"
        ],
        "description": "  Investigation of a special topic in Religious Studies. The topic will vary from semester to semester.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    }
]