[
    {
        "title": "Russian Level II",
        "subjectCode": "RUSS",
        "courseCode": "10200",
        "instructor": [
            "Deliya Pavlovna Kuleshova",
            "Ekaterina Dmitrievna Dick"
        ],
        "description": "  Continuation of RUSS 10100. Further work on developing skills in speaking, oral comprehension, reading, and writing in Russian through class participation, structured conversation, and short writing assignments. ",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Russian Level IV",
        "subjectCode": "RUSS",
        "courseCode": "20200",
        "instructor": [
            "Amina Gabrielov"
        ],
        "description": "Continuation of RUSS 20100. Development of Russian language skills at the higher intermediate level in speaking, listening, reading, writing, and in cultural competence. Conversational and writing ability receive prominence, as well as a review of Russian grammar. Students continue working with authentic reading and audio materials individually and in small groups.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Russian Level VI",
        "subjectCode": "RUSS",
        "courseCode": "30200",
        "instructor": [
            "Amina Gabrielov"
        ],
        "description": "Further work to develop speaking, listening, reading, and writing abilities in Russian, on the basis of materials dealing with the ideas and events that have shaped present-day Russia and the Soviet Union. Conducted primarily in Russian.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Russian Culture And Civilization I",
        "subjectCode": "RUSS",
        "courseCode": "38000",
        "instructor": [
            "Amina Gabrielov"
        ],
        "description": "This course traces the intellectual and cultural development of Russia, starting with the founding of the Kievan state and continuing to the last days of the Russian Empire. No knowledge of Russian is required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Russian Level VIII",
        "subjectCode": "RUSS",
        "courseCode": "40200",
        "instructor": [
            "Amina Gabrielov"
        ],
        "description": "Further advanced work on speaking, listening, reading, and writing abilities in Russian. Course materials will cover a variety of topics illustrated by film and other media, both print and nonprint. Conducted primarily in Russian.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Chekhov And His Time",
        "subjectCode": "RUSS",
        "courseCode": "49700",
        "instructor": [
            "Olga V Lyanda-Geller"
        ],
        "description": "This course provides in-depth study of a particular author or facet of the Russian literary tradition. Possible topics include Dostoevsky and His Age; The Art and Thought of Leo Tolstoy; Russian Romanticism: Pushki, Gogol, Lermontov; The Russian Stage: Theater in Russia and the Soviet Union.",
        "capacity": 0,
        "credits": [
            3,
            6
        ],
        "term": "Spring 2024"
    },
    {
        "title": "The Structure Of Russian II: Morphology",
        "subjectCode": "RUSS",
        "courseCode": "56200",
        "instructor": [
            "Robert Channon"
        ],
        "description": "This course will present a systematic study of Russian morphology in the light of current linguistic research, dealing both with the various categories of inflected words (nouns, pronouns, adjectives, verbs) and with word formation. Credit will not be given for both RUSS 36200 and 56200.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    }
]