[
    {
        "title": "Women's, Gender, And Sexuality Studies: An Introduction",
        "subjectCode": "WGSS",
        "courseCode": "28000",
        "instructor": [
            "Rachel Lauren Ramlawi",
            "Tracey Jean Boisseau",
            "Molly H Barnard"
        ],
        "description": "An introductory survey of the concepts and research data in the new scholarship on women. Topics covered include biology, sexuality, socialization, family and work, creativity, and politics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Wom Pol And Publ Pol",
        "subjectCode": "WGSS",
        "courseCode": "28100",
        "instructor": [
            "Rosalee A Clawson"
        ],
        "description": "This course examines in depth particular topics from the introductory course in Women's Studies. It addresses gender issues for both men and women. Possible topics include gender and popular culture, women's bodies, body image, and health, masculinities, queering gender and gender transgression.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To LGBTQ Studies",
        "subjectCode": "WGSS",
        "courseCode": "28200",
        "instructor": [
            "Marisa J Bryans",
            "Molly H Barnard"
        ],
        "description": "(ANTH 28200)  This course offers students an introduction to the interdisciplinary study of lesbian, gay, bisexual, transgender and queer lives. It provides a basic grounding in theories of sexuality and LGBT histories, identities and movements in the U.S. and globally.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Comparative Studies In Gender And Culture",
        "subjectCode": "WGSS",
        "courseCode": "38000",
        "instructor": [
            "William G Sartore"
        ],
        "description": "This course expands students' understanding of gender issues by exploring the multicultural diversity of women's lives. It examines how race, class, sexuality, and culture interact and shape society and ecology in the United States and in a global context.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Love, Sex And Sexuality",
        "subjectCode": "WGSS",
        "courseCode": "38200",
        "instructor": [
            "Juanita M Crider"
        ],
        "description": "Explores intimate relationships and marriage practices in Western and non-Western societies from a historical and comparative perspective. Examines the changes in love and marriage in Greco-Roman societies, medieval and modern Europe, China, India and the Muslim world, among others.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Women And Leadership",
        "subjectCode": "WGSS",
        "courseCode": "39000",
        "instructor": [
            "Lorraine G Kisselburgh",
            "Cheryl A Cooky",
            "Geraldine S Friedman"
        ],
        "description": "Variable topics under the direction of an instructor in a particular field of specialization.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Interdisciplinary Studies In Sexuality",
        "subjectCode": "WGSS",
        "courseCode": "48200",
        "instructor": [
            "Christopher D Munt"
        ],
        "description": "This course offers an interdisciplinary introduction to recent work in lesbian and gay studies in various fields, including literature, history, film, cultural theory, medicine, law, and studies of sexuality.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Race Class And Gender",
        "subjectCode": "WGSS",
        "courseCode": "68000",
        "instructor": [
            "Alice L Pawley"
        ],
        "description": "This course focuses on feminist theories at an advanced level and in a global perspective. Graduate students engage with key theoretical issues in contemporary feminist studies, and examine how feminist scholars have theorized women and gender issues across disciplines.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Sem In Black Feminist Studies",
        "subjectCode": "WGSS",
        "courseCode": "68100",
        "instructor": [
            "Jennifer Lynn Freeman Marshall"
        ],
        "description": "Applies feminist theory, knowledge, and methods to the examination of selected contemporary issues. Emphasizes ways in which theory and practice interact in feminist scholarship. Content may vary according to the issues examined. Prerequisite: WGSS 68000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    }
]