[
    {
        "title": "Thermodynamics In Biological Systems II",
        "subjectCode": "ABE",
        "courseCode": "20200",
        "instructor": [
            "Junli Liu",
            "Elsje Pienaar"
        ],
        "description": "Thermodynamic principles and their applications to biochemical and biological systems with emphasis on the second law of thermodynamics and use of molecular interpretations of energies and entropies. Concept of entropy balances and process efficiency. Free energy and chemical equilibrium. Equilibrium between phases, colligative properties, binding of ligands and formation of biological membranes. Molecular motion and transport properties and their application in biochemical analytical methods. Development of physical chemical problem solving skills using MathCad and MatLab software.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Thermodynamics Principles Of Engineering And Biological Systems",
        "subjectCode": "ABE",
        "courseCode": "21000",
        "instructor": [
            "Antonio Carlos Freitas Dos Santos"
        ],
        "description": "Application of thermodynamic principles to the design and operation of biological and engineering systems. The focus is on mass and energy balances for non-reacting processes and on the second law of thermodynamics. These principles are applied to biological and agricultural engineering systems. Specific topics include refrigeration systems, power cycles, energy conversion systems, and environmental impacts of energy production.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Numerical And Computational Modeling In Biological Engineering",
        "subjectCode": "ABE",
        "courseCode": "30100",
        "instructor": [
            "Junli Liu"
        ],
        "description": "Introduction to principles of analysis, setup, and modeling of biological systems using fundamental principles of engineering. Development of mathematical and numerical models to solve steady state and transient processes involving material and energy balances and utilizing thermodynamic, transport, and kinetic reaction principles, and economics in biological engineering systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Heat And Mass Transfer In Food And Biological Systems",
        "subjectCode": "ABE",
        "courseCode": "30800",
        "instructor": [
            "Ganesan Narsimhan"
        ],
        "description": "Principles of transport of energy and mass. Mechanisms of heat transfer, heat conduction, heat convection and heat radiation. Development of applications using macroscopic and microscopic balances of energy. Application of thermal energy balances and Fourier's Law to describe steady state and transient conduction applications including heat generation. Effect of the geometry on these processes. Basic principles of design of heat transfer equipment and its operation. Application of species mass balances and Fick's Law to steady state and transient diffusion problems. Effect of geometry on these processes. Analogies between transport of momentum, heat and mass applications to the solution of practical problems in the Food Process and Biological Engineering fields.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Design Of Electronic Systems",
        "subjectCode": "ABE",
        "courseCode": "31400",
        "instructor": [
            "Jian Jin"
        ],
        "description": "Fundamental aspects of circuits, microprocessors, transducers, sensors, instrumentation, and data acquisition are presented, with particular emphasis on electronic systems used in agricultural, biological, and food applications. Laboratory exercises used to apply the course material to constructing and testing circuits, microprocessor controlled systems, and the data collection and monitoring of systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Solid Modeling, Simulation, And Analysis",
        "subjectCode": "ABE",
        "courseCode": "32000",
        "instructor": [
            "Stanley D Harlow"
        ],
        "description": "Introduction to parametric, feature-based solid modeling; dimensioned 2D and 3D engineering drawings; tolerancing; mechanical dynamic simulation; kinematic models, analysis and simulation of simple linkages and complex systems; mechanism design and evaluation; visualization and animation of results; interfacing of computer aided engineering software. Projects involving industrial parts and assemblies will be discussed and assigned.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Design Of Machine Components",
        "subjectCode": "ABE",
        "courseCode": "33000",
        "instructor": [
            "Robert M Stwalley"
        ],
        "description": "Introduction to design; stress analysis; deformation and stiffness considerations; static and fatigue strength design; design of components of the food processing, farm and off-highway machines, and mechanical systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Ag/Biol Engineering Ambassador Leadership Seminar",
        "subjectCode": "ABE",
        "courseCode": "40600",
        "instructor": [
            "Ankita Raturi"
        ],
        "description": "Students engage in weekly seminar/lab that includes topics such as leadership, professional skills, teamwork, engaging audiences and Purdue culture. Students utilize these skills while representing the Department of Agricultural and Biological Engineering to current and prospective students, alumni, donors, legislators, and other supporters of Purdue Agricultural and Biological Engineering department. Students must be selected as an ABE Ambassador. Permission of department required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Water Quality Engineering",
        "subjectCode": "ABE",
        "courseCode": "42500",
        "instructor": [
            "Margaret W Gitau"
        ],
        "description": "This course provides in-depth perspectives on water quality in source and environmental water system (lakes, rivers, groundwaters, and coastal waters) including sources and causes of water quality impairments and design of workable and cost-effective management solutions. The course integrates hydrology, chemistry, biology, and ecology as foundations of water quality management and incorporates operation mechanisms of management practices in designing solutions for pollution control. Students will have opportunities to engage with lectures, water quality measurements and data analysis, computer modeling, case studies, design and discussion sessions.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Cell And Molecular Design Principles",
        "subjectCode": "ABE",
        "courseCode": "44000",
        "instructor": [
            "Caitlin Rose Proctor"
        ],
        "description": "This course examines the design principles underlying the organizations and dynamics of biological networks with an emphasis on genetic/molecular circuits. Topics include the structure and tuning of network motifs and relationship to performance parameters such as robustness to internal noise, temporal response, noise filtering, bi-stability, pattern generation and temporal programs. Examples are presented from the study of natural systems and the design of new synthetic systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Design And Advanced Manufacturing Processes For Internal Combustion Engines",
        "subjectCode": "ABE",
        "courseCode": "44400",
        "instructor": [
            "Robert M Stwalley"
        ],
        "description": "  This course introduces the manufacture and assembly of machined piece parts into a functional assembly.  The creation of a prototype internal combustion engine will be utilized as the base project for the course, and students will design and create the parts and final assemblies.  Students will be given a background on the process flow of modern manufacturing by general metal machining processes, manual machine tool operation, digital machine tool programming, numerical machine tool operation, the measurement of critical machining output variables, and the assembly of piece parts into subassemblies and final products.  Course participants will work as a team to develop their production parts, final presentation, and final report.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Transport Operations In Food And Biological Engineering I",
        "subjectCode": "ABE",
        "courseCode": "45700",
        "instructor": [
            "Ganesan Narsimhan"
        ],
        "description": "Application of momentum and heat transfer to biological and food process engineering. Viscosity, non-Newtonian fluids, experimental methods of rheological characterization of food and biological systems; viscoelasticity; design equations for pipe flow, pumps, mixing, emulsification, extrusion, sheeting, heat exchanges, aseptic processing, sterilization, freezing, and evaporation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Sensors And Process Control",
        "subjectCode": "ABE",
        "courseCode": "46000",
        "instructor": [
            "Lizhi Shang"
        ],
        "description": "Fundamental aspects of transducers, biosensors, instrumentation, and computer control are presented, with particular emphasis on sensors and controls used in agricultural, biological, and food applications. Laboratory and pilot plant scale computer controlled equipment is used to examine response of process variables, sensor calibration, control system modeling, and controller selection and tuning. Prereq: differential equations and a course in either heat transfer or fluid mechanics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Particle, Powder, and Compact Characterization",
        "subjectCode": "ABE",
        "courseCode": "50501",
        "instructor": [
            "Rose Prabin Kingsly Ambrose"
        ],
        "description": "  The goal of this course is to familiarize students with the properties and methods used to characterize the physical and mechanical behavior of particles, granules, and compacts with the intention of using these properties for process and performance design.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Nonpoint Source Pollution Engineering",
        "subjectCode": "ABE",
        "courseCode": "52900",
        "instructor": [
            "Margaret W Gitau"
        ],
        "description": "Engineering principles involved in assessment and management of nonpoint source (NPS) pollution. Effect of NPS pollution on ecosystem integrity. Use of GIS/mathematical models to quantify extent of pollution. Design/implementation of best management practices to reduce nonpoint source pollution and improve water quality. Discussion of total maximum daily load (TMDL) principles and processes.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Instrumentation And Data Acquisition",
        "subjectCode": "ABE",
        "courseCode": "53100",
        "instructor": [
            "Keith A Cherkauer"
        ],
        "description": "This course educates students in the use, selection, and design of instrumentation and data acquisition for agricultural, food, environmental, and biological systems. Emphasis is on measurement of position (GPS), force, pressure, power, torque, flow, and temperature along with environmental sensors. Labs focus on building and using measurement systems and programming PC computers for data acquisition and analysis. Prior knowledge of electrical circuitry is desirable.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Process Design For Food And Biological Systems",
        "subjectCode": "ABE",
        "courseCode": "55800",
        "instructor": [
            "Martin R Okos"
        ],
        "description": "This course will focus on the design, synthesis, creation, evaluation, and optimization of processes to convert basic biological materials into a finished product. Concepts of materials and energy balances, thermodynamics, kinetics, transport phenomena of biological systems will be used to design processes to minimize energy and environmental impacts, and evaluate economic factors while maintaining product quality.  Course will include group projects, oral and written reports.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Process Engineering Of Renewable Resources",
        "subjectCode": "ABE",
        "courseCode": "58000",
        "instructor": [
            "Nathan S Mosier"
        ],
        "description": "Physical and chemical structure of biomass. Reaction kinetics of hydrolysis of hemicellulose and cellulose to fermentable sugars. Fundamentals of ethanol production by fermentation. Separation of fermentation products into pure components.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Design& Modeling Fluid Pwr Sys",
        "subjectCode": "ABE",
        "courseCode": "59100",
        "instructor": [
            "Andrea Vacca",
            "Meng Deng",
            "Teresa M Carvajal",
            "Stephen Robert Byrn",
            "Somali Chaterji"
        ],
        "description": "Primarily designed for students (two or more) desiring credit from subject areas for which no specific course, workshop, or individual study plan is offered. Area of study will deal with topics that have enough student interest to justify the formalized teaching of a specialized topic. The course may be repeated by a student as long as the topic being taught is not repeated. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Environmental Informatics",
        "subjectCode": "ABE",
        "courseCode": "65100",
        "instructor": [
            "Keith A Cherkauer"
        ],
        "description": "This course will educate students in the use, manipulation and analysis of environmental data by introducing them to scripting languages (e.g. c-shell, python), data types (e.g. ASCII, binary, NetCDF), databases (e.g. XML, DBF) and data visualization software (e.g. GMT, ArcMap) as well as techniques for checking data quality, working with missing data, and handling large diverse sources of time series and spatial data. Students will manipulate, check and insert data from a variety of sources, use that data as input to distributed hydrologic model, analyze model output and learn methods for properly documenting their data use (creation of metadata) and long-term archival storage of those data. Skills learned should be applicable to most computer operating systems, but the majority of work for this class will be done within the Unix/Linux environment. Students taking this course should have experience with one or more programming languages, including but not limited to C, Fortran, Perl, Python, java, Basic, or two writing scripts or macros within programs such as MatLab, S-Plus, R, SAS.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Graduate Seminar",
        "subjectCode": "ABE",
        "courseCode": "69600",
        "instructor": [
            "D. Marshall Porterfield"
        ],
        "description": "Best practices for effectively presenting scientific research are taught and practiced. Students will also present a twenty-minute seminar of original research results, as well as provide and receive constructive criticism on presentation form and content for improved future presentations.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2023"
    }
]