[
    {
        "title": "Introduction To Animal Agriculture",
        "subjectCode": "ANSC",
        "courseCode": "10200",
        "instructor": [
            "John R Blanton"
        ],
        "description": "A study of animal agriculture emphasizing the efficient production of animal food products from poultry, dairy and meat animals.  Course may also be offered for dual credit with cooperating Indiana high schools upon documented approval by Department of Animal Sciences. This course is required for ANSC majors classified as Freshman and Sophomores.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Biology Companion Animal",
        "subjectCode": "ANSC",
        "courseCode": "10600",
        "instructor": [
            "Rodney D Allrich"
        ],
        "description": "<a href=\"javascript:history.go(-1)\" onmouseover=\"window.status='Return to Previous';  return true\" onfocus=\"window.status='Return to Previous';  return true\" onmouseout=\"window.status='';  return true\" onblur=\"window.status='';  return true\">Return to Previous</a>",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Orientation To Animal Sciences",
        "subjectCode": "ANSC",
        "courseCode": "18100",
        "instructor": [
            "James J Krotz"
        ],
        "description": "Introduction to the faculty, programs, opportunities, career preparation, and personal development requirements needed to succeed in a career in the animal industries. Course meets during weeks 1-8. Requires class trips. Students will pay individual lodging or meal expenses when necessary.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Principles Of Animal Nutrition",
        "subjectCode": "ANSC",
        "courseCode": "22100",
        "instructor": [
            "Dale M Forsyth"
        ],
        "description": "Classification and function of nutrients, deficiency symptoms, digestive processes, characterization of feedstuffs, and formulation of diets for domestic animals.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Physiology Of Domestic Animals",
        "subjectCode": "ANSC",
        "courseCode": "23000",
        "instructor": [
            "Ryan A Cabot"
        ],
        "description": "A lecture and laboratory course designed to present physiology of domestic farm animals. Function of tissues and organs, maintenance of internal steady-state conditions, and body responses to external environmental conditions will be presented. Physiological mechanisms involved in lactation, growth, and reproduction will be included.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Principles Of Animal Production",
        "subjectCode": "ANSC",
        "courseCode": "24000",
        "instructor": [
            "Paul D Ebner"
        ],
        "description": "A comprehensive overview of production systems including life cycles and animal requirements for non-ruminant and ruminant farm animals species. How animal production is affected by the environment, availability of resources, and market access will emphasized. Data requirements and interpretation for decision making will be highlighted.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Applied Animal Management",
        "subjectCode": "ANSC",
        "courseCode": "24500",
        "instructor": [
            "Michael Neary"
        ],
        "description": "Skills and practices related to handling and care of beef and dairy cattle, horses, poultry, sheep, and swine.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Career Planning In Animal Sciences",
        "subjectCode": "ANSC",
        "courseCode": "28100",
        "instructor": [
            "Barry L Delks"
        ],
        "description": "A seminar course designed to inform students of the career opportunities in animal industries, develop their interviewing and other interpersonal skills, and begin to plan the course of study, work experiences, and marketing methods needed to obtain a successful internship and employment.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Animal Behavior",
        "subjectCode": "ANSC",
        "courseCode": "30300",
        "instructor": [
            "Marisa A Erasmus"
        ],
        "description": "Discussion of animal behavior with emphasis on developing an understanding of the reasons domesticated animals react the way they do toward their kind and to humans. The laboratory will be used for observation of behavior patterns in animals. Solutions for unusual behavior include behavior modification techniques.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Animal Breeding And Genetics",
        "subjectCode": "ANSC",
        "courseCode": "31100",
        "instructor": [
            "Luiz Fernando Brito"
        ],
        "description": "Genetic principles and their applications in improvement of production efficiency in livestock.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Applied Ruminant Nutrition",
        "subjectCode": "ANSC",
        "courseCode": "32500",
        "instructor": [
            "Jon Schoonmaker"
        ],
        "description": "Application of the principles of ruminant nutrition to the formulation and feeding of supplements and complete rations for animals; ration ingredients and substitution values; computer applications; legal aspects of feed formulation; and industry practices.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Applied Non-ruminant Nutrition",
        "subjectCode": "ANSC",
        "courseCode": "32600",
        "instructor": [
            "John Scott Radcliffe"
        ],
        "description": "Application of the principles of non-ruminant nutrition to the formulation and feeding of supplements and complete rations for animals; ration ingredients and substitution values; computer applications; legal aspects of feed formulation; and industry practices.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Environmental Physiology Of Domestic Animals",
        "subjectCode": "ANSC",
        "courseCode": "33200",
        "instructor": [
            "Rodney D Allrich"
        ],
        "description": "<a href=\"javascript:history.go(-1)\" onmouseover=\"window.status='Return to Previous';  return true\" onfocus=\"window.status='Return to Previous';  return true\" onmouseout=\"window.status='';  return true\" onblur=\"window.status='';  return true\">Return to Previous</a>",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Physiology Of Reproduction",
        "subjectCode": "ANSC",
        "courseCode": "33300",
        "instructor": [
            "Jonathan A Pasternak"
        ],
        "description": "This course is designed to introduce students to the essential principles of mammalian reproduction and apply this knowledge in a hands-on laboratory setting. Upon completion of this course, students are expected to understand the processes of sexual determination, sexual differentiation, steroid hormone signaling, spermatogenesis, oogenesis, fertilization, gestation, parturition and lactation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Meat Science",
        "subjectCode": "ANSC",
        "courseCode": "35100",
        "instructor": [
            "Stacy M Zuelly"
        ],
        "description": "Study of muscle and meat, principles involved in the conversion of living animals to meat and by-products; efficient utilization of all types of meat as food.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Sheep Management",
        "subjectCode": "ANSC",
        "courseCode": "44200",
        "instructor": [
            "Michael Neary"
        ],
        "description": "Breeding, feeding, and management practices essential for economical sheep production and commercial lamb feeding, including performance testing.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Swine Management",
        "subjectCode": "ANSC",
        "courseCode": "44300",
        "instructor": [
            "Allan P Schinckel"
        ],
        "description": "Breeding, feeding, and management practices essential for commercial swine production, including performance testing.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Dairy Farm Evaluation",
        "subjectCode": "ANSC",
        "courseCode": "48500",
        "instructor": [
            "Jacquelyn P Boerman"
        ],
        "description": "This course will provide students with an opportunity to integrate and apply knowledge of dairy cattle management systems, nutrition, reproduction, genetics, milk quality, animal handling, physical farm facilities, manure handling and management, personnel and their financial implications. Students will develop critical analysis skills and apply troubleshooting principles in the identification and resolution of dairy farm management issues in a learning environment that is structured around farm evaluation field trips and case studies.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Cracking The Poultry Industry",
        "subjectCode": "ANSC",
        "courseCode": "49500",
        "instructor": [
            "Marisa A Erasmus"
        ],
        "description": "Lecture presentation of specialized material not available in the formal courses of the department. The specific topic that is offered will be indicated on the student's record. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Design Of Animal Breeding Programs",
        "subjectCode": "ANSC",
        "courseCode": "51300",
        "instructor": [
            "Allan P Schinckel"
        ],
        "description": "Integration of principles of animal breeding and genetics into animal improvement programs. Emphasis is placed on the interaction among genetics, nutrition, and physiology.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Molecular Microbiome Analysis",
        "subjectCode": "ANSC",
        "courseCode": "51600",
        "instructor": [
            "Timothy A Johnson"
        ],
        "description": "  The overall goal of the course is to provide students with an advanced understanding of microbial ecology in the animal microbiome and how to analyze next-generation sequencing data of amplicon libraries. In order to complete this goal, students will participate in activities including classroom lecture, group discussion, critical reading of literature, written assignments and exams, and student projects. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Ruminant Nutrition And Physiology",
        "subjectCode": "ANSC",
        "courseCode": "52400",
        "instructor": [
            "Jon Schoonmaker"
        ],
        "description": "Physiological, microbiological, and biochemical effects and their interrelationships on digestion and metabolism in the ruminant animal.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Advanced Reproductive Physiology",
        "subjectCode": "ANSC",
        "courseCode": "53400",
        "instructor": [
            "Zoltan Machaty"
        ],
        "description": "A study of mechanisms that interact to control reproduction in farm animals. Current scientific literature and hypotheses are presented, and potential methods to enhance reproductive efficiency are examined.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Adipocyte Biology",
        "subjectCode": "ANSC",
        "courseCode": "53700",
        "instructor": [
            "Kolapo Matthew Ajuwon"
        ],
        "description": "This course will provide the student with a conceptual background in the development of adipose tissue and its biological function with emphasis on the endocrine and immunologic aspects of the adipocyte. Differences between species will be emphasized where possible.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Animal Growth And Development",
        "subjectCode": "ANSC",
        "courseCode": "55500",
        "instructor": [
            "Shihuan Kuang"
        ],
        "description": "A study of the molecular and cellular processes controlling embryonic development and growth of domesticated animals. Includes discussions of current research concerning molecular mechanisms of fertilization, egg activation, early development, and endocrine factors controlling cell growth, differentiation, and tissue formation. Experimental approaches utilized for developmental and growth biology research are discussed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Applied Teaching In Animal Sci",
        "subjectCode": "ANSC",
        "courseCode": "59500",
        "instructor": [
            "Greg S Fraley",
            "Jonathan A Pasternak"
        ],
        "description": "Lecture presentation of specialized material not available in the formal courses of the department. The specific topic offered is indicated on the student's record. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Nutritional Biochemistry And Physiology II",
        "subjectCode": "ANSC",
        "courseCode": "62600",
        "instructor": [
            "Kolapo Matthew Ajuwon"
        ],
        "description": "(NUTR 60600) Integration of biochemical and physiological functions of nutrients in humans and animals emphasizing post-absorptive use of nutrients as sources of energy and for the synthesis of macromolecules. Offered weeks 1 - 8. Prerequisite: ANSC 62500.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Nutritional Biochemistry And Physiology III",
        "subjectCode": "ANSC",
        "courseCode": "62700",
        "instructor": [
            "Qing Jiang"
        ],
        "description": "(NUTR 60700) Integration of biochemical and physiological functions of nutrients in humans and animals, emphasizing lipid metabolism and transport in the context of cardiovascular function. Offered weeks 9 - 16. Prerequisite: ANSC 62600.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Animal Sciences Graduate Seminar",
        "subjectCode": "ANSC",
        "courseCode": "68100",
        "instructor": [
            "Timothy A Johnson"
        ],
        "description": "Instruction and application of concepts for effective oral professional presentations in the field of Animal Sciences. The course will provide students with knowledge for effective oral communication of scientific information and an opportunity to put guidelines into practice. Permission of department required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2023"
    }
]