[
    {
        "title": "Seminar In Agricultural Education",
        "subjectCode": "ASEC",
        "courseCode": "24000",
        "instructor": [
            "Amy K Conrad"
        ],
        "description": "Development of an understanding of the origin, scope, and objectives of agricultural education; role of the agricultural science and business teacher as a professional educator; basic responsibilities of a teacher of agricultural science and business; and significance of legislation affecting agricultural education.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Digital Storytelling",
        "subjectCode": "ASEC",
        "courseCode": "28000",
        "instructor": [
            "Kevin Leigh Smith"
        ],
        "description": "Students will plan, shoot, and edit videos; collaborate in teams; plan and generate social media; and write feature pieces for digital platforms. Students will gain meaningful digital storytelling experiences that will enhance their understanding of various platforms and build their professional portfolios.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Introduction To Publication Design",
        "subjectCode": "ASEC",
        "courseCode": "28500",
        "instructor": [
            "Mark A Tucker"
        ],
        "description": "Introduction to pre-press production of professional-quality publications. Emphasis on computer applications for publication layout, design and production. Topics include composition, readability, typography, graphic resolution, and color management systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Building Intercultural Partnerships",
        "subjectCode": "ASEC",
        "courseCode": "30100",
        "instructor": [
            "Maria Julia Bello Bravo"
        ],
        "description": "This course uses a combination of readings, videos, experiential activities, presentations, and face-to-face & virtual excursions/engagement with \"other/different\" international cultural groups to deepen students' ownership of their own learning and to identify and understand both similarities and differences in values and social norms across countries and cultures. Students will enhance their intercultural communication skills, their emotional resilience, and their ability to engage effectively and equitably in conversations and partnerships with people from other countries and cultures.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Coordination Of Supervised Agricultural Experience Programs",
        "subjectCode": "ASEC",
        "courseCode": "31800",
        "instructor": [
            "Brian Allen Talbert"
        ],
        "description": "Record keeping and supervisory skills needed to advise and coordinate supervised agricultural experience programs for secondary agricultural science and business students. Integration of supervised agricultural experiences with programming in youth organizations and classroom instruction for secondary agricultural science and business classrooms.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Planning Agricultural Science And Business Programs",
        "subjectCode": "ASEC",
        "courseCode": "31900",
        "instructor": [
            "Brian Allen Talbert"
        ],
        "description": "Development of course content plans that coordinate and utilize agricultural science and business, community resources, FFA, and supervised agricultural experience programs.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Curriculum Development In Agricultural Education",
        "subjectCode": "ASEC",
        "courseCode": "34100",
        "instructor": [
            "Sarah E LaRose"
        ],
        "description": "This course is designed to expose students to appropriate teaching techniques, curricula and resources within agricultural education. Procedures for designing, implementing, and evaluating curriculum will be examined. Emphasis will be placed on new and emerging areas in agriculture, food, and natural resources.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Feature Writing And Production",
        "subjectCode": "ASEC",
        "courseCode": "38000",
        "instructor": [
            "Kevin Leigh Smith"
        ],
        "description": "Students gain hands-on studio experiences in all phases of features writing, storytelling, and production. Students will analyze audiences, generate story ideas, research, interview, write, edit, shoot photos, plan social media, design pages, and can shoot short-form video.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Communicating Controversl Sci",
        "subjectCode": "ASEC",
        "courseCode": "49100",
        "instructor": [
            "Beth A Forbes"
        ],
        "description": "Designed for specialized topic areas for which there is no specific course, but have enough student interest to justify formalized teaching of an undergraduate-level course. The course may be repeated by a student as long as the topic being taught is not repeated.  The specific topic that is offered will be indicated on the student's record. To be arranged with the instructor or departmental representative prior to registering. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Teaching STEM Through Agriculture, Food And Natural Resources",
        "subjectCode": "ASEC",
        "courseCode": "54500",
        "instructor": [
            "Neil A Knobloch"
        ],
        "description": "The course focuses on the background and history of STEM movement and agricultural education, contemporary models, strategies, and justification for incorporation of science, technology, engineering and mathematics (STEM) concepts and practices into K-12 formal and non-formal agricultural education programs. Consider and develop the best practices for STEM teaching and learning and enhancement of STEM content in agriculture, food and natural resources (AFNR) context. The goal of the course is to help students develop knowledge about STEM integration and equip them with teaching knowledge and skills for designing K-12 lesson plans by using integrated STEM through AFNR. Students will learn strategies that promote engagement in integrated STEM through AFNR activities. At the end of the course, students should be able to design and implement research-based integrated STEM through AFNR lesson plans and assessment plans.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Science Communication",
        "subjectCode": "ASEC",
        "courseCode": "58500",
        "instructor": [
            "Linda J Pfeiffer"
        ],
        "description": "This course utilizes foundational research and commentary from scholars to track the evolution of media and our ability as scientists to understand and effectively communicate these issues to a non-science audience. Science and technology are evolving faster than societies ability to understand, assimilate, and make policies to address these increasingly complex issues. As a result, controversies arise over issues such as climate change, forest management, genetically modified foods, energy choices, genetic engineering, nanotechnology, water management, and agricultural practices, etc. This course covers the range of issues in the field of science communication including: the nature of science, how to translate evidence for a lay audience, media practices, reporting and qualifying uncertainty, human psychology and belief systems, information processing, and the most current research for messaging science. We will work together to examine the foundational scholarly literature in this area and how it is/ or is not reflected in construction of popular media. You will use this knowledge to construct both compelling oral science narratives, and a science story for popular consumption.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Global Engagement Challenges",
        "subjectCode": "ASEC",
        "courseCode": "59100",
        "instructor": [
            "Rama B Radhakrishna",
            "Maria Julia Bello Bravo",
            "Linda J Pfeiffer"
        ],
        "description": "Specialized topics not covered in other courses. Topics, requirements, and credits to be determined yearly. To be arranged with the instructor or departmental representative prior to registering. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Spring 2023"
    }
]