[
    {
        "title": "Introduction To Pharmacology For Veterinary Technicians",
        "subjectCode": "BMS",
        "courseCode": "23300",
        "instructor": [
            "Melinda J Anderson"
        ],
        "description": "Credit Hours: 0.50.  This course introduces the concepts and terminology of pharmacology including basic terminology, pharmacokinetics, and pharmacodynamics.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Introduction To Confocal Microscopy And Image Analysis",
        "subjectCode": "BMS",
        "courseCode": "52400",
        "instructor": [
            "Joseph Paul Robinson"
        ],
        "description": "Introduction to the principles of confocal microscopy and rudiments of image analysis. Confocal microscopy can be used in biological and nonbiological systems and is, therefore, an interdisciplinary tool in the modern research laboratory. The three-dimensional reconstruction of images allows discovery of complex structures. Deals with fluorescence excitation and emission, optical design, basic image analysis principles, and application areas for which the technology has been targeted. The student will have a good understanding of the application and use of the technology by the end of the course.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Basic Bone Biology",
        "subjectCode": "BMS",
        "courseCode": "59800",
        "instructor": [
            "Russell P Main"
        ],
        "description": "Introduction to research in pharmacology and physiology under the direction of a member of the departmental graduate faculty. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Flow Cytometry: Theory",
        "subjectCode": "BMS",
        "courseCode": "63100",
        "instructor": [
            "Joseph Paul Robinson"
        ],
        "description": "A thorough excursion into the theory of flow cytometry. An understanding of what the technology is, how it operates, and where the applications exist. Covers optical systems, including filters, light excitation and emissions, fluorescent dyes and fluorescent molecules, electronics including detection systems, signal processing, data analysis, and computer applications. A discussion of lasers and other light sources, as well as quality control. Overview of the application areas in medical sciences, biological research, and other possible areas of use.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Seminar In Basic Medical Sciences",
        "subjectCode": "BMS",
        "courseCode": "69200",
        "instructor": [
            "Guangjun Zhang"
        ],
        "description": "Oral presentation of assigned or selected topics pertaining to physiology and pharmacology.",
        "capacity": 0,
        "credits": [
            0,
            1
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Comparative Anatomy",
        "subjectCode": "BMS",
        "courseCode": "80200",
        "instructor": [
            "Kari J Ekenstedt"
        ],
        "description": "A comparative study of the body systems and the topographic relationships of the major domestic species. This course is an extension of BMS 80100 and will continue to build on anatomical knowledge so that it may be applied to multiple domestic species.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Applied Anatomy Of Production Animals",
        "subjectCode": "BMS",
        "courseCode": "80500",
        "instructor": [
            "Laurie A Jaeger"
        ],
        "description": "Consists of seven 50-minute lectures and/or discussion periods and seven 120-to-150-minute laboratory sessions, plus a comprehensive final exam. Course material is based upon clinical conditions of the production animals that have an anatomical basis or emphasis. Laboratory sessions include topographical anatomy; joint and nerve injections and performance or other clinical procedures; use of multimedia learning aids; and dissection of the head, neck, viscera, and legs.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Veterinary Cell And Tissue Biology Design II",
        "subjectCode": "BMS",
        "courseCode": "80800",
        "instructor": [
            "Marxa L Figueiredo"
        ],
        "description": "All lectures will focus on mammalian microanatomy with species differences and aim to include also a brief comparative description for Avian microanatomy when applicable. Structural and molecular basis of cellular processes that are the foundation of fertilization, embryogenesis, histogenesis, and basic tissue specialization in domesticated animals. Structure and function of macromolecules and organelles that mediate signal transduction, differentiation, and integration within a whole animal.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Physiology Of Domestic Animals II",
        "subjectCode": "BMS",
        "courseCode": "81200",
        "instructor": [
            "Dianne Little"
        ],
        "description": "Continuation of Physiology of Domestic Animals I (BMS 81100). Survey of the principles, concepts and mechanisms of physiological processes with special emphasis on interactions between large populations of cells, tissues, organ systems and integrated functions of domestic animals of importance to veterinary medicine. The organ systems covered are respiratory, renal, digestive, endocrine, and reproductive.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Veterinary Neuroscience",
        "subjectCode": "BMS",
        "courseCode": "81500",
        "instructor": [
            "Kevin M Hannon"
        ],
        "description": "This course provides an introduction to neuroscience and its diagnostic application in veterinary medicine. Students will acquire terminology describing the anatomy and basic physiology that characterize neural systems. Integration of function/structure relationships will be introduced in lectures and laboratories, by reference to case studies, and by problem-solving.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Applied Pharmacology II",
        "subjectCode": "BMS",
        "courseCode": "81600",
        "instructor": [
            "Melinda J Anderson"
        ],
        "description": "Credit Hours: 1.50.  This DVM curriculum course covers drugs used to fight pathogens (antifungals, antibiotics, antivirals, antiparasitics), and drugs for immunomodulation and cancer therapy. New topics are introduced according to upcoming developments in drug use such as pharmacogenomics. A journal club session is included to directly relate pharmacology instruction to topics currently debated in the field.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Endocrine And Neural Basis Of Seasonal Activities Of Birds And Mammals In The Wild",
        "subjectCode": "BMS",
        "courseCode": "81900",
        "instructor": [
            "Elikplimi K Asem"
        ],
        "description": "This one-credit elective course will be offered to first and second year veterinary students annually (third year students may also take it). The course will explore the physiological basis of seasonal activities of mammals and birds in the wild. An emphasis will be placed on the neural and endocrine changes that are associated with the seasonal and cyclical activities including breeding, hibernation, migration, etc.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2023"
    }
]