[
    {
        "title": "Introduction To Plant Science",
        "subjectCode": "BTNY",
        "courseCode": "11000",
        "instructor": [
            "Jeneen S Fields"
        ],
        "description": "An introduction to the major groups in the plant kingdom, their origin, classification, and economic importance. The areas of anatomy, morphology, cytology, physiology, biochemistry, molecular biology, genetics, and ecology will be explored as they relate to plant sciences and agriculture. Course may also be offered for dual credit with cooperating Indiana high schools upon documented approval by the Department of Botany and Plant Pathology.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Principles Of Plant Biology II",
        "subjectCode": "BTNY",
        "courseCode": "12100",
        "instructor": [
            "Michael V Mickelbart"
        ],
        "description": "This course is an introduction to fundamental biological concepts as they relate to plant biology to better prepare students for more specialized study. Lectures and laboratory exercises will cover mechanisms and processes of plant ecology, physiology and genetics. Our goal is to convey how these levels of organization all contribute to the relative success of plants within and across environments. Throughout the course, an emphasis will be made on the means by which scientific data is collected and interpreted, and key experiments performed in the lab component will be used to illustrate this process.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "The Microbial World",
        "subjectCode": "BTNY",
        "courseCode": "20700",
        "instructor": [
            "Daniel B Raudabaugh"
        ],
        "description": "This course delivers a broad synthesis of microbiology, discussing all taxa of the microbial world. The course also discusses a wide range of subjects related to microbiology, including medical microbiology, but it has a strong emphasis on the botanical and environmental sciences. One particular characteristic that separates it from other microbiology courses is the reduced emphasis upon bacteriology, with discussions of the protists and viruses and, especially of the fungi, occurring in greater detail than the other general microbiology courses available.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Plant Ecology",
        "subjectCode": "BTNY",
        "courseCode": "30200",
        "instructor": [
            "Christopher G Oakley"
        ],
        "description": "Offered in odd-numbered years. This course will provide an introduction to the broad field of plant ecology. Through lectures and lab assignments, students will gain an in-depth understanding of ecological concepts regarding the occurrence and distribution of plant species and populations. Students will also gain insights into the application of these concepts to the conservation and management of plant species and populations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Biotechnology In Agriculture",
        "subjectCode": "BTNY",
        "courseCode": "35000",
        "instructor": [
            "Robert E Pruitt"
        ],
        "description": "(HORT 35000) A study of the methods used to produce genetically modified organisms, primarily using gene transfer technology, and the application of these organisms in agriculture. The uses of microbes, plants, and animals in agricultural biotechnology are examined. Social, economic, and ethical issues related to biotechnology are discussed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Plant Disease Management",
        "subjectCode": "BTNY",
        "courseCode": "53500",
        "instructor": [
            "Christian D Cruz"
        ],
        "description": "An introduction to the epidemiological basis of disease management strategies. The course includes concepts in botanical epidemiology, disease assessment and measurement, disease modeling, epidemics comparison, and a revision of the traditional plant disease control principles. This is an upper-level course and intended for students interested in plant pathology, agronomy, or closely related areas.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Molecular Approaches In Plant Biology",
        "subjectCode": "BTNY",
        "courseCode": "55200",
        "instructor": [
            "Zhixiang Chen"
        ],
        "description": "This is mainly a laboratory exercise course designed to help students to be more familiar with common molecular techniques used in plant pathology studies. Techniques will include DNA/RNA isolation, hybridization, sequence analyses, various PCR reactions, library construction and screening, protein isolation, and plant transformation. Lectures will cover basic principles and applied aspects of molecular studies in plant pathology, and recent advances in genomics and proteomics techniques.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Survey Of Mathematical Biology",
        "subjectCode": "BTNY",
        "courseCode": "56100",
        "instructor": [
            "Gordon G Mcnickle"
        ],
        "description": "This course is intended to help students understand why having some kind of model is probably essential to the scientific process. The intent is to show students that they probably already have a model in their heads, and they just don't know it! Few biologists realize that when they can draw a picture of their system, or explain important pathways in words, that this is a model. From there, it isn't hard to start some basic math. The course will be a broad overview of different techniques that can be used to model biological systems. Each lecture topic in this course could itself form an entire course, so students will not complete the course as experts in mathematical modeling. Instead, the objectives are to: 1) expose students to a number of tools in mathematical modeling; 2) give students some practical experience with these tools; and 3) develop a component of their thesis research into a model. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Scientific Presentations",
        "subjectCode": "BTNY",
        "courseCode": "59000",
        "instructor": [
            "Sharon A Kessler",
            "Christopher J Staiger"
        ],
        "description": "Open to graduate students and qualified undergraduates who desire to study special problems in plant science not covered in regular coursework. Credit dependent upon work done. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Advanced Plant Pathology",
        "subjectCode": "BTNY",
        "courseCode": "61300",
        "instructor": [
            "Gurmukh S Johal"
        ],
        "description": "This course makes an exhaustive attempt to dissect the nature of plant disease and resistance mechanisms in plants. Special emphasis is placed on emerging concepts and paradigms that underlie a wide variety of plant-pathogen interactions, and how the knowledge gleaned from these studies is being used to devise effective and environmentally safe strategies of plant protection. It is expected that students have knowledge in genetics, molecular biology, biochemistry, and plant pathology.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Scientific Writing",
        "subjectCode": "BTNY",
        "courseCode": "66000",
        "instructor": [
            "Damon R Lisch"
        ],
        "description": "This is a course on coping with publication in professional journals. It covers the full range of activities involved in carrying a piece of original research to completion as a primary research article in a refereed journal. Emphasis is on principles of clear and concise technical reporting. Topics include: research and writing goals; journals' policies; data presentations; effective style; organizing, writing, revising, and processing manuscripts; proofreading; peer review; ethics; and grant proposals. Students will use their own data to prepare a manuscript as if for publication. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    }
]