[
    {
        "title": "Principles And Practice Of Geomatics",
        "subjectCode": "CE",
        "courseCode": "20300",
        "instructor": [
            "Melba M Crawford"
        ],
        "description": "Basic surveying measurements and computations for engineering project control, mapping, and construction layout; theory of observational errors and error propagation; fundamental concepts of horizontal and vertical control systems; use of topographic maps and plan-profile sheets; computation of horizontal and vertical curves; introduction to computer tools used in Civil Engineering.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Thermal And Energy Sciences",
        "subjectCode": "CE",
        "courseCode": "21101",
        "instructor": [
            "Ming Qu"
        ],
        "description": "This course includes applications of thermal science and energy fundamentals to civil engineering topics. Emphasis is placed on fundamental concepts of properties of materials, work, heat, internal energy, entropy, equilibrium, and relations derived from the first and second laws of thermodynamics. Example applications include: power plants; fluid flow in ducts/pipes; thermal properties of building/construction materials and processes; geothermal systems; heating, ventilation, and air conditioning (HVAC) processes; energy balances in buildings; refrigeration; hydroelectric power; contaminant transport in air, water, and soil; climate change; the urban heat island effect; and energy use in the transportation sector.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Life Cycle Engineering And Management Of Constructed Facilities",
        "subjectCode": "CE",
        "courseCode": "22200",
        "instructor": [
            "Geoffrey H Graff"
        ],
        "description": "The objective of this course is to introduce concepts relating to the engineering and construction of facilities throughout their life cycle. Topics that will be explored include the nature of the construction industry, construction contracts, legal and management organization of construction companies, basics of the design and construction process, as well as an introduction to the role estimating and project scheduling. Cost, time, safety and quality concepts of construction management relationships will also be discussed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Introductory Structural Mechanics",
        "subjectCode": "CE",
        "courseCode": "27000",
        "instructor": [
            "Arun Prakash"
        ],
        "description": "Loads; structural forms; analysis of axially loaded members, flexural members, torsional members; combined loading conditions; buckling. Basic behavioral characteristics of structural elements and systems illustrated by laboratory experiments.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Contemporary Issues In Civil Engineering",
        "subjectCode": "CE",
        "courseCode": "29202",
        "instructor": [
            "John C Tompkins"
        ],
        "description": "This course provides a forum on issues in the civil engineering profession in a contemporary context. Topics include professionalism and ethics, entrepreneurship, cultural differences, and collaborating globally. Students have interactions with engineering faculty and professionals outside the University. Guidance on the preparation of individual plans of study and information on civil engineering career options are provided. Students learn and apply fundamental aspects of written communication in professional settings. Emphasis is placed on delivery of technical and managerial content. Students will compile a professional portfolio of communication assignments, including lab reports prepared in other CE courses.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Basic Mechanics I (Statics)",
        "subjectCode": "CE",
        "courseCode": "29700",
        "instructor": [
            "Mohammadreza Nmi Mirzahosseini"
        ],
        "description": "Statics of particles. Rigid bodies: equivalent systems of forces, equilibrium. Centroids and centers of gravity. Static analysis of trusses, frames, and machines. Friction. Area moments of inertia.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Basic Mechanics II Dynamics",
        "subjectCode": "CE",
        "courseCode": "29800",
        "instructor": [
            "Ayhan Irfanoglu"
        ],
        "description": "Kinematics of particles. Kinetics of particles and systems of particles. Kinematics of rigid bodies. Mass moments of inertia. Kinetics of rigid bodies. Mechanical vibrations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "3D Printing Of Concrete",
        "subjectCode": "CE",
        "courseCode": "29900",
        "instructor": [
            "Darcy M Bullock",
            "Jan Olek"
        ],
        "description": "Topics vary. Projects, special topics, or supplemental instruction. Arrange Hours and Credit. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            18
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Architectural Engineering",
        "subjectCode": "CE",
        "courseCode": "31100",
        "instructor": [
            "Panagiota Karava"
        ],
        "description": "This course introduces energy efficiency, thermal comfort, indoor environmental quality and green building design concepts. The course covers engineering fundamentals required for the design and analysis of building systems such as thermodynamics, fluid mechanics, heat and mass transfer, light and sound transmission. The course presents engineering principles and selected applications related to hydrothermal analysis of building enclosures, air conditioning processes in heating, ventilating and air conditioning systems, building illumination, and building acoustics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Civil Engineering Materials",
        "subjectCode": "CE",
        "courseCode": "33500",
        "instructor": [
            "Maria Mirian Velay Lizancos"
        ],
        "description": "An introduction to the relationships between fundamental structure of materials and their properties presented through a combination of materials science and engineering approaches. Emphasis on materials of particular interest for civil engineering applications, including metals, aggregates, portland cement concrete, bituminous materials, asphalt binders, asphalt mixtures, wood, polymers, composites, and masonry. Laboratory exercises illustrate atomic structure, elastic and inelastic properties, and demonstrate applications of selected principles of mechanics, testing of aggregates, as well as designing and testing of asphalt and concrete mixtures.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Hydraulics",
        "subjectCode": "CE",
        "courseCode": "34000",
        "instructor": [
            "Dennis A Lyn"
        ],
        "description": "Fluid properties; hydrostatics; kinematics and dynamics of fluid flows; conservation of mass, energy, and momentum; flows in pipes and open channels. Formal laboratory experiments.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Introduction To Environmental And Ecological Engineering",
        "subjectCode": "CE",
        "courseCode": "35000",
        "instructor": [
            "Ernest R Blatchley"
        ],
        "description": "Introduction to water pollution, air pollution, noise, hazardous and solid wastes, and their control. Environmental impact statements and global pollution issues. Field trips required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Engineering Environmental Sustainability",
        "subjectCode": "CE",
        "courseCode": "35500",
        "instructor": [
            "Loring F Nies"
        ],
        "description": "(EEE 35500) An introduction to the examination of global-scale resource utilization, food, energy and commodity production, population dynamics, and their ecosystem impacts.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Transportation Engineering",
        "subjectCode": "CE",
        "courseCode": "36100",
        "instructor": [
            "Yiheng Feng"
        ],
        "description": "Transportation functions; transportation systems, including land, air, and marine modes; transportation system elements, including traveled way, vehicle, controls, and terminals; techniques of transportation system planning, design, and operation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Structural Analysis I",
        "subjectCode": "CE",
        "courseCode": "37100",
        "instructor": [
            "Mohammad Reza Jahanshahi"
        ],
        "description": "Stress resultants (reactions, axial forces, shear forces, and bending moments) for beams and framed structures. Deflections of beams and frames by geometric methods (moment-area theorems and applications; conjugate beam analogy). Analysis of statically indeterminate beams and frames by classical stiffness methods; slope deflection and moment distribution. Influence functions and their applications.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Geotechnical Engineering I",
        "subjectCode": "CE",
        "courseCode": "38300",
        "instructor": [
            "Maria Caterina Santagata"
        ],
        "description": "Introduction to the nature and origin of soils and rocks; engineering significance of geologic landforms and soil deposits; identification and engineering classification of soils; engineering behavior and properties of soils; permeability, compressibility, shearing resistance; soil compaction.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Technical Communication In Civil Engineering",
        "subjectCode": "CE",
        "courseCode": "39201",
        "instructor": [
            "John C Tompkins"
        ],
        "description": "This course will build upon the technical communication components of CE 29202, adding instruction in oral communication, projects, and working in teams. This course involves both individual and team assignments intended to offer students the opportunity to practice preparing and delivering written correspondence and reports, as well as oral presentations. These activities may be coordinated with other CE courses being taken by students in CE 39201.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Introduction To Civil Engineering Systems Design",
        "subjectCode": "CE",
        "courseCode": "39800",
        "instructor": [
            "Samuel Labi"
        ],
        "description": "An introduction to engineering economy and systems analysis. A systematic approach to the engineering method of design and problem solving.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Building Mechanical And Electrical System Design",
        "subjectCode": "CE",
        "courseCode": "41400",
        "instructor": [
            "William Travis Horton"
        ],
        "description": "This course covers the design of building mechanical and electrical systems. In the first part of the course students learn principles of designing and integrating heating, ventilation, and air conditioning systems into building air delivery systems, mechanical cooling and heating technologies, duct design and layout, blower and pump selection, and hydronic systems. They also learn to design heating, ventilation, and air conditioning systems within the constraint of achieving satisfactory occupant thermal comfort in buildings. The second part of the course covers design concepts related to building electrical systems; including, single and three-phase power systems, motors, transformers, switching, and relays. The course includes a design project related to mechanical and electrical systems for a commercial building.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Introduction To Hydrology",
        "subjectCode": "CE",
        "courseCode": "44200",
        "instructor": [
            "Venkatesh Mohan Merwade"
        ],
        "description": "Description, measurement, and analysis of hydrologic processes: precipitation, evapotranspiration, infiltration, and runoff. Hydrograph analysis: unit and synthetic unit hydrographs and flood routing. Statistical analysis of hydrologic data. Fundamentals, budget, and yield analysis of groundwater flows; well hydraulics. Case studies illustrating the application of principles in both surface and groundwater flows.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Air Pollution Control And Design",
        "subjectCode": "CE",
        "courseCode": "45700",
        "instructor": [
            "Robert B Jacko"
        ],
        "description": "Fundamental concepts and design procedures for the removal of particulates, gases, and toxic air pollutants from waste gas streams. Problem assessment; characterization of exhaust gas streams; fan characteristics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Structural Steel Design",
        "subjectCode": "CE",
        "courseCode": "47000",
        "instructor": [
            "Amit H Varma"
        ],
        "description": "The elements of structural steel design, including tension members and their connections; structural connections, including welding, and high-strength bolts; compression members; rolled and built-up flexural members; and combined axial and flexural loading effects.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Reinforced Concrete Design",
        "subjectCode": "CE",
        "courseCode": "47300",
        "instructor": [
            "Julio Alfonso Ramirez"
        ],
        "description": "Design and behavior of reinforced concrete beams, one-way slabs, and columns.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Structural Analysis II",
        "subjectCode": "CE",
        "courseCode": "47400",
        "instructor": [
            "Mark D Bowman"
        ],
        "description": "Determination of deflections by the method of virtual work; analysis of trusses, continuous beams, and frames by direct stiffness method; approximate methods of analysis.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Geotechnical Engineering II",
        "subjectCode": "CE",
        "courseCode": "48300",
        "instructor": [
            "Antonio Bobet"
        ],
        "description": "Subsurface investigations and techniques for sampling soils, lateral earth pressures, and stability of retaining structures; stability of earth slopes; shallow and deep foundations design.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Lighting In Buildings",
        "subjectCode": "CE",
        "courseCode": "51300",
        "instructor": [
            "Athanasios Tzempelikos"
        ],
        "description": "This course focuses on the design of illumination systems in buildings (electric and natural lighting) in order to achieve energy efficiency and visual comfort. The first part of the course includes analytical lighting calculation techniques, visual perception, radiative transfer, lamp characteristics, electric lighting system design and control for calculation of required indoor illuminance levels. The second part of the course covers daylighting (natural lighting) systems, including state-of-the-art daylighting prediction models as well as design and control of such devices and advanced metrics. The course also has a lab section, in which the students learn how to work with lighting and daylighting tools and build their own computational transient lighting models in open programming languages, in order to design illumination systems and predict electricity consumption and potential energy savings.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Construction Business Management",
        "subjectCode": "CE",
        "courseCode": "52100",
        "instructor": [
            "Dulcy M Abraham"
        ],
        "description": "Develops students' understanding of the fundamental theories and applied principles of management of U.S. construction companies. Exposes students to the present and future practice of business management at the construction company level. Provides insight into basic construction business operations including strategic planning, organizational structure, marketing, accounting, financing, risk analysis, quality, and international construction business practice.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Selection And Utilization Of Construction Equipment",
        "subjectCode": "CE",
        "courseCode": "52300",
        "instructor": [
            "Hubo Cai"
        ],
        "description": "A study of economics and functional applications for major categories of construction equipment. Operational characteristics are identified for selected equipment items and are applied to typical construction situations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Bituminous Materials And Mixtures",
        "subjectCode": "CE",
        "courseCode": "53500",
        "instructor": [
            "John E Haddock"
        ],
        "description": "Consideration of major types of bituminous materials-asphalt cements, cutback asphalts, asphalt emulsions, and tars. Influence of chemical composition upon physical properties. Desirable aggregate characteristics for bituminous mixtures. Construction techniques. Current practices for determining optimum asphalt contents. Two one-day field trips are required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Subsurface Hydrology",
        "subjectCode": "CE",
        "courseCode": "54400",
        "instructor": [
            "Antoine F Aubeneau"
        ],
        "description": "Basic principles of fluid flow in saturated and unsaturated materials. Darcy's law, well hydraulics, determination of hydraulic properties of aquifers. Infiltration theory. Discussions of artificial recharge, land subsidence, saltwater intrusion, ground water quality and contamination.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Public Mass Transportation",
        "subjectCode": "CE",
        "courseCode": "56000",
        "instructor": [
            "Konstantina Gkritza"
        ],
        "description": "Public mass transportation system technologies, design, operation, and planning including vehicle characteristics, bus transit, light rail and rail rapid transit, schedules and networks, capacity, passenger characteristics, and paratransit.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Highway Traffic And Safety Analysis",
        "subjectCode": "CE",
        "courseCode": "56700",
        "instructor": [
            "Andrew P Tarko"
        ],
        "description": "Traffic and safety studies including: traffic and safety impact studies, control and geometry improvements, hazard and countermeasures identification, predicting safety benefits, before-and-after studies; data collection and computer tools for highway traffic and safety evaluation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Earthquake Engineering",
        "subjectCode": "CE",
        "courseCode": "57100",
        "instructor": [
            "Ayhan Irfanoglu"
        ],
        "description": "The objectives of the course are to: (1) expose the fundamentals of structural design in earthquake regions; (2) explain the functions of linear, nonlinear, and limit analyses with respect to design; (3) describe the complex relationships between ground motion models and structural response models in the linear and nonlinear response ranges; and (4) provide the students perspectives about the behavior of building structures in the earthquake environment.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Prestressed Concrete Design",
        "subjectCode": "CE",
        "courseCode": "57200",
        "instructor": [
            "Christopher S Williams"
        ],
        "description": "Behavior and design of prestressed concrete structures, prestress losses, composite construction, flexure and shear design, deflections, and special topics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Finite Elements In Elasticity",
        "subjectCode": "CE",
        "courseCode": "59500",
        "instructor": [
            "Arun Prakash"
        ],
        "description": "Fundamentals of theory of elasticity; variational principles; one-, two-, and three-dimensional elasticity finite elements; interpolation methods; numerical integration; convergence criteria; stress interpretation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Entrepreneurship And Business Strategy In Engineering",
        "subjectCode": "CE",
        "courseCode": "59601",
        "instructor": [
            "Joseph V Sinfield"
        ],
        "description": "This course offers students the opportunity to learn and apply the core skills required to build and grow engineering- and technology-based businesses through lecture, case discussions, and weekly activities tied to a semester-long team project. Course content includes market analysis techniques to link technology attributes to opportunity and vice versa, combinatorial business design and planning methods, strategic innovation theories, competitive analysis, methods of emergent strategy and risk mitigation, as well as examination of team building, firm influence and navigation, and organizational design principles. Emphasis throughout is placed on the implications of research and development uncertainty, long-lifecycle economics, and the management of subcontracts and multi-disciplinary teams often encountered when developing and delivering complex engineering outputs. Case studies are used to contrast the challenges faced when creating new businesses (entrepreneurial) with those encountered in attempts to grow an existing enterprise (intrapreneurial). Coursework and project activities also facilitate development of business acumen, and skill building in conceptual thinking, synthesis, and persuasive communication. This course is particularly relevant for engineering students intending to progress into managerial roles in technology or R&D driven organizations. This course can be counted toward the College of Engineering Minor in Innovation and Transformational Change and the Burton D. Morgan Center for Entrepreneurship (BDMCE) Certificate in Entrepreneurship and Innovation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Water Supply In Dev Countries",
        "subjectCode": "CE",
        "courseCode": "59700",
        "instructor": [
            "Ernest R Blatchley",
            "Jan Olek",
            "Raymond Paul Giroux",
            "Akanshu Sharma",
            "Zhi Zhou",
            "Nusrat Jung",
            "Marian Valer-Ioan Muste",
            "Satish V Ukkusuri",
            "Andrew J Whelton",
            "Ziran Wang",
            "Cary D Troy",
            "Dulcy M Abraham",
            "Jie Shan",
            "Brandon E Boor",
            "Robert J Connor",
            "Ayman F Habib",
            "Jinha Jung",
            "Sogand Mohammadhasanzadeh",
            "Pablo D Zavattieri"
        ],
        "description": "Hours and credits to be arranged. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            18
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Bridge Engineering",
        "subjectCode": "CE",
        "courseCode": "67401",
        "instructor": [
            "Mark D Bowman"
        ],
        "description": "This course reviews a number of fundamental topics related to the structural design of highway bridges. Some of the key features include bridge types, aesthetics, structural analysis methods, vehicle load distribution, deck design and detailing, steel girder design, concrete girder design, integral abutment design, bearings, and construction. Concurrent prerequisites: CE 57200 and CE 59100.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Plasticity Theory",
        "subjectCode": "CE",
        "courseCode": "68901",
        "instructor": [
            "Rodrigo Salgado"
        ],
        "description": "The course covers stress analysis, strains analysis, elastic and inelastic constitutive relations, with emphasis on plasticity, and the solution of plastic boundary-value problems for a wide range of materials, including metals, soils and alloys of various types. Specific topics covered by the course include: tensors, stress analysis, strain analysis, laws of thermodynamics, basic concepts from elasticity, viscoplasticity as an extension of viscoelastic concepts, classical plasticity, principle of maximum plastic dissipation, Drucker's inequality, yield function and yield surface, flow rule, hardening rule, classical models (Tresca, Von Mises, Mohr-Coulomb, Drucker-Prager), bounding-surface plasticity, thermodynamics and constitutive models, causes of plasticity at the microstructural level, noncoaxial plasticity, limit analysis, method of characteristics (slipline method) and cavity expansion analysis. Prerequisite: AAE 55300 or ME 61200.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "CE Sem-Hydraul & Hyd",
        "subjectCode": "CE",
        "courseCode": "69100",
        "instructor": [
            "Venkatesh Mohan Merwade",
            "Jinha Jung",
            "Makarand Hastak",
            "Kumares C Sinha",
            "Dulcy M Abraham",
            "Julio Alfonso Ramirez"
        ],
        "description": "An interdisciplinary seminar which provides a forum for invited speakers and staff to discuss new developments in practice and current research in civil engineering.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Adv Foundation Engr",
        "subjectCode": "CE",
        "courseCode": "69700",
        "instructor": [
            "Monica Prezzi"
        ],
        "description": "Topics vary. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            18
        ],
        "term": "Spring 2023"
    }
]