[
    {
        "title": "Pediatric Pharmacotherapy",
        "subjectCode": "CLPH",
        "courseCode": "43500",
        "instructor": [
            "Emily N Israel"
        ],
        "description": "This elective course will focus on the pharmacotherapeutics and pathophysiology of the more common disorders that apply to the pediatric population. The purpose of the course is to discuss the relevant differences between the adult and pediatric population in regards to the diagnosis, treatment options, desired therapeutic outcomes and therapeutic drug monitoring parameters. Instruction will be provided through a combination of lectures, case discussions, homework assignments, and group presentations.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Advanced Primary Literature Evaluation: A Focus On Therapeutic Issues",
        "subjectCode": "CLPH",
        "courseCode": "45300",
        "instructor": [
            "Amy Heck Sheehan"
        ],
        "description": "The purpose of this elective course is to enhance the primary literature evaluation skills of the student prior to clerkship rotations.  The course is designed to meet the needs of students with an interest in pursuing post-graduate training programs to enhance their ability to discuss the medical literature. Instruction is provided through a combination of lectures and class discussions of recently published literature articles with a cardiovascular focus.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Advanced Practice In Psychiatric Pharmacy",
        "subjectCode": "CLPH",
        "courseCode": "45400",
        "instructor": [
            "Carol A Ott"
        ],
        "description": "The purpose of this course is to provide the student with knowledge and insight regarding the use of medications in persons with mental illness. Instruction will be provided in the following areas (but not limited to): (1) psychiatric disease states; (2) psychiatric medications - usual dosing, adverse effects, drug interactions; (3) clinical use of psychiatric medications in psychiatric pharmacy practice; (4) useful and appropriate monitoring parameters; (5) the interaction of medical illness in the treatment of psychiatric disorders; (6) strategies to improve medication adherence and minimize adverse events; (7) utilization of recognized treatment guidelines in clinical care. Case-based learning will be utilized to emphasize important points in clinical use and monitoring of psychiatric medications and disorders. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Pharmaceutical Care In Developing Countries",
        "subjectCode": "CLPH",
        "courseCode": "45700",
        "instructor": [
            "Ellen M Schellhase"
        ],
        "description": "This elective will emphasize the major disease states, rational drug selection, especially with a limited medication formulary, desired therapeutic outcomes, and the provision of complete pharmaceutical care to patients in developing countries. The impact of drug therapy on health care, economics, and quality of life for diverse populations will be emphasized. Students will prepare to provide care in a cross-cultural environment in which resources are limited. Instruction is provided through a combination of lectures, discussions, and presentations. Enrollment is limited to Doctor of Pharmacy students (068) DP-C status or by consent of course coordinator.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "International APPE Preparation",
        "subjectCode": "CLPH",
        "courseCode": "49000",
        "instructor": [
            "Ellen M Schellhase"
        ],
        "description": "An honors course to be used to relate to, and supplement, an existing course. Subject matter and method of approach individually directed by instructor. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Seminar In Pharmacy",
        "subjectCode": "CLPH",
        "courseCode": "69600",
        "instructor": [
            "Alan J Zillich"
        ],
        "description": "Designed to provide the student with experience in the oral and written presentation of special topics of interest to clinical pharmacists and researchers. Discussion of current problems relating to the clinical practice of pharmacy.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2023"
    }
]