[
    {
        "title": "Modern Dance Technique I",
        "subjectCode": "DANC",
        "courseCode": "10100",
        "instructor": [
            "Renee L Murray",
            "Holly A Jaycox"
        ],
        "description": "An introduction to the techniques and principles of modern dance.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Ballet I",
        "subjectCode": "DANC",
        "courseCode": "10200",
        "instructor": [
            "Petre G Iliev"
        ],
        "description": "An introduction to the techniques and principles of classical ballet.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Jazz Dance I",
        "subjectCode": "DANC",
        "courseCode": "10300",
        "instructor": [
            "Petre G Iliev"
        ],
        "description": "An introduction to the principles of jazz dance techniques: alignment, isolations, rhythmic patterns, and basic locomotion.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Modern Dance Technique II",
        "subjectCode": "DANC",
        "courseCode": "20100",
        "instructor": [
            "Kathleen M Hickey"
        ],
        "description": "A continuation and refinement of the modern dance techniques and principles addressed in DANC 10100.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Ballet II",
        "subjectCode": "DANC",
        "courseCode": "20200",
        "instructor": [
            "Petre G Iliev"
        ],
        "description": "A continuation of the principles and techniques of classical ballet addressed in DANC 10200.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Jazz Dance II",
        "subjectCode": "DANC",
        "courseCode": "20300",
        "instructor": [
            "Kathleen M Hickey"
        ],
        "description": "A continuation and refinement of the jazz dance concepts and movement vocabulary addressed in DANC 10300.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Contact Improvisation",
        "subjectCode": "DANC",
        "courseCode": "26100",
        "instructor": [
            "Holly A Jaycox"
        ],
        "description": "This course is both a physical practice and philosophical exploration of the techniques and underlying premise of this contemporary partner dance form. CI training involves a practice of movement improvisation while developing the body's ability to attend to the effects of gravity, muscle tone, and anatomical structures on dancing solo and in partnership. While increasing their body awareness, respect, sensitivity and connection, students learn about collaborative community creativity, which can be applied in other settings including design, performance, and social activism. DANC 26000 is a good preparation for this course, but not required. Course may be repeated for credit.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Modern Dance Techniques III",
        "subjectCode": "DANC",
        "courseCode": "30100",
        "instructor": [
            "Renee L Murray"
        ],
        "description": "A continuation and refinement of the modern dance techniques and principles addressed in DANC 20100. Emphasis placed on expressive qualities of movement.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Survey Of Concert Dance History",
        "subjectCode": "DANC",
        "courseCode": "37800",
        "instructor": [
            "Kathleen M Hickey"
        ],
        "description": "This course is a broad survey of concert dance history predominately in the 20th and 21st century in Western cultures. The direct relationship and influence of the culture, training, choreographic, and performative records of dance practices, to socio-political ideologies of gender, race, sexuality, and national identities will be the area of investigation. Students will read, watch, research and actively participate in discussion regarding important dance figures, movements, eras, and their social and cultural reverberations. Dance's relationship to other art practices throughout history will also be a subject of lecture and discussion.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    }
]