[
    {
        "title": "Electrical Engineering Fundamentals I",
        "subjectCode": "ECE",
        "courseCode": "20001",
        "instructor": [
            "Michael R Hayashi",
            "Dimitrios Peroulis"
        ],
        "description": "This course covers fundamental concepts and applications for electrical and computer engineers as well as for engineers who need to gain a broad understanding of these disciplines. The course starts by the basic concepts of charge, current, and voltage as well as their expressions with regards to resistors and resistive circuits. Essential concepts, devices, theorems, and applications of direct-current (DC), 1st order, and alternating-current (AC) circuits are subsequently discussed. Besides electrical devices and circuits, basic electronic components including diodes and transistors as well as their primary applications are also discussed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Electrical Engineering Fundamentals II",
        "subjectCode": "ECE",
        "courseCode": "20002",
        "instructor": [
            "Michael A Capano",
            "Luis Javier Gomez",
            "Joseph Gerard Makin"
        ],
        "description": "Continuation of Electrical and Computer Engineering Fundamentals I. The course addresses mathematical and computational foundations of circuit analysis (differential equations, Laplace Transform techniques) with a focus on application to linear circuits having variable behavior as a function of frequency, with emphasis on filtering. Variable frequency behavior is further considered for applications of electronic components through single-transistor and operational amplifiers. The course ends with consideration of how circuits behave and may be modeled for analysis at high frequencies. Permission of Department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Python For Data Science",
        "subjectCode": "ECE",
        "courseCode": "20875",
        "instructor": [
            "Murat Kocaoglu",
            "Anuran Makur",
            "Mahsa Ghasemi",
            "Qiang Qiu"
        ],
        "description": "This course will introduce Python programming to students through data science problems. Students will learn Python concepts as well as introductory data science topics, and will use their knowledge of Python (and prior programming experience) to implement data analyses.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Advanced C Programming",
        "subjectCode": "ECE",
        "courseCode": "26400",
        "instructor": [
            "Yung-Hsiang Lu",
            "Aravind Kumar Machiry",
            "Alexander J Quinn"
        ],
        "description": "Continuation of a first programming course. Topics include files, structures, pointers, and the proper use of dynamic data structures. A basic knowledge of the UNIX operating system and an introductory C programming course; C programming knowledge should include basic syntax, control structures, and file I/O, as well as experience in declaring and using functions.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Introduction To Digital System Design",
        "subjectCode": "ECE",
        "courseCode": "27000",
        "instructor": [
            "Junfei Li"
        ],
        "description": "An introduction to digital system design and hardware engineering, with an emphasis on practical design techniques and circuit implementation.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Electrical And Computer Engineering Sophomore Seminar",
        "subjectCode": "ECE",
        "courseCode": "29401",
        "instructor": [
            "Angela S Rainwater"
        ],
        "description": "An introduction to the School of Electrical and Computer Engineering, the program's objectives, and outcomes, BSEE and BSCmpE degree requirements, professional writing and multicultural and professional development.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Signals And Systems",
        "subjectCode": "ECE",
        "courseCode": "30100",
        "instructor": [
            "Christopher Greg Brinton",
            "Zubin Jacob",
            "Chih-Chun Wang"
        ],
        "description": "Classification, analysis and design of systems in both the time- and frequency-domains. Continuous-time linear systems: Fourier Series, Fourier Transform, bilateral Laplace Transform. Discrete-time linear systems: difference equations, Discrete-Time Fourier Transform, bilateral Z-Transform. Sampling, quantization, and discrete-time processing of continuous-time signals. Discrete-time nonlinear systems: median-type filters, threshold decomposition. System design examples such as the compact disc player and AM radio.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Probabilistic Methods In Electrical And Computer Engineering",
        "subjectCode": "ECE",
        "courseCode": "30200",
        "instructor": [
            "Mary L Comer",
            "Saul B Gelfand",
            "James V Krogmeier"
        ],
        "description": "An introductory treatment including probability of events, discrete and continuous random variables, multiple random variables, sums of random variables and long-term averages, and elementary random processes.  Applications involving uniform, Gaussian, exponential, geometric and related random variables. Introduction to parameter estimation and hypothesis testing. Discussion of wide-sense stationary random processes, including correlation functions, spectral densities and the response of linear time invariant systems. Course examples are drawn from signal processing, wireless communications, system reliability, and data science.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Electromagnetics I",
        "subjectCode": "ECE",
        "courseCode": "30411",
        "instructor": [
            "Michael R Melloch",
            "Daniel S Elliott"
        ],
        "description": "This course is a continued study of vector calculus, electrostatics, magnetostatics, and Maxwell's Equations. It serves as an introduction to electromagnetic waves and transmission lines, which is continued in ECE 30412.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Electromagnetics II",
        "subjectCode": "ECE",
        "courseCode": "30412",
        "instructor": [
            "Thomas Edgar Roth"
        ],
        "description": "Electromagnetics II builds on Electromagnetics I (ECE 31100) and  emphasizes time-varying electromagnetic fields. Both fundamental understanding and an appreciation for applications that span all technologies related to electrical and computer engineering are emphasized. The topics covered include:  Maxwell's equations, plane waves, transmission lines, waveguides and cavities, and antennas and radiation. Applications addressed relate to photonics, communications, and imaging and sensing. More generally, illustrations cover the basic principles on which devices and systems used every day operate.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Basics Of Engineering Optics",
        "subjectCode": "ECE",
        "courseCode": "30416",
        "instructor": [
            "Jason Dwight Mckinney"
        ],
        "description": "Basic control over propagation, reflection, refraction of optical radiation are covered. Applications to optical instrumentation such as microscopy, polarization optics such as wave plates, thin films, and holography are discussed. Geometrical optics including lenses, mirrors, prisms; Huygens' principle, Fermat principle; rays; incoherent light. Physical Optics including gratings, interferometers, diffraction elements, polarizers; Huygens-Fresnel principle. Waves, amplitude and phase, coherent light. Law of reflection and refraction, interference, diffraction, polarization.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Semiconductor Devices",
        "subjectCode": "ECE",
        "courseCode": "30500",
        "instructor": [
            "Haitong Li"
        ],
        "description": "Introduces and explains terminology, models, properties, and concepts associated with semiconductor devices. Provides detailed insight into the internal workings of the \"building-block\" device structures such as the pn-junction diode, Schottky diode, BJT, and MOSFET. Presents information about a wide variety of other devices including solar cells, LEDs, HBTs, and modern field-effect devices. Systematically develops the analytical tools needed to solve practical device problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Fundamentals Of Computer Graphics",
        "subjectCode": "ECE",
        "courseCode": "30834",
        "instructor": [
            "Daniel G Aliaga"
        ],
        "description": "Fundamental principles and techniques of computer graphics. The course covers the basics of going from a scene representation to a raster image using OpenGL. Specific topics include coordinate manipulations, perspective, basics of illumination and shading, color models, texture maps, clipping and basic raster algorithms, fundamentals of scene constructions. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Electromechanical Motion Devices",
        "subjectCode": "ECE",
        "courseCode": "32100",
        "instructor": [
            "Scott D Sudhoff"
        ],
        "description": "The general theory of electromechanical motion devices relating electric variables and electromagnetic forces. The basic concepts and operational behavior of DC, induction, brushless DC, and stepper motors used in control applications are presented.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "ASIC Design Laboratory",
        "subjectCode": "ECE",
        "courseCode": "33700",
        "instructor": [
            "Mark C Johnson"
        ],
        "description": "Introduction to standard cell design of Application Specific Integrated Circuits (ASICs) using modern hardware description languages (HDLs). Emphasis on how to write HDL code that will map readily to hardware. Laboratory experiments using commercial grade computer-aided design (CAD) tools for HDL based design, logic simulation, automatic placement and routing, timing analysis and verification.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Microprocessor Systems And Interfacing",
        "subjectCode": "ECE",
        "courseCode": "36200",
        "instructor": [
            "Zahra Ghodsi"
        ],
        "description": "An introduction to basic computer organization, microprocessor instruction sets, assembly language programming, and microcontroller peripherals.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Data Structures",
        "subjectCode": "ECE",
        "courseCode": "36800",
        "instructor": [
            "Cheng-Kok Koh"
        ],
        "description": "Provides insight into the use of data structures. Topics include stacks, queues and lists, trees, graphs, sorting, searching, and hashing.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Discrete Mathematics For Computer Engineering",
        "subjectCode": "ECE",
        "courseCode": "36900",
        "instructor": [
            "Milind V Kulkarni",
            "Nak-Seung Patrick Hyun"
        ],
        "description": "This course introduces discrete mathematical structures and finite-state machines. Students will learn how to use logical and mathematical formalisms to formulate and solve problems in computer engineering. Topics include formal logic, proof techniques, recurrence relations, sets, combinatorics, relations, functions, algebraic structures, and finite-state machines.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Feedback System Analysis And Design",
        "subjectCode": "ECE",
        "courseCode": "38200",
        "instructor": [
            "Chun-Sing George Lee"
        ],
        "description": "In this course, classical concepts of feedback system analysis and associated compensation techniques are presented. In particular, the root locus, Bode diagram, and Nyquist criterion are used as determinants of stability.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Professional Communications And Diversity",
        "subjectCode": "ECE",
        "courseCode": "39401",
        "instructor": [
            "Brooke A Parks",
            "Marybeth Perdomo"
        ],
        "description": "This course provides ECE students with practice in relevant aspects of communication. Topics include: successfully seeking employment, working effectively in teams, delivering engaging presentations, and leveraging the advantages and challenges of diversity and inclusion.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Intro To Nano & Quantum Techno",
        "subjectCode": "ECE",
        "courseCode": "39595",
        "instructor": [
            "Alexandra Boltasseva"
        ],
        "description": "Topics vary. Permission of department required.",
        "capacity": 0,
        "credits": [
            1,
            5
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Industrial Practice Seminar I",
        "subjectCode": "ECE",
        "courseCode": "39600",
        "instructor": [
            "Jamie L Seadeek"
        ],
        "description": "A special seminar for cooperative education and curricular practical training students. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Introduction To Computer Security",
        "subjectCode": "ECE",
        "courseCode": "40400",
        "instructor": [
            "Avinash C Kak"
        ],
        "description": "Introduction to security issues related to the operation of computers and the workings of computer networks. Topics covered include introduction to cryptography, authentication protocols, digital signature algorithms, internet vulnerabilities, worms and virus propagation, denial of service attacks, etc. The students will also learn how to design firewalls to protect a system against unwanted intrusions. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Power Electronics",
        "subjectCode": "ECE",
        "courseCode": "43300",
        "instructor": [
            "Steven D Pekarek"
        ],
        "description": "Introduction to the fundamental operating principles of power conditioning circuits that are currently being used to effect power flow from AC to DC and vice versa. Emphasis is on the relationship between form and function of these circuits. Circuits discussed will include AC/DC line-commutated converters, DC/DC converters, DC/variable frequency converters, resonant converters, and AC/AC converters. Computer simulations will be used as a part of the coursework.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Computer Design And Prototyping",
        "subjectCode": "ECE",
        "courseCode": "43700",
        "instructor": [
            "T N Vijaykumar"
        ],
        "description": "An introduction to computer organization and design, including instruction set selection, arithmetic logic unit design, data path design, control strategies, pipelining, memory hierarchy, and I/O interface design.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Digital Signal Processing With Applications",
        "subjectCode": "ECE",
        "courseCode": "43800",
        "instructor": [
            "Jan P Allebach"
        ],
        "description": "The course is presented in five units. Foundations: the review of continuous-time and discrete-time signals and spectral analysis; design of finite impulse response and infinite impulse response digital filters; processing of random signals. Speech processing; vocal tract models and characteristics of the speech waveform; short-time spectral analysis and synthesis; linear predictive coding. Image processing: two-dimensional signals, systems and spectral analysis; image enhancement; image coding; and image reconstruction. The laboratory experiments are closely coordinated with each unit. Throughout the course, the integration of digital signal processing concepts in a design environment is emphasized.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Transmission Of Information",
        "subjectCode": "ECE",
        "courseCode": "44000",
        "instructor": [
            "James S Lehnert"
        ],
        "description": "Analysis and design of analog and digital communication systems. Emphasis on engineering applications of theory to communication system design. The laboratory introduces the use of advanced engineering workstations in the design and testing of communication systems.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Digital Integrated Circuit Analysis And Design",
        "subjectCode": "ECE",
        "courseCode": "45600",
        "instructor": [
            "Saeed Mohammadi"
        ],
        "description": "As applied t digital integrated circuits, the MDs transistor is studied in depth-from its fabrication to its electrical characteristics. Combinational, sequential, and dynamic logic circuits are considered. While the focus of the course is on CMOS technology, bipolar, nMOS, and BiCMOS circuits are introduced as well. SPICE is used as both an analysis and design tool. Semiconductor memory circuits are also discussed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Software Engineering",
        "subjectCode": "ECE",
        "courseCode": "46100",
        "instructor": [
            "James C Davis"
        ],
        "description": "Introduction to software engineering principles, with special emphasis on the process, methods, and tools needed to develop and test quality software products and systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Operating Systems Engineering",
        "subjectCode": "ECE",
        "courseCode": "46900",
        "instructor": [
            "Y Charlie Hu"
        ],
        "description": "The design and construction of operating systems for both individual computers and distributed (networked) systems. Basic concepts and methods for managing processor, main memory, block-structured storage, and network resources are covered. Detailed examples are taken from a number of operating systems, emphasizing the techniques used in networked versions of UNIX. These techniques are applied to design improvements of portions of a simplified, networked, UNIX-based operating system; the improvements are implemented and their performance is evaluated in laboratory experiments.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Introduction To Artificial Intelligence",
        "subjectCode": "ECE",
        "courseCode": "47300",
        "instructor": [
            "David Iseri Inouye"
        ],
        "description": "The course introduces fundamental areas of artificial intelligence: knowledge representation and reasoning; machine learning; planning; game playing; natural language processing; and vision.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Digital Systems Senior Project",
        "subjectCode": "ECE",
        "courseCode": "47700",
        "instructor": [
            "Phillip B Walter"
        ],
        "description": "A structured approach to the development and integration of embedded microcontroller hardware and software that provides senior-level students with significant design experience applying microcontrollers to a wide range of embedded systems (e.g., instrumentation, process control, telecommunications, and intelligent devices). The primary objective is to provide practical experience developing integrated hardware and software for embedded microcontroller systems in an environment that models one which students will most likely encounter in industry.  Permission of instructor required.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Digital Control Systems Analysis And Design",
        "subjectCode": "ECE",
        "courseCode": "48300",
        "instructor": [
            "Philip Eugene Pare"
        ],
        "description": "The course introduces feedback computer controlled systems, the components of digital control systems, and system models on the z-domain (z-transfer functions) and on the time domain (state variable representations.) The objectives for system design and evaluation of system performance are considered. Various discrete-time controllers are designed including PID-controllers, state and output feedback controllers, and reconstruction of states using observers. The systems with the designated controllers are tested by simulations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Electrical Engineering Senior Design Projects",
        "subjectCode": "ECE",
        "courseCode": "49022",
        "instructor": [
            "Ryan M Beasley"
        ],
        "description": "Lecture sessions provide the student with background information on the design and management of projects. Formal lectures cover, for example, design for manufacturability, design for quality, test and evaluation, reliability and ethics, patents and copyrights, plus case studies. During the laboratory sessions, the students work in teams on challenging open-ended electrical engineering project that draws on previous coursework. Projects routinely involve standard design facets (such as consideration of alternative solutions, feasibility considerations, and detailed system descriptions) and include a number of realistic constraints (such as cost, safety, reliability, and aesthetics). Lectures require use of the I-Clicker system.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Open Source Software",
        "subjectCode": "ECE",
        "courseCode": "49595",
        "instructor": [
            "Jing Gao",
            "Santiago Torres Arias",
            "Vijay Gupta"
        ],
        "description": "Topics vary. Permission of department required.",
        "capacity": 0,
        "credits": [
            1,
            5
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Machine Learning",
        "subjectCode": "ECE",
        "courseCode": "50024",
        "instructor": [
            "Qi Guo"
        ],
        "description": "  An introductory course to machine learning, with a focus on supervised learning using linear models. The course will have four parts: (1) mathematical background on linear algebra, probability, and optimization. (2) classification methods including Bayesian decision, linear regression, logistic, regression, and support vector machine. (3) robustness of classifier and adversarial examples. (4) learning theory on the feasibility of learning, VC dimension, complexity analysis, bias-variance analysis. Suitable for senior undergraduates and graduates with a background in probability, linear algebra, and programming.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Fundamentals Of Current Flow",
        "subjectCode": "ECE",
        "courseCode": "50631",
        "instructor": [
            "Supriyo Datta"
        ],
        "description": "  Traditional description of electronic motion through a solid is based on diffusive transport which means that the electron takes a random walk from the source to the drain. However, modern nanoelectronic devices often have channel lengths comparable to a mean free path so that electrons travel ballistically, or \"like a bullet.\" This course provides a unified conceptual framework for ballistic and diffusive transport of both electrons and phonons, that is very different from what is taught in standard courses, but indispensable to understanding nanolectronic devices.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Introduction To Quantum Transport",
        "subjectCode": "ECE",
        "courseCode": "50632",
        "instructor": [
            "Supriyo Datta"
        ],
        "description": "This course introduces the Schrodinger equation, uses the tight-binding method to discuss the concept of band structure and E(k) relations, along with simple quantum transport problems. No prior background in quantum mechanics or statistical mechanics is assumed.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Boltzmann Law: Physics To Computing",
        "subjectCode": "ECE",
        "courseCode": "50633",
        "instructor": [
            "Supriyo Datta"
        ],
        "description": "  This course introduces the key concepts of equilibrium statistical mechanics leading to the celebrated Boltzmann law and how it leads to Boltzmann machines and related concepts in modern machine learning. No prior background in statistical mechanics is assumed.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Computer Network Systems",
        "subjectCode": "ECE",
        "courseCode": "50863",
        "instructor": [
            "Sanjay G Rao"
        ],
        "description": "The goal of this course is to provide students with a proper grounding in the basic concepts and seminal work in computer network protocols and systems, and to introduce students to research in the field. The course will cover classical concepts such as network architecture, switching, routing, congestion control, and quality-of-service, and discuss recent developments in these areas. The course will also cover new developments in networking such as network measurements, network management, overlay networking and peer-to-peer systems, network security, and new network architectures. The course will emphasize a system-oriented and empirical view of internet architecture. Graduate standing or consent of instructor.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Electromechanics",
        "subjectCode": "ECE",
        "courseCode": "51012",
        "instructor": [
            "Scott D Sudhoff"
        ],
        "description": "The general theory of electromechanical motion devices relating electric variables and electromagnetic forces. The basic concepts and operational behavior of dc, induction, brushless dc, and stepper motors used in control applications are presented. Prerequisite by Topic: Basic circuit analysis; Elementary electromagnetics; Elementary mechanics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Hybrid Electric Vehicles",
        "subjectCode": "ECE",
        "courseCode": "51018",
        "instructor": [
            "Maryam A Al-Othman"
        ],
        "description": "Introduction to architectures and technologies associated with electric and hybrid electric vehicles including their constituent components. Specific topics include electric and hybrid electric drive trains, energy storage (batteries/ultracapacitors, fuel cells), electromechanical energy conversion (induction and permanent magnet motors and generators), power electronics, vehicle-level modeling and control, and optimization. Prerequisite by Topic: Energy conversion and power electronics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Computational Methods For Power System Analysis",
        "subjectCode": "ECE",
        "courseCode": "51032",
        "instructor": [
            "Junjie Qin"
        ],
        "description": "  System modeling of power networks. Description of modern electricity markets. Analysis of the economic dispatch problem using optimality conditions.  Planning of distributed energy resources. Smart grid applications. Machine learning applications to power systems (forecasting, demand-side management, and fault detection). Assigned projects will involve implementing some of the methods using realistic power system models.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Digital Systems Design Automation",
        "subjectCode": "ECE",
        "courseCode": "51216",
        "instructor": [
            "Anand Raghunathan"
        ],
        "description": "  This course will provide an introduction to the tools used to design and analyze circuits at the logic level of abstraction (where circuits are composed of gates and flip-flops). Most digital chips used in computing and electronic systems (including microprocessors, graphics processors, chips used in network routers, cell phones, digital audio/video appliances, automotive electronics) are entirely or largely designed using EDA tools. This course will focus on the foundations of logic-level EDA tools, including the design of exact and heuristic algorithms that form the basis for VLSI Computer-Aided Design. Topics covered include an overview of the IC design flow and levels of abstraction, synthesis of two-level (AND-OR / PLA) circuits, multi-level logic synthesis and technology mapping, sequential circuit synthesis, Logic-level verification using Boolean Satisfiability and BDDs, Timing Analysis, Power analysis and Reduction, and design techniques for emerging nanoscale technologies.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Fundamentals Of MEMS And Micro-Integrated Systems",
        "subjectCode": "ECE",
        "courseCode": "52600",
        "instructor": [
            "Chi Hwan Lee"
        ],
        "description": "(BME 58100)  Key topics in micro-electro-mechanical systems (MEMS) and biological micro-integrated systems; properties of materials for MEMS; microelectronic process modules for design and fabrication. Students will prepare a project report on the design of a biomedical MEMS-based micro-integrated system. Offered in alternate years.  Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Introduction To Lasers",
        "subjectCode": "ECE",
        "courseCode": "55200",
        "instructor": [
            "Vladimir M Shalaev"
        ],
        "description": "An introduction to lasers and laser applications which does not require a knowledge of quantum mechanics as a prerequisite. Topics include: the theory of laser operation; some specific laser systems; nonlinear optics; optical detection; and applications to optical communications, holography, laser-driven fusion, and integrated optics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Optimization Methods For Systems And Control",
        "subjectCode": "ECE",
        "courseCode": "58000",
        "instructor": [
            "Stanislaw H Zak"
        ],
        "description": "Introduction to optimization theory and methods, with applications in systems and control. Nonlinear unconstrained optimization, linear programming, nonlinear constrained optimization, various algorithms and search methods for optimization, and their analysis. Examples from various engineering applications are given. Elements of linear algebra and calculus of several variables and some experience with MATLAB  helpful.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Semiconductor Fundamentals",
        "subjectCode": "ECE",
        "courseCode": "59500",
        "instructor": [
            "Meng Cui",
            "Pramey Upadhyaya",
            "Dallas T Morisette",
            "Saurabh Bagchi",
            "Joseph V Rispoli"
        ],
        "description": "Formal classroom or individualized instruction on topics of current interest. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Random Variables And Signals",
        "subjectCode": "ECE",
        "courseCode": "60000",
        "instructor": [
            "Mark R Bell"
        ],
        "description": "Engineering applications of probability theory. Problems on events, independence, random variables, distribution and density functions, expectations, and characteristic functions. Dependence, correlation, and regression; multivariate Gaussian distribution. Stochastic processes, stationarity, ergodicity, correlation functions, spectral densities, random inputs to linear systems; Gaussian processes. Prerequisite: Master's student standing or higher.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Deep Learning",
        "subjectCode": "ECE",
        "courseCode": "60146",
        "instructor": [
            "Charles A Bouman"
        ],
        "description": "  This course teaches the theory and practice of deep neural networks from basic principles through state-of-the-art methods. The class blends hands-on programming, using a variety of state-of-the-art programming frameworks, with theoretical treatment based on current literature. Implementation will emphasize the use of the Pytorch language and the use of dynamic computational graphs. Some previous experience with optimization techniques is important for success in the course.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Lumped System Theory",
        "subjectCode": "ECE",
        "courseCode": "60200",
        "instructor": [
            "Jianghai Hu"
        ],
        "description": "An investigation of the basic theory and techniques of modern system theory, emphasizing linear state model formulations of continuous and discrete time systems in the time domain and frequency domain. Coverage includes notions of linearity, time invariance, discrete and continuous time state models, canonical forms, associated transfer functions and impulse response models, the state transition matrix, the Jordan form, controllability, observability, and stability. Prerequisite: Master's student standing or higher and concurrent prerequisite:  MA 51100.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Electromagnetic Field Theory",
        "subjectCode": "ECE",
        "courseCode": "60400",
        "instructor": [
            "Evgeniy E Narimanov"
        ],
        "description": "Review of general concepts (Maxwell's equations, materials interaction, boundary conditions, energy flow); statics (Laplace's equation, Poisson's equation); distributed parameter systems (classification of solutions, transmission lines, and wave-guides); radiation and antennas (arrays, reciprocity, Huygen's principle); a selected special topic (e.g., magnetostatics, waves in anisotropic media and optical fibers).  Offered in alternate years.  Prerequisite: Master's student standing or higher.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Solid State Devices",
        "subjectCode": "ECE",
        "courseCode": "60600",
        "instructor": [
            "Gerhard Klimeck"
        ],
        "description": "A relatively-broad, moderate-depth coverage of semiconductor devices and related topics. The first portion of the course presents and examines semiconductor fundamentals required in the operational analysis of solid state devices. A detailed examination of the PN junction diode and PN junction devices follows. The final portion of the course treats heterojunction surface devices including the Schottky diode, the MOS capacitor and the MOSFET. Offered in alternate years.  Prerequisite: Master's student standing or higher.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Computational Models And Methods",
        "subjectCode": "ECE",
        "courseCode": "60800",
        "instructor": [
            "Arif Ghafoor"
        ],
        "description": "Computation models and techniques for the analysis of algorithm complexity. The design and complexity analysis of recursive and non-recursive algorithms for searching, sorting, set operations, graph algorithms, matrix multiplication, polynomial evaluation and FFT calculations. NP-complete problems. Prerequisite: Master's student standing or higher.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Programmable Accelerator Architectures",
        "subjectCode": "ECE",
        "courseCode": "60827",
        "instructor": [
            "Timothy G Rogers"
        ],
        "description": "  Programmable hardware accelerators seek to fulfill the promise of continued performance and energy-efficiency gains in the era of a slowing Moore's law, larger problem sizes and an increased focused on energy-efficiency. These factors have caused hardware acceleration to become ubiquitous in today's computing world and critically important in computing's future. This class will introduce students to the architectures of programmable accelerators. We will delve deeply into the architectures of modern massively parallel accelerators like GPUs, culminating in a course project. General topics in hardware acceleration will be discussed, including but not limited to GPGPU and massively parallel computing, approximate accelerators, reconfigurable hardware and programmable hardware for machine learning. Pre-requisite: ECE 43700 or equivalent and ECE 56500.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Fault Tolerant Computer System Design",
        "subjectCode": "ECE",
        "courseCode": "60872",
        "instructor": [
            "Saurabh Bagchi"
        ],
        "description": "The course provides an introduction to the hardware and software methodologies for specifying, modeling and designing fault-tolerant systems supported by case studies of real systems. The material presents a broad spectrum of hardware and software error detection and recovery techniques that can be used to build reliable networked systems. The lectures discuss how the hardware and software techniques interplay, what techniques can be provided in COTS hardware, what can be embedded into operating system and network communication layers, and what can be provided via a distributed software layer and in the application itself. Prerequisite by Topic: Any one high level programming language experience; A basic background in probability.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Operation Of Modern Power Systems",
        "subjectCode": "ECE",
        "courseCode": "61020",
        "instructor": [
            "Dionysios Aliprantis"
        ],
        "description": "Overview of modern power system operations. Economic dispatch of assets as a constrained optimization problem, and",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Antennas: Design And Applications",
        "subjectCode": "ECE",
        "courseCode": "61700",
        "instructor": [
            "Kevin J Webb"
        ],
        "description": "Electrically small antennas; arrays; wire antennas and feeding arrangements; aperture antennas such as slots, horns, and parabolic reflectors; antennas for multiple frequencies including log-periodic and other frequency independent types; receiving antennas and the concept of antenna temperature; antenna measurements and evaluation. Prerequisite:  ECE 44100 and concurrent prerequisite: ECE 60400.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Digital Video Systems",
        "subjectCode": "ECE",
        "courseCode": "63400",
        "instructor": [
            "Fengqing Zhu"
        ],
        "description": "Digital video systems. Characteristics of basic analog video systems, including bandwidth constraints, color encoding, and composite signal formation. Digital video concepts with emphasis on processing of time-varying images. Topics include: filtering, enhancement, restoration, and motion estimation and prediction. Digital video compression techniques, including intraframe coding approaches, with particular emphasis on JPEG. MPEG1 and MPEG2 video compression standards. Low bit rate approaches, including H.261, H.263, and MPEG4. Applications include: video servers, transmission systems, high definition television, multimedia systems, and videoconferencing systems. Offered in alternate years. Concurrent prerequisite: ECE 60000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Digital Image Processing I",
        "subjectCode": "ECE",
        "courseCode": "63700",
        "instructor": [
            "Charles A Bouman"
        ],
        "description": "Introduction to digital image processing techniques for enhancement, compression, restoration, reconstruction, and analysis. Lecture and experiments covering a wide range of topics. 2-D signals and systems, image analysis, and image segmentation. Achromatic vision, color image processing, color imaging systems, image sharpening, interpolation, decimation, linear and nonlinear filtering, printing and display of images. Image compression, image restoration, and tomography. Offered every third semester.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Estimation Theory",
        "subjectCode": "ECE",
        "courseCode": "64500",
        "instructor": [
            "David J Love"
        ],
        "description": "This course presents the basics of estimation and detection theory that are commonly applied in communications and signal processing systems. Applications in communications and signal processing will be considered throughout. Prerequisite: ECE 60000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Performance Modeling Of Computer Communication Networks",
        "subjectCode": "ECE",
        "courseCode": "64700",
        "instructor": [
            "Xiaojun Lin"
        ],
        "description": "The mathematical background needed for the performance and stability analysis of computer communication networks is developed. Point processes, Markov processes, and queuing processes are used in the modeling and analysis of queues, interconnected queues such as ARPANET, and random multiple access networks such as Xerox's ETHERNET. Distributed control of random access networks and centralized control of queuing networks is considered. The techniques developed are useful in the design of computer systems as well as computer networks. Offered in alternate years. Prerequisite: ECE 60000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Compiler Code Generation, Optimization, And Parallelization",
        "subjectCode": "ECE",
        "courseCode": "66300",
        "instructor": [
            "Ryan R Newton"
        ],
        "description": "This course presents the concepts needed to design and implement production quality code generators for any of the more popular languages and families of computer architecture (including various pipelined, superscalar, and macro-parallel machines). Flow analysis and concurrency detection, as well as optimizations and loop and irregular code parallelizations, are covered in detail. Using C on ECN UNIX, each student will complete a project implementing a simple optimizer/parallelizer.  Prerequisite: ECE 56500, CS 50200 or ECE 46800 or 573000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Advanced Computer Systems",
        "subjectCode": "ECE",
        "courseCode": "66600",
        "instructor": [
            "Mithuna S Thottethodi"
        ],
        "description": "The study of theoretical aspects of advanced computer systems where multiprocessing is used. Topics include the design, architecture, and performance evaluation of multiprocessor memories, interconnection networks, and computational pipelines. Also included are the topics of scheduling, synchronization, resource allocation, load-balancing, partitioning and deadlock avoidance in multiprocessors. Also covered are the design and analysis of parallel algorithms, programming languages and automatic approaches to parallelism detection/exploitation for concurrent computation. Prerequisite: ECE 56500, 60800.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "VLSI Testing  And Verification",
        "subjectCode": "ECE",
        "courseCode": "68800",
        "instructor": [
            "Irith Pomeranz"
        ],
        "description": "Discusses different aspects of VLSI testing and formal verification of designs. Design and manufacturing defect models are introduced along with test generation and fault simulation algorithms targeting the different fault models.  Both combinational and sequential logic testing are covered, and different synthesis for testability schemes such as BIST (Built-In-Self-Test), scan path design, etc., are introduced. Other new and emerging test and verification techniques also are discussed. Offered every third semester. Prerequisite: ECE 55900.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Electrical And Computer Engineering Seminar",
        "subjectCode": "ECE",
        "courseCode": "69400",
        "instructor": [
            "Gerhard Klimeck"
        ],
        "description": "Seminar presentations by representatives from industry, members of the faculty of the School of Electrical and Computer Engineering, and other staff and faculty of Purdue University. The presentations introduce the student to a wide variety of current topics relevant to the technical and career aspects of electrical and computer engineering. Technical topics span the entire spectrum of electrical and computer engineering. Career topics include the importance of interpersonal communications, opportunities beyond graduate school, interviewing techniques, and descriptions of non-typical jobs. Required of electrical and computer engineering graduate students at Purdue during one of their first two semesters in residence.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Ideas To Innovation Part II",
        "subjectCode": "ECE",
        "courseCode": "69500",
        "instructor": [
            "Shreyas Sen",
            "Vishal Shrivastav",
            "Sumeet Kumar Gupta",
            "David B Janes",
            "Lu Su",
            "Peter A Bermel",
            "Xiaoqian Wang"
        ],
        "description": "Formal classroom or individualized instruction on advanced topics of current interest. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2023"
    }
]