[
    {
        "title": "Introduction To The Medieval World",
        "subjectCode": "HIST",
        "courseCode": "10300",
        "instructor": [
            "John Patrick Mulhall",
            "Silvia Z Mitchell"
        ],
        "description": "Barbarians, kings, queens, peasants, witches, saints, teachers, students, heretics, Muslims, Jews, Christians, love, death, monks, farm life, city life, ordinary men, women, and children as Europe develops from A.D. 500 to 1500.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Introduction To The Modern World",
        "subjectCode": "HIST",
        "courseCode": "10400",
        "instructor": [
            "Jennifer L Foray",
            "William G Gray"
        ],
        "description": "Traces the expansion of Europe into the Americas, Africa, and Asia. The French Revolution, nationalism, and the development of western European states from the era of the Reformation to the present are studied.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Survey Of Global History",
        "subjectCode": "HIST",
        "courseCode": "10500",
        "instructor": [
            "Deborah L Fleetham"
        ],
        "description": "A survey of the interaction between the civilizations of Asia, Africa, Europe, and the Americas since 1500, with attention to cultural comparisons over time, and to the implications of global interdependence for the environment, health, economy, and geopolitics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "American History To 1877",
        "subjectCode": "HIST",
        "courseCode": "15100",
        "instructor": [
            "Trenton C Jones"
        ],
        "description": "A study of the development of American political, economic, and social institutions from the early explorations and colonial settlements through Reconstruction. CTL:ISH 1010 American History I",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "United States Since 1877",
        "subjectCode": "HIST",
        "courseCode": "15200",
        "instructor": [
            "Cornelius L Bynum"
        ],
        "description": "A study of the growth of the United States from 1877 to the present. The new industrialism, agrarian problems, depression, the New Deal, the two world wars, the cold war, and similar topics are analyzed. CTL:ISH 1011 American History II",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "History Of Russia From Medieval Times To 1861",
        "subjectCode": "HIST",
        "courseCode": "23800",
        "instructor": [
            "Michael G Smith"
        ],
        "description": "This course explores the main characteristics of early Russian society, culture and politics. Topics include: the Kievan principalities, Orthodox Christianity, the Mongols, the rise of Moscow, the Petrine reforms, peasant and national rebellions, revolutionary movements, and the Tsarist empire to the Crimean War.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "East Asia In The Modern World",
        "subjectCode": "HIST",
        "courseCode": "24100",
        "instructor": [
            "Margaret M Tillman"
        ],
        "description": "The response of China, Japan, and Korea to the coming of the West in modern times, with special stress on the effect of Western ideas and machines. Approximately 1600 to the present. Typically offered Spring.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "South Asian History And Civilizations",
        "subjectCode": "HIST",
        "courseCode": "24300",
        "instructor": [
            "Tithi Bhattacharya"
        ],
        "description": "Survey history of India, Pakistan, and Bangladesh, from the origins of South Asian civilization to the present. Topics include ancient India, the Mughal Empire, the colonial experience, the independence movement, and conflict and popular culture.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Intro Jewish Studies",
        "subjectCode": "HIST",
        "courseCode": "30200",
        "instructor": [
            "Olga V Lyanda-Geller",
            "Marianne Blickenstaff"
        ],
        "description": "This variable-title course deals with broad historical topics that transcend and collapse traditional analytical, chronological, and geographic boundaries. Content will vary with faculty member teaching the class.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "The United States In The World 1898-Present",
        "subjectCode": "HIST",
        "courseCode": "30505",
        "instructor": [
            "David C Atkinson"
        ],
        "description": "This course explores the central issues and themes of American foreign relations during the twentieth century with a primary focus on the expansion of American political military, economic, and cultural power.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Science, Technology, Engineering And Mathematics (STEM) And Gender",
        "subjectCode": "HIST",
        "courseCode": "31405",
        "instructor": [
            "Sharra L Vostral"
        ],
        "description": "Scientific and technological innovation has been a cornerstone of American identity. How science and technology matters to gender, and gender matters to science and technology, will be explored through studying amateur and professional scientists and engineers, industrialization, education, sexual division of labor, and home and work spaces in twentieth-century America. Examining technological, scientific, and engineering innovation through the lens of gender reveals changing relationships between men and women in modern America.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Spain: The First Global Empire, 1469-1713",
        "subjectCode": "HIST",
        "courseCode": "32105",
        "instructor": [
            "Silvia Z Mitchell"
        ],
        "description": "This course examines the history of Spain's global empire from the unification of the kingdoms of Castile and Aragon to the War of the Spanish Succession. Topics include Spain's European possessions, overseas empire, ruling dynasty, society, and culture.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Nationalism And Socialism In East Central Europe",
        "subjectCode": "HIST",
        "courseCode": "33505",
        "instructor": [
            "Rebekah A Klein-Pejsova"
        ],
        "description": "This course examines how the peoples of East Central Europe engaged and coped with the most influential ideologies of the 20th century; with special attention to the weaknesses of the interwar and postwar regimes, strategies of modernization, survival, and dissent.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Modern China",
        "subjectCode": "HIST",
        "courseCode": "34000",
        "instructor": [
            "Margaret M Tillman"
        ],
        "description": "Chinese history from the Qing Dynasty (1644) to the present, with emphasis on the period since 1800. Attention given to internal developments and China's response to Western thought and material accomplishments. Nationalism and communism in the twentieth century are examined.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "History Of Modern Japan",
        "subjectCode": "HIST",
        "courseCode": "34400",
        "instructor": [
            "Nissanka Subodhana Megavarna Wijeyeratne"
        ],
        "description": "A survey of Japanese history from the nineteenth century to the present, including Japan's response to Western expansionism, the formation of the modern state, political parties, industrialization, the Pacific War, the American Occupation, the postwar \"economic miracle,\" and Japan today.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "History And Culture Of Native America",
        "subjectCode": "HIST",
        "courseCode": "37700",
        "instructor": [
            "Dawn Gay Marsh"
        ],
        "description": "This course explores the societies of Native North America in a historical context, from pre-historic times to the present, examining Native world views and belief systems to understand their historical relations with each other, and with Europeans and their descendants.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "History Of United States Agriculture",
        "subjectCode": "HIST",
        "courseCode": "38001",
        "instructor": [
            "Ray Douglas Hurt"
        ],
        "description": "This course surveys the main development in North American agricultural history, emphasizing the continental United States. Topics include early American agriculture, the plantation system, land policy, scientific and technological change, agrarian politics, water rights, migrant labor, and agricultural policy.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "History Of The Space Age",
        "subjectCode": "HIST",
        "courseCode": "38700",
        "instructor": [
            "Michael G Smith"
        ],
        "description": "The historical interaction between human values and space exploration in the contemporary age, focusing on issues of global interdependence. Topics include the international competition in rocketry, the Cold War in space, the moon missions, space disasters, and satellite technology.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Famine In World History",
        "subjectCode": "HIST",
        "courseCode": "39500",
        "instructor": [
            "Ray Douglas Hurt",
            "Dawn Gay Marsh"
        ],
        "description": "Variable title seminar for history majors in their junior year intended to teach historical skills, including research in primary sources, analytical skills, and forming historical arguments. It is a writing-intensive course and counts as one of the major requirements.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Great Books And The Search For Meaning",
        "subjectCode": "HIST",
        "courseCode": "40000",
        "instructor": [
            "Samuel Elias Sokolsky-Tifft"
        ],
        "description": "This intellectual-history course discusses the meanings of the Great Books within their particular historical contexts and the universal quest for self-understanding, focusing on good and evil; mystery and reason; the nature of power; and what it means to be human.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Europe In The Reformation",
        "subjectCode": "HIST",
        "courseCode": "40300",
        "instructor": [
            "Deborah L Fleetham"
        ],
        "description": "A study of decay and renewal in European society, 1300 to 1650. Concentrates on the Protestant and Catholic Reformation and religious wars, but also covers the Northern Renaissance, the New Monarchies, and the discovery and exploration of the New World.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Recent American History",
        "subjectCode": "HIST",
        "courseCode": "46800",
        "instructor": [
            "Kathryn C Brownell"
        ],
        "description": "Examines the issues that shaped American society, politics, foreign policy, and culture from 1932 to the present. Covers the Great Depression, World War II, the Cold War, and the Vietnam War as well as the social, cultural, and economic impact of those events.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Women And Health In America",
        "subjectCode": "HIST",
        "courseCode": "47005",
        "instructor": [
            "Wendy K Kline"
        ],
        "description": "This course examines the historical relationship between women and health by exploring a number of critical themes that have affected women's health in the United States.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "History Of Sexual Regulation In The United States",
        "subjectCode": "HIST",
        "courseCode": "48800",
        "instructor": [
            "Yvonne M Pitts"
        ],
        "description": "This course will illuminate broad themes in the historical regulation of sexual violence, consensual sex, and homosexuality. Student will understand and analyze how cultural, social, religious, and moral ideologies have influenced conceptions of deviant and normative sexuality in the United States.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Material Culture",
        "subjectCode": "HIST",
        "courseCode": "49500",
        "instructor": [
            "Sharra L Vostral",
            "Jennifer L Foray"
        ],
        "description": "This course is designed to train history majors in the fundamentals of historical research and writing. Course descriptions vary according to specific topics proposed for study by instructors.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Comp Race, Ethnicity Differ",
        "subjectCode": "HIST",
        "courseCode": "59000",
        "instructor": [
            "Stephen K Horrocks"
        ],
        "description": "A reading course directed by the instructor in whose field of specialization the content of the reading falls. Approval of each reading project must be secured from the department. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "The Holocaust And Genocide",
        "subjectCode": "HIST",
        "courseCode": "59500",
        "instructor": [
            "Rebekah A Klein-Pejsova"
        ],
        "description": "(POL 59500) History and analysis of the Nazi attempt to destroy the European Jews, with comparisons to other instances of genocide.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Early Modern England & Europe",
        "subjectCode": "HIST",
        "courseCode": "60100",
        "instructor": [
            "David C Atkinson",
            "Melinda S Zook"
        ],
        "description": "Bibliography and historiography of selected fields of topics in European history; may vary in subject matter from semester to semester. Prerequisite: Master's student standing.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "History: Research Practicum",
        "subjectCode": "HIST",
        "courseCode": "61100",
        "instructor": [
            "Jonathan Steven Lande"
        ],
        "description": "The second half of a two-semester sequence for new graduate students intended to acquaint them with important issues regarding the modern practice of historical scholarship. This course is a research seminar in which students shape and execute their own research projects resulting in original article-length historical essays. In addition, matters relating to ethical conduct of research and problems of historical writing and argumentation are discussed. Prerequisites: HIST 61000 or 59800. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Comparative & Global History",
        "subjectCode": "HIST",
        "courseCode": "64100",
        "instructor": [
            "Tithi Bhattacharya",
            "David C Atkinson"
        ],
        "description": "Individual and group study of topics in global history. Topics reflect the research, teaching, or historiographic specialties of the faculty offering the course. Subtitles indicate the focus of the research seminar. Prerequisite: Master's student standing.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Americans In The World",
        "subjectCode": "HIST",
        "courseCode": "65100",
        "instructor": [
            "David C Atkinson"
        ],
        "description": "Bibliography and historiography of selected fields or topics in American history; may vary in subject matter from semester to semester. Prerequisite: Master's student standing.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2023"
    }
]