[
    {
        "title": "Japanese Level II",
        "subjectCode": "JPNS",
        "courseCode": "10200",
        "instructor": [
            "Akiko O Brennan",
            "Namiko Uchida",
            "Bayan Konysbekkyzy",
            "Hitomi Kurita",
            "Asami Lutz"
        ],
        "description": "A continuation of the study of elementary Japanese. Task-oriented activities will be incorporated to encourage language use as well as pattern practice for linguistic accuracy. Relevant cultural aspects will be introduced. 120 Kanji. Typically offered Fall Spring Summer.",
        "capacity": 0,
        "credits": [
            3,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Japanese Level IV",
        "subjectCode": "JPNS",
        "courseCode": "20200",
        "instructor": [
            "Marina Ishii",
            "Samet Baydar"
        ],
        "description": "A continuation of intermediate Japanese. Active use of authentic materials for listening and reading practice. Task-oriented exercises, communicative activities, and pattern practice for learning of the spoken and written language. 150 Kanji. Typically offered Fall Spring Summer.",
        "capacity": 0,
        "credits": [
            3,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Introduction To The Study Of Japanese Literature",
        "subjectCode": "JPNS",
        "courseCode": "24100",
        "instructor": [
            "Pedro Thiago Ramos Bassoe"
        ],
        "description": "Reading and discussion of selected Japanese poetry, prose, and drama; introduction to methods of literary criticism, applied to the reading of Japanese literary discourse. Texts, discussion, and written assignments largely in Japanese. Typically offered Fall Spring.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Introduction To Modern Japanese Civilization",
        "subjectCode": "JPNS",
        "courseCode": "28000",
        "instructor": [
            "Alexis Nicole Zhou"
        ],
        "description": "A survey of modern Japanese culture. Various aspects are covered, such as geography, economy, society, the political system, family, education, traditional arts, business, and language. Current issues will be discussed in a timely manner. Lectures in English. Typically offered Fall Spring.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Japanese Level VI",
        "subjectCode": "JPNS",
        "courseCode": "30200",
        "instructor": [
            "Snezhanna V Pankratova",
            "Ayaka Matsuo"
        ],
        "description": "Further work to develop speaking, listening, reading, and writing abilities in Japanese, on the basis of materials dealing with the ideas and events that have shaped present-day Japan. Conducted primarily in Japanese. Typically offered Fall Spring.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Relationship Of Japanese Language And Society",
        "subjectCode": "JPNS",
        "courseCode": "36300",
        "instructor": [
            "Mariko M Wei"
        ],
        "description": "This course examines the Japanese language with reference to the way the language is being used in the Japanese society.  Particular areas include keigo (honorific language), aizuchi (backchannel), silence, gender issues, in-group vs. out-group. Typically offered Fall Spring.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Japanese Level VIII",
        "subjectCode": "JPNS",
        "courseCode": "40200",
        "instructor": [
            "Masaki Minobe"
        ],
        "description": "This course is a continuation of Fourth Year Japanese I. It continues work on the acquisition of advanced-level proficiency in speaking, listening, reading and writing. Students are given opportunities to understand the main ideas of extended discourse, to read texts which are linguistically complex, and to write about a variety of topics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Culinary Culture Of Japan",
        "subjectCode": "JPNS",
        "courseCode": "48500",
        "instructor": [
            "Kazumi Hatasa"
        ],
        "description": "Advanced-level language and culture course about the food of Japan. It covers gastronomy, celebrations, history, art, mythology, and other aspects of daily life related to the culinary traditions of Japan. Students will further develop their speaking, listening, reading and writing abilities in Japanese. They will have the opportunity to apply their skills in practical contexts and discuss cultural considerations, as well as participate in some hands-on cooking experience. Conducted entirely in Japanese. Permission of department required.  Typically offered Fall Spring.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Manga And Anime",
        "subjectCode": "JPNS",
        "courseCode": "49000",
        "instructor": [
            "Pedro Thiago Ramos Bassoe"
        ],
        "description": "Topics vary. Permission of instructor required. Typically offered Fall Spring.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Int/Adv JPNS Pedagogy",
        "subjectCode": "JPNS",
        "courseCode": "59600",
        "instructor": [
            "Atsushi Fukada",
            "Olga Dmitrieva",
            "Mariko M Wei",
            "Kazumi Hatasa"
        ],
        "description": "Topics vary.  Permission of instructor required. Typically offered Fall Spring.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Language And Code-Switching",
        "subjectCode": "JPNS",
        "courseCode": "67900",
        "instructor": [
            "Daniel J Olson"
        ],
        "description": "Advanced study and research on a significant topic in Japanese linguistics. Topic to be announced in advance. Permission of instructor required. Typically offered Fall Spring.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    }
]