[
    {
        "title": "PMEA Leadership Program",
        "subjectCode": "ME",
        "courseCode": "19800",
        "instructor": [
            "Holly L Englert"
        ],
        "description": "A weekly seminar that includes topics such as leadership, professional skills, teamwork, and the Mechanical Engineering culture.  Students will utilize these skills while representing Mechanical Engineering to current and prospective students, alumni, donors, and other visitors to the school.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Thermodynamics I",
        "subjectCode": "ME",
        "courseCode": "20000",
        "instructor": [
            "Jong Hyun Choi",
            "Sameer V Naik",
            "Galen Ross Jackson",
            "James E Braun",
            "Kevin James Kircher"
        ],
        "description": "First and second laws of thermodynamics, entropy, reversible and irreversible processes, properties of pure substances. Application to engineering problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Introduction To Mechanical Engineering Design, Innovation And Entrepreneurship",
        "subjectCode": "ME",
        "courseCode": "26300",
        "instructor": [
            "Morgan D Murphy",
            "Francisco J Montalvo"
        ],
        "description": "The product design process. Development of product design specifications using customer inputs, benchmarking, product/market research and patent review. Concept generation and evaluation using brainstorming, functional decomposition, modeling and decision matrices. Detailed product design including assembly, economic analysis, CAD, and bill of materials. Oral and written design reviews. Key skills developed include teamwork, communication, project planning, innovation, design, and entrepreneurship.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Basic Mechanics I",
        "subjectCode": "ME",
        "courseCode": "27000",
        "instructor": [
            "Kejie Zhao",
            "James D Jones"
        ],
        "description": "Vector operations, forces and couples. Free body diagrams, equilibrium of a particle and of rigid bodies. Distributed forces. Centers of gravity and centroids. Friction. Trusses, frames, and machines. Internal reactions resulting from axial, shear, torsional, and bending loading. Stress and strain analyses and elementary failure criteria.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Basic Mechanics II",
        "subjectCode": "ME",
        "courseCode": "27400",
        "instructor": [
            "Salvador Iii Rojas",
            "Luz Del Rosario Sotelo",
            "Patricia Davies",
            "Charles M Krousgrill",
            "James M Gibert"
        ],
        "description": "Review and extension of particle motion to include energy and momentum principles. Planar kinematics of rigid bodies. Kinetics for planar motion of rigid bodies, including equations of motion and principles of energy and momentum. Three-dimensional kinematics and kinetics of rigid bodies. Linear vibrations, with emphasis on single-degree-of-freedom systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Global Engineering Professional Seminar",
        "subjectCode": "ME",
        "courseCode": "29000",
        "instructor": [
            "Beth J Hess"
        ],
        "description": "Forum on contemporary issues in the global profession of mechanical engineering. Professionalism and ethics. Interactions with engineering faculty and with professionals outside the University. Quizzes on assigned readings in the areas of globalization, cultural difference and collaborating across cultural boundaries. Individually developed professional profiles describe technical interests and convey awareness of ethical responsibilities in global context.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2023"
    },
    {
        "title": "ME Soph Sem Peer Mentor Prog",
        "subjectCode": "ME",
        "courseCode": "29700",
        "instructor": [
            "Charles Gregory Jensen",
            "Beth J Hess",
            "Ilias Bilionis"
        ],
        "description": "Projects or special topics of contemporary importance can be studied under the Mechanical Engineering Projects course. Interested students should seek a faculty advisor by meeting with individual faculty members who work in their area of special interest. Students submit a summary report. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            6
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Thermodynamics II",
        "subjectCode": "ME",
        "courseCode": "30000",
        "instructor": [
            "Sameer V Naik",
            "Monique Suzanne Mcclain"
        ],
        "description": "Properties of gas mixtures, air-vapor mixtures, applications. Thermodynamics of combustion processes, equilibrium. Energy conversion, power, and refrigeration systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Fluid Mechanics",
        "subjectCode": "ME",
        "courseCode": "30800",
        "instructor": [
            "Eusebio Valero",
            "Aaron B Morris",
            "Dingding Han"
        ],
        "description": "Continuum description, velocity field, fluid statics, manometers, basic conservation laws for systems and control volumes, dimensional analysis. Bernoulli's equation along a streamline and with head losses. Flow over submerged bodies, boundary layers. Viscous flows in pipes, turbomachinery, system performance. One-dimensional gas dynamics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Heat And Mass Transfer",
        "subjectCode": "ME",
        "courseCode": "31500",
        "instructor": [
            "Ganesan Vishwanath",
            "Thomas Edwin Beechem"
        ],
        "description": "Fundamentals of heat transfer by conduction, convection, and radiation; mass transfer by convection. Relevance to engineering applications.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Mechanics Of Materials",
        "subjectCode": "ME",
        "courseCode": "32300",
        "instructor": [
            "Alex Chortos",
            "Klod Kokini"
        ],
        "description": "Integrated approach to mechanics of materials emphasizing mechanics fundamentals as applied to machine design applications. Stress and strain in machine elements; mechanical properties of materials; extension, torsion, and bending of members; thermal stress; pressure vessels; static indeterminacy, stress transformation, Mohr's circle.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Machine Design",
        "subjectCode": "ME",
        "courseCode": "35400",
        "instructor": [
            "Beth J Hess",
            "Kushagra Singh",
            "Fu Zhao"
        ],
        "description": "Design, analysis, and selection of machine components for fluctuating loading. Application of design fundamentals to mechanical components and integration of components to form systems. Open-ended design projects reinforce the design process.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Principles And Practices Of Manufacturing Processes",
        "subjectCode": "ME",
        "courseCode": "36300",
        "instructor": [
            "Yung C Shin",
            "Benxin Wu"
        ],
        "description": "Manufacturing processes for engineering materials, both metallic and non-metallic. Fundamentals of manufacturing processes with a \"hands-on\" laboratory sequence. Analysis and design of processes for various engineering materials and their link to engineering design. Hands-on experiences through laboratory experiments and demonstrations. Not open to students with credit in IE 37000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Measurement And Control Systems I",
        "subjectCode": "ME",
        "courseCode": "36500",
        "instructor": [
            "Euiwon Bae",
            "Cagri A Savran"
        ],
        "description": "The fundamentals of dynamic system modeling are reviewed with special reference to measurement systems. Analytical and experimental techniques of general importance in systems engineering are presented, including sensor utilization in feedback control. Engineering measurement fundamentals, including digital and frequency domain techniques noise and error analysis are covered.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Measurement And Control Systems II",
        "subjectCode": "ME",
        "courseCode": "37500",
        "instructor": [
            "Todd Daniel Lillian",
            "Gregory M Shaver",
            "Xinyan Deng"
        ],
        "description": "This course provides an introduction to modeling electrical, mechanical, fluid, and thermal systems containing elements such as sensors and actuators used in feedback control systems. Modeling techniques based on physical laws and principles are used to generate subsystem and system transfer functions. Closed-loop system analysis will include the use of proportional, integral, and derivative elements to control system response.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Noise Control",
        "subjectCode": "ME",
        "courseCode": "41300",
        "instructor": [
            "Yongjie Zhuang"
        ],
        "description": "Fundamentals of acoustic waves. Psychoacoustics and theories of hearing. Environmental and building acoustics. Measurement methods and common instrumentation. Noise control methods. Machinery noise. Community reaction. Legal aspects. Design-oriented semester project. Course work in differential equations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Energy Systems Engineering",
        "subjectCode": "ME",
        "courseCode": "41500",
        "instructor": [
            "Devahdhanush Vijayaraju Swathibanu"
        ],
        "description": "Application of Thermodynamics, fluid mechanics, and heat transfer fundamentals to the design of energy systems. Applications include thermal regulation in buildings, electronic equipment, energy generation, conversion, and storage, manufacturing processes, and combustion processes. Beyond the fundamentals, this course will focus on design and analysis techniques, including analysis of energy costs, economics, and environmental issues.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Power Engineering",
        "subjectCode": "ME",
        "courseCode": "43000",
        "instructor": [
            "Satish C Boregowda"
        ],
        "description": "Rankine cycle analysis, fossil-fuel steam generators, energy balances, fans, pumps, cooling towers, steam turbines, availability (second law) analysis of power systems, energy management systems, and rate analysis.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Automotive Prime Movers: Green Engines And Clean Fuel",
        "subjectCode": "ME",
        "courseCode": "44000",
        "instructor": [
            "Terrence R Meyer"
        ],
        "description": "Internal combustion engines (ICE), hybrid engines (HE), fuel-cell engines (FCE), and alternative/renewable fuels. ICEs topics- engines with advanced combustion systems such as clean diesels, direct-injection spark-ignition engines (DISI), and low-temperature combustion (LTC) compression-ignition. HE topics- different components of hybrid engines and the powertrain design. FCE topics- fundamentals of fuel cells and automotive applications. Clean fuel topics- biofuels, hydrogen, and natural gas, as well as, other cleaner fossil fuels for automotive applications. Well-to-wheel energy and cost analysis of prime mover designs/fuels.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Computer-Aided Design And Prototyping",
        "subjectCode": "ME",
        "courseCode": "44400",
        "instructor": [
            "Min Liu"
        ],
        "description": "Introduction to advanced computer-aided design (CAD) for product design, modeling, and prototyping. Individual use and team-based environment to design and prototype a functional and marketable product. Projects include use of the advanced design tools to produce a working prototype that is manufacturable. Application to design, manufacturing, and analysis.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Engineering Design",
        "subjectCode": "ME",
        "courseCode": "46300",
        "instructor": [
            "Charles Gregory Jensen"
        ],
        "description": "Application of the design process to the design of various engineering components and systems. Mathematical modeling in design is emphasized. Design problems from all areas of mechanical engineering are considered.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Automatic Control Systems",
        "subjectCode": "ME",
        "courseCode": "47500",
        "instructor": [
            "Yan Gu"
        ],
        "description": "Controller design in frequency domain with introduction to digital systems and control.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Introduction To Finite Element Analysis",
        "subjectCode": "ME",
        "courseCode": "48900",
        "instructor": [
            "Adrian Buganza Tepole"
        ],
        "description": "Introduction to finite element analysis with focus on linear elasticity and heat transfer. Matrix analysis and assembly of solutions. Strong form and weak form as a general solution process for differential equations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Technology And Values",
        "subjectCode": "ME",
        "courseCode": "49200",
        "instructor": [
            "Peter Heinrich Meckl"
        ],
        "description": "The impact of science and technology on personal and societal value systems. The special responsibility of engineers. Practical methods for using human values to guide future technological developments. Societal problems considered: warfare, energy, overpopulation, resource depletion, and environmental degradation. Interdisciplinary approaches stressed. Offered in alternate years.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Tools/Mth Iter Prd Dsgn & Anly",
        "subjectCode": "ME",
        "courseCode": "49601",
        "instructor": [
            "Shubhra Bansal",
            "Charles Gregory Jensen"
        ],
        "description": "Experimental classes offered at the junior or senior level on a temporary basis to test the viability of offering the course on a permanent basis. Typically offered Fall Spring Summer.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Advanced Thermodynamics",
        "subjectCode": "ME",
        "courseCode": "50000",
        "instructor": [
            "Davide Ziviani"
        ],
        "description": "The empirical, physical basis of the laws of thermodynamics. Availability/exergy concepts and applications. Properties and relations between properties in homogeneous and heterogeneous systems. The criteria of equilibrium. Application to a variety of systems and problems, including phase and reaction equilibrium. Offered in alternate years.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Intermediate Heat Transfer",
        "subjectCode": "ME",
        "courseCode": "50500",
        "instructor": [
            "Partha P Mukherjee"
        ],
        "description": "Heat and mass transfer by diffusion in one-dimensional, two-dimensional, transient, periodic, and phase change systems. Convective heat transfer for external and internal flows. Similarity and integral solution methods. Heat, mass, and momentum analogies. Turbulence. Buoyancy-driven flows. Convection with phase change. Radiation exchange between surfaces and radiation transfer in absorbing-emitting media. Multimode heat transfer problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Gas Dynamics",
        "subjectCode": "ME",
        "courseCode": "51000",
        "instructor": [
            "Nicole L Key"
        ],
        "description": "Flow of compressible fluids. One-dimensional flows including basic concepts, isentropic flow, normal and oblique shock waves, Rayleigh line, Fanno line, and simple waves. Multidimensional flows including general concepts, small perturbation theory for linearized flows and method of characteristics for nonlinear flows. Prerequisite: first course in fluid or aerodynamics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Combustion",
        "subjectCode": "ME",
        "courseCode": "52500",
        "instructor": [
            "Jay P Gore"
        ],
        "description": "Physical and chemical aspects of basic combustion phenomena. Chemical energetics and equilibrium. Basic chemical kinetics, chain reactions, and explosions. Chain and thermal ignition. Homogeneous combustion models. Detonations and deflagrations. Laminar flame speed and flame extinction. The Shvab-Zeldovich formulation of the multicomponent conservation equations. Diffusion flames and droplet combustion. Introduction to turbulent combustion.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Particle, Powder, And Compact Characterization",
        "subjectCode": "ME",
        "courseCode": "53101",
        "instructor": [
            "Rose Prabin Kingsly Ambrose"
        ],
        "description": "The goal of this course is to familiarize students with the properties and methods used to characterize the physical and mechanical behavior of particles, granules, and compacts with the intention of using these properties for process and performance design.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Design And Modeling Of Fluid Power Systems",
        "subjectCode": "ME",
        "courseCode": "53500",
        "instructor": [
            "Andrea Vacca"
        ],
        "description": "Introduction to fluid power technology. Design of hydraulic systems for mobile and industrial application for functionality, cost and energy efficiency. Modeling strategies for fluid power systems. Labs and class projects are given to reinforce the design and modeling learning projects.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Intellectual Property For Engineers",
        "subjectCode": "ME",
        "courseCode": "55400",
        "instructor": [
            "Dwadasi Sarma"
        ],
        "description": "Survey of the law of patents, trade secrets, trademarks, and copyrights, with special emphasis on the process of defining inventions broadly and diversely. Obtaining, registering, licensing, and litigation of intellectual property.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Lubrication, Friction & Wear",
        "subjectCode": "ME",
        "courseCode": "55600",
        "instructor": [
            "Farshid Sadeghi"
        ],
        "description": "Science, technology, and application of lubricated interacting surfaces in relative motion. Advanced analysis techniques and hands-on exposure to modern experimental methods provide an enhanced understanding of fundamental principles of lubrication, friction, and wear. Basics of design and analysis of machine components operating in the presence of air and liquid lubricants. Rolling fatigue, friction and wear models, and measurement techniques. Offered in alternate years.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Advanced Dynamics",
        "subjectCode": "ME",
        "courseCode": "56200",
        "instructor": [
            "Anil Kumar Bajaj"
        ],
        "description": "Dynamics of multi-degrees-of-freedom mechanical systems. Holonomic and nonholonomic constraints. Lagrange's equations of motion. Hamilton's principle for holonomic systems. Kinematics and kinetics of rigid body motion, including momentum and energy methods. Linearized equations of motion. Classification of vibratory systems - gyroscopic, circulatory forces. Stability of linear systems - divergence and flutter. Applications to gyroscopes, satellite dynamics, etc.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Vehicle Dynamics",
        "subjectCode": "ME",
        "courseCode": "56500",
        "instructor": [
            "Daniel Eugene Williams"
        ],
        "description": "Modeling of wheeled vehicles to predict performance, handling, and ride. Effects of vehicle center of mass, tire characteristics, traction and slip, engine characteristics, and gear ratios on performance. Suspension design. Steady state and transient handling models of four-wheeled vehicles and car-trailer systems to determine oversteer and understeer characteristics, critical speeds, and stability. Multi-degree-of-freedom ride models, including tire and suspension compliance. Computer simulations. Current research topics in vehicle vibration isolation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Fourier Methods In Digital Signal Processing",
        "subjectCode": "ME",
        "courseCode": "57900",
        "instructor": [
            "Yangfan Liu"
        ],
        "description": "Fundamentals of signal processing associated with Fourier analyzer systems are presented. Emphasis is on amplitude accuracy and frequency resolution properties necessary for reliable experimental methodologies in system identification, spectrum estimation, and correlation analysis. Deterministic, as well as random, data analyses are presented. Students are required to develop algorithms that significantly expand the utility of Fourier analyzer systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Mechatronics",
        "subjectCode": "ME",
        "courseCode": "58800",
        "instructor": [
            "Laura Helen Blumenschein"
        ],
        "description": "Electronic and interfacing techniques for design and control of electro-mechanical systems. Basic digital and analog design with applications to electro-mechanical interfacing via hands-on laboratory experience. Commonly used actuators and sensors and corresponding interfacing techniques. Realistic and integrated product development experience provided through a comprehensive final project where working prototypes are built to defined specifications.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Powder Storage & Flow",
        "subjectCode": "ME",
        "courseCode": "59500",
        "instructor": [
            "Carl R Wassgren"
        ],
        "description": "A series of one-credit-hour courses on special topics offered as ME 59500, 59500, etc. These special-topic minicourses will provide an opportunity for introducing students to topics of contemporary importance or special interest that fall outside the scope of the curriculum. Information about current offerings may be obtained from the schedule of classes or the mechanical engineering registration deputy.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Autonomous Systems",
        "subjectCode": "ME",
        "courseCode": "59700",
        "instructor": [
            "Chi Hwan Lee",
            "Martin Byung-Guk Jun",
            "Nina Mahmoudian",
            "Maryam A Al-Othman"
        ],
        "description": "Projects or special topics of contemporary importance or of special interest that are outside the scope of the standard graduate curriculum can be studied under the Mechanical Engineering Projects course. Interested students should seek a faculty advisor by meeting with individual faculty members who work in their area of special interest and prepare a brief description of the work to be undertaken in cooperation with their advisor. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            6
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Boundary Layer Theory",
        "subjectCode": "ME",
        "courseCode": "61000",
        "instructor": [
            "Luciano Castillo"
        ],
        "description": "Fundamentals of continuum fluid mechanics; Navier-Stokes equations. Laminar flow; boundary-layer concept; similarity solutions; transformation methods; integral and finite difference solution techniques for general pressure gradients. Should be preceded by intermediate fluid mechanics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Combustion Of Energetic Materials",
        "subjectCode": "ME",
        "courseCode": "62000",
        "instructor": [
            "Steven F Son"
        ],
        "description": "  Students will learn the concepts of how to approach research in the area of Energetic Materials (EM) based on an understanding of the fundamental principles. Students will learn how energetic materials are fabricated, safety used, as well as understand life cycle issues, homogeneous & heterogenous combustion, and advanced energetic material concepts. Multiphase combustion phenomena will be introduced and emphasized. They will apply these concepts to a literature review and group research project, as well as that includes applying thermochemistry and chemical kinetic software. In addition, six hands-on labs are performed. This material will be covered in the context of real-world applications, with an emphasis on energetic materials, combustion, propulsion, explosives, pyrotechnics, and detonation phenomenon. Pre-requisite: ME 52500 or AAE 53900 or consent of instructor.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Computational Fracture Mechanics",
        "subjectCode": "ME",
        "courseCode": "65000",
        "instructor": [
            "Thomas H Siegmund"
        ],
        "description": "Advanced concepts of methods for the analysis of cracks, of crack propagation and damage evolution. Prediction of the macroscopic behavior of structures as it emerges from the presence of defects such as cracks, voids, or delamination. Linear elastic and nonlinear fracture problems. Rate independent and rate dependent problems. Methods in computational fracture mechanics where material separation emerges as an outcome of the boundary value problem. Demonstrations of how mechanical design can take advantage of the methods of computational fracture mechanics by introducing such concepts into structural analyses. Applications of computations in predictive analysis and its importance in simulation-based engineering. Prerequisites: AAE 55800 or ME 48900, or similar courses in finite element analysis or ME 57000 or ME 61200 or AAE 55300, or similar courses on advanced solid mechanics. Recommended but not required: CEE 597-109 or AAE 65400.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Vibrations Of Continuous Systems",
        "subjectCode": "ME",
        "courseCode": "66400",
        "instructor": [
            "Andres Arrieta Diaz"
        ],
        "description": "Theory of small oscillations of continuous systems. Love's equations for thin shells, reduction to special cases of shallow shells, plates, beams, etc. Initial stresses; influence of shear; thermal excitation. Initial value problems; forced vibrations; structural damping. The dynamic Green's function, impedance concepts; variational approaches. Experimental procedures, scaling, composite, and stiffened shells. Prerequisite: knowledge of one degree of freedom system vibrations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Bifurcations And Chaos",
        "subjectCode": "ME",
        "courseCode": "68000",
        "instructor": [
            "Anil Kumar Bajaj"
        ],
        "description": "Basic concepts in stability of systems, nonlinear dynamical systems, and bifurcation theory. Algebraic and geometric techniques for local bifurcation analysis. Models governed by difference, ordinary, and particle differential equations. Examples from mechanical, structural, chemical, and electrical systems. Models of chaotic behavior. Techniques for prediction of chaos. Routes to chaos. Offered in alternate years. Prerequisite: ME 58000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Finite And Boundary Element Methods",
        "subjectCode": "ME",
        "courseCode": "68100",
        "instructor": [
            "Ganesh Subbarayan-Shastri"
        ],
        "description": "The solution of problems in mechanical engineering using the generalized numerical techniques; the finite element method and the boundary element method. Topics include reformulation of partial differential equations into appropriate form for each method. The development and implementation of code and solution of problems. Applications include: acoustics, fluid dynamics, heat transfer, design, mechanics and biomechanics. Prerequisite: ME 58100.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Adaptive Control",
        "subjectCode": "ME",
        "courseCode": "68900",
        "instructor": [
            "Bin Yao"
        ],
        "description": "Theory and application of adaptive control of linear systems in both continuous and discrete time domain. Real-time parameter estimation algorithms, direct and indirect adaptive methods, deterministic self-tuning regulators, Lyapunov stability theory, input-output stability, model-reference adaptive control, stability and convergence of adaptive algorithms, robustness, and implementation issues, with laboratory experiments and demonstrations. Offered in alternate years. Prerequisite: ME 57500. Typically offered Spring.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Comptnl Mthd For Interface Dyn",
        "subjectCode": "ME",
        "courseCode": "69700",
        "instructor": [
            "Carlo Scalo",
            "Hector Gomez Diaz"
        ],
        "description": "Projects or special topics of contemporary importance or of special interest that are outside the scope of the standard graduate curriculum can be studied under the Mechanical Engineering Projects course. Interested students should seek a faculty advisor by meeting with individual faculty members who work in their area of special interest and prepare a brief description of the work to be undertaken in cooperation with their advisor. Prerequisite: Doctoral student standing. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Spring 2023"
    }
]