[
    {
        "title": "Structure And Properties Of Materials",
        "subjectCode": "MSE",
        "courseCode": "23000",
        "instructor": [
            "Janelle P Wharry"
        ],
        "description": "The relationship between the structure of materials and the resulting mechanical, thermal, electrical, and optical properties. Atomic structure, bonding, atomic arrangement; crystal symmetry, crystal structure, habit, lattices, defects, and the use of X-ray diffraction. Phase equilibria and microstructural development. Applications to design.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Materials Properties Laboratory",
        "subjectCode": "MSE",
        "courseCode": "23500",
        "instructor": [
            "David R Johnson"
        ],
        "description": "Laboratory experiments involving usage of standard equipment in the measurement of mechanical, microstructural, thermal, electrical, and optical properties. Introduction to computer-aided data analysis. Experiments are carried out with metal, ceramic, and polymeric materials to illustrate property-structure-processing relationships.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Physical Properties In Engineering Systems",
        "subjectCode": "MSE",
        "courseCode": "25000",
        "instructor": [
            "Chelsea S Davis"
        ],
        "description": "Class connects math, science and engineering practice and applications. Presents foundational aspects of engineering problem solving, use of computer math tools for engineering problem solving, basic engineering statics, dynamics and mechanics, group problem solving approaches, and introductory aspects of design and materials selection.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Thermodynamics Of Materials",
        "subjectCode": "MSE",
        "courseCode": "26000",
        "instructor": [
            "Davin G Piercey"
        ],
        "description": "Fundamental laws of thermodynamics and their applications to material systems; criteria for equilibrium; reaction and phase equilibria; properties of solutions; thermodynamic origins of phase diagrams.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Atomistic Materials Science",
        "subjectCode": "MSE",
        "courseCode": "27000",
        "instructor": [
            "John E Blendell"
        ],
        "description": "Introductory course with an atomistic view point on material properties. Three primary class sections: bonding crystallography and statistical mechanics. Bonding topics include introduction to quantum mechanics, emphasis on understanding of metallic, ionic and covalent bonding. Crystallography topics include crystal descriptions and symmetry principles. Statistical mechanics development with application to electronic and thermodynamic properties.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Processing And Properties Of Materials",
        "subjectCode": "MSE",
        "courseCode": "33000",
        "instructor": [
            "Kendra A Erk"
        ],
        "description": "An introduction to the relationships between the processing of materials and their properties. Heat treating, forming, casting, consolidation, and other more material-specific manufacturing processes. Elucidation of the role of phenomena such as heat flow, mass diffusion, nucleation, interfacial tension, elastic and plastic deformation, precipitation, grain growth.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Materials Characterization Laboratory",
        "subjectCode": "MSE",
        "courseCode": "33500",
        "instructor": [
            "Maria A Okuniewski"
        ],
        "description": "The principles of analytical methods for characterization of materials for structure and composition; optical microscopy, scanning electron microscopy, X-ray spectroscopy and diffraction, atomic absorption, emission spectroscopy, and mass spectrometry. Laboratory experiments in X-ray spectroscopy, X-ray diffraction, optical microscopy, and scanning electron microscopy.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Transport Phenomena",
        "subjectCode": "MSE",
        "courseCode": "34000",
        "instructor": [
            "Michael S Titus"
        ],
        "description": "Mechanism and rates of heat, mass, and momentum transfer. Macroscopic and differential energy, mass, and momentum balances. Application to systems with phase transformations and chemical reaction.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Materials Processing Laboratory",
        "subjectCode": "MSE",
        "courseCode": "36700",
        "instructor": [
            "Danielle Lee Heichel"
        ],
        "description": "This laboratory is intended as an intensive experience in processing techniques used for ceramics, metals, and polymers. Sintering of a ceramic, casting and post-processing (work hardening, heat treatment, etc.) of a metal, and preparation and extrusion of a polymer are the suggested processes. The measurements (e.g., powder size, compaction force, temperature, grain size, molecular weight) applicable to the successful processing of the material and the final properties (e.g., hardness, ductility, strength, stiffness) will be emphasized.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Mechanical Response Of Materials",
        "subjectCode": "MSE",
        "courseCode": "38200",
        "instructor": [
            "Alejandro H Strachan"
        ],
        "description": "This course encompasses deformation-based microscopic mechanisms, including dislocation motion, diffusion, and viscoplasticity. Macroscopic mechanical response of metals, ceramics, polymers, and composites will be related to elasticity and plasticity concepts for single crystal, polycrystalline, and amorphous materials. Practical design considerations for deformation will be included as well as an introduction to fracture mechanisms.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Materials Engineering Seminar",
        "subjectCode": "MSE",
        "courseCode": "39000",
        "instructor": [
            "Nikhilesh Chawla"
        ],
        "description": "Presentation and discussion of current topics in materials engineering.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Materials Processing And Design I",
        "subjectCode": "MSE",
        "courseCode": "43000",
        "instructor": [
            "Nikhilesh Chawla"
        ],
        "description": "Experience in the initiation and execution of a specific materials project or study involving research, processing, and design; a written proposal on the project prepared by the student under the supervision of an individual faculty member; oral progress report at the end of the semester.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Materials Processing And Design II",
        "subjectCode": "MSE",
        "courseCode": "44000",
        "instructor": [
            "David R Gildemeister"
        ],
        "description": "Continuation and completion of the materials project or study initiated in MSE 43000 and presentation of a written dissertation on the results and conclusions. Competence in technical writing is emphasized in the preparation of the dissertation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Defects In Solids",
        "subjectCode": "MSE",
        "courseCode": "50200",
        "instructor": [
            "Esteban E Marinero-Caceres"
        ],
        "description": "Structures and interactions of point, line, and planar defects in solids, with emphasis on properties of defects. Generic basis of defect energies and interactions, with reference to specific materials and material classes as examples. Types of point defects found in crystals, their origins, interactions, and motion. Overview of dislocation theory and point-defect/dislocation interactions. Structural aspects of surfaces and interfaces, including point and line defect interactions.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Microstructural Characterization Techniques",
        "subjectCode": "MSE",
        "courseCode": "51000",
        "instructor": [
            "Eric P Kvam"
        ],
        "description": "A broad variety of analytical tools will be presented. The intent is to allow the student to make an educated selection of characterization techniques, or critical analysis of published data, for materials and defect analysis. The techniques will be assessed in terms of the probe type and material response, of what device and specimen requirements are typical, and of what data can or cannot be derived from each type of analysis.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Struct-Property Relationships Of Engineering Polymers",
        "subjectCode": "MSE",
        "courseCode": "52500",
        "instructor": [
            "John A Howarter"
        ],
        "description": "Structure-property relationships developed for commodity and engineering resins. Focus on connecting bonding and polymer structure (i.e., molecular weight, tacticity, crystallinity as it regards spherulites) to mechanical (yield phenomena and fracture) and thermomechanical behavior (viscoelasticity). Thermal characterization techniques, including DSC, TGA, TMA, and DMTA. Flow of polymer melts related to common melt processing techniques (i.e., extrusion and injection molding). Offered in alternate years.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Introduction To Biomaterials",
        "subjectCode": "MSE",
        "courseCode": "52700",
        "instructor": [
            "Rahim Rahimi"
        ],
        "description": "This course aims to introduce students to Biomaterials concepts: structure, properties, and applications. The class will cover the main classes of materials: metals, ceramics and polymers in the context of their use in medicine as implant materials, drug delivery vehicles, and as tissue engineering scaffolds. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Materials Processing In Manufacturing",
        "subjectCode": "MSE",
        "courseCode": "53000",
        "instructor": [
            "Elliott B Slamovich"
        ],
        "description": "Examination of the production/synthesis of engineering materials and the subsequent processing steps required to obtain a desired shape and microstructure. The course covers four major categories of materials processing: primary processing or materials synthesis, solidification processing, deformation processing, and powder processing, and provides specific examples from the processing of polymers, metals, and ceramics. The goal is to connect fundamental principles of materials processing to manufacturing processes. Credit will not be given for both MSE 5300 and 36700.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Solidification Of Castings",
        "subjectCode": "MSE",
        "courseCode": "53600",
        "instructor": [
            "David R Gildemeister"
        ],
        "description": "A study of solidification of metal in molds involving the characteristics of liquid-solid phase transformations, sand and metal thermal behavior, macroscopic structures, mechanical properties, and casting defects.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "The Production Of Inorganic Materials",
        "subjectCode": "MSE",
        "courseCode": "56000",
        "instructor": [
            "Matthew J M Krane"
        ],
        "description": "Examination of the production of inorganic materials of engineering importance (metals, ceramics, and glasses) from ore concentrates, raw materials, and recycled materials. Individual stages in the extraction, refining, and syntheses processes are examined from the viewpoints of thermodynamics and kinetics, and alternative production routes are compared and contrasted. Topics covered include carbothermic and metallothermic reduction of oxide concentrates, smelting and conversion of sulfide mattes, electrolysis and electrowinning from aqueous solutions and molten salts, distillation and vacuum refining, glass-forming, and the synthesis of carbide and nitride ceramics. Offered in alternate years.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Soft Materials",
        "subjectCode": "MSE",
        "courseCode": "56200",
        "instructor": [
            "Carlos J Martinez"
        ],
        "description": "Soft materials are an important and diverse class of materials that share the common trait of being easily deformable by external stresses, electric or magnetic fields or even thermal fluctuations. These materials are the foundation of important technologies that are used in everyday life including ceramic and pharmaceutical processing (tablet formation), cosmetics (hand creams), cleaning products, foods (milk, mayonnaise) and bio-technologies (drug delivery). The aim of this class is to gain a fundamental understanding of the physical and chemical underpinnings of common soft materials systems and how they are used to engineer technologically relevant materials and structures.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Corrosion",
        "subjectCode": "MSE",
        "courseCode": "57600",
        "instructor": [
            "Robert H Spitzer"
        ],
        "description": "Rate-controlling steps in electrode processes; activation, ohmic, and concentration polarization; passivation; potentiostatic studies and alloy design; applications to engineering systems. Offered in alternate years.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Kinetics Of Materials",
        "subjectCode": "MSE",
        "courseCode": "59700",
        "instructor": [
            "John A Howarter",
            "R Edwin Garcia",
            "Kevin P Trumble",
            "Paul R Mort",
            "Rodney W Trice",
            "Xinghang Zhang",
            "Arun Kumar Mannodi Kanakkithodi"
        ],
        "description": "Hours and credits to be arranged. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            18
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Seminar In Materials Engineering",
        "subjectCode": "MSE",
        "courseCode": "69000",
        "instructor": [
            "Chelsea S Davis"
        ],
        "description": "Required of all MSE graduate students.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Materls Engr Teach Experience",
        "subjectCode": "MSE",
        "courseCode": "69700",
        "instructor": [
            "Lia A Stanciu-Gregory",
            "Kenneth H Sandhage",
            "Anter A El-Azab"
        ],
        "description": "Hours and credits to be arranged.  Prerequisite: two upper-division mathematics courses: one on linear algebra and one on abstract algebra. Permission of instructor required. Typically offered Fall Spring.",
        "capacity": 0,
        "credits": [
            0,
            18
        ],
        "term": "Spring 2023"
    }
]