[
    {
        "title": "Foundations Of Leadership",
        "subjectCode": "MSL",
        "courseCode": "10200",
        "instructor": [
            "Michael D Churchill"
        ],
        "description": "An introduction to the personal challenges and competencies that are critical for effective leadership. Topics include critical thinking, time management, goal setting, and communication. The course emphasizes the communications process and the importance for leaders to develop essential skills to effectively communicate in the Army. Basic squad-level tactics will be reinforced.",
        "capacity": 0,
        "credits": [
            1,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Army Doctrine And Decision Making",
        "subjectCode": "MSL",
        "courseCode": "20200",
        "instructor": [
            "Richard A Keaton"
        ],
        "description": "The course explores using analytical techniques, creative-thinking skills, and the Army problem-solving process to help with situational decision making. Troop-leading procedures (TLP) and operational orders (OPORD) are used to explain Army Doctrine and symbology. Topics include using unified land operations, offensive operations, and defensive operations in squad-level tactics.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Applied Leadership In Small Unit Operations",
        "subjectCode": "MSL",
        "courseCode": "30200",
        "instructor": [
            "Christopher Huggett"
        ],
        "description": "An examination of the fundamentals of direct-level leadership and small-unit tactics at the platoon level in preparation for Cadet Summer Training Advance Camp. Emphasizes the planning, coordinating, navigating, motivating, and leading a platoon to execute a mission.",
        "capacity": 0,
        "credits": [
            3,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Company Grade Leadership",
        "subjectCode": "MSL",
        "courseCode": "40200",
        "instructor": [
            "Jason M Garcia"
        ],
        "description": "This course explores the roles and responsibilities of company-grade Army officers with respect to unified land operations. Emphasizes the knowledge, skills and abilities required of junior officers in preparation for commissioning.",
        "capacity": 0,
        "credits": [
            3,
            4
        ],
        "term": "Spring 2023"
    }
]