[
    {
        "title": "Introduction To Nursing II",
        "subjectCode": "NUR",
        "courseCode": "10900",
        "instructor": [
            "Sandra J Gilpin",
            "Ann L Loomis"
        ],
        "description": "Using knowledge acquired in NUR 10800 students will examine the profession of nursing and their role and responsibilities within the profession. Topics to be discussed include informatics and technology, the importance of professional communication in oral and written form, the global image of nursing, wellness and self-care, and preparation for progression into the sophomore year. Permission of department required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Essentials Of Nursing Practice II",
        "subjectCode": "NUR",
        "courseCode": "22001",
        "instructor": [
            "Tasha Marie DeWitt"
        ],
        "description": "Continues to expand on the professional nursing role supported by fundamental concepts and principles of the nursing process in lecture and clinical settings. Learners apply communication, assessment and nursing skills while caring for the needs of clients in diverse populations across the lifespan.",
        "capacity": 0,
        "credits": [
            5,
            5
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Pathopharmocology II",
        "subjectCode": "NUR",
        "courseCode": "22101",
        "instructor": [
            "Janelle Elizabeth Potetz"
        ],
        "description": "An introduction to the study of underlying changes in primary physiologic regulatory mechanisms affecting respiratory, hematologic, endocrine, neurologic, neuromuscular, gastrointestinal and reproductive function and the pharmacotherapies utilized as treatment for alterations and disease states. This course builds on the learning objectives from Pathopharmacology I to provide the foundation for the understanding and practice of general nursing.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Population Health",
        "subjectCode": "NUR",
        "courseCode": "22201",
        "instructor": [
            "Elizabeth A Richards"
        ],
        "description": "A comprehensive introduction to population health concepts and practices through examination of philosophy, purpose, functions, activities and tools. Multiple determinants (genetics, cultural, social, and behavioral factors) that influence population health and illness are explored including the contribution of these factors to health disparities. Population-focused initiatives for health  promotion and disease prevention are examined within the context of local to global public health systems.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Health Alterations In Adults I",
        "subjectCode": "NUR",
        "courseCode": "31401",
        "instructor": [
            "Karen Jean Grammer"
        ],
        "description": "One of two courses focusing on providing nursing care to adults with  an emphasis on the application of the nursing process to assist diverse populations  reach their optimal  level of well-being  as they experience health care across the delivery system continuum.\tEmphasis will be on promoting clinical reasoning skills, integrating best practices, and ensuring patient safety. The course concentrates  on adults experiencing alterations in tissue integrity related to surgical interventions, cellular division, reproductive function, elimination, nutrition and sensory function that typically result in hospitalization.",
        "capacity": 0,
        "credits": [
            6,
            6
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Nursing Of Childbearing Families",
        "subjectCode": "NUR",
        "courseCode": "31501",
        "instructor": [
            "Cynthia J Garringer"
        ],
        "description": "Promotes the development of nursing skills when caring for families and their newborns during uncomplicated and/or complicated childbearing experiences within  a variety of clinical settings. Emphasizes the study and application of the nursing process, integrating evidence based practice while meeting the health and safety needs of diverse childbearing families.",
        "capacity": 0,
        "credits": [
            5,
            5
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Health Alterations In Adults II",
        "subjectCode": "NUR",
        "courseCode": "31701",
        "instructor": [
            "Guinevere Jo Brandenburg"
        ],
        "description": "One of two courses focusing on providing nursing care to adults with an emphasis on the application of the nursing process to assist diverse populations reach their optimal level of wellbeing as they experience health care across the delivery system continuum. Emphasis will be on promoting clinical reasoning skills, integrating best practices, and ensuring patient safety. The course concentrates on adults experiencing alterations in health related to oxygenation, circulatory dynamics, endocrine regulation, neurological regulation, immune regulation and musculoskeletal dynamics that typically result in hospitalization.",
        "capacity": 0,
        "credits": [
            6,
            6
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Psychiatric And Mental Health Nursing",
        "subjectCode": "NUR",
        "courseCode": "31801",
        "instructor": [
            "Elizabeth A Jones"
        ],
        "description": "Focuses on providing nursing care that supports mental health and the care of persons with mental illness while providing a conceptual integration of the nursing process, theories, and research from the biopsychosocial sciences and humanities. Demonstrates the relevance of psychiatric-mental health nursing concepts to all areas of professional practice.",
        "capacity": 0,
        "credits": [
            5,
            5
        ],
        "term": "Spring 2023"
    },
    {
        "title": "NCLEX RN Preparation",
        "subjectCode": "NUR",
        "courseCode": "39900",
        "instructor": [
            "Deborah K Dye",
            "Sandra J Gilpin",
            "Rebecca C Johnson"
        ],
        "description": "Hours, credit, and subject matter to be arranged by faculty.",
        "capacity": 0,
        "credits": [
            0,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Issues In Professional Nursing",
        "subjectCode": "NUR",
        "courseCode": "41001",
        "instructor": [
            "Kelly A Kean",
            "Mopelola T Adeola"
        ],
        "description": "Promotes the use of critical thinking, clinical reasoning, and active learning to analyze contemporary issues related to professional nursing practice. Issues and key trends surrounding social determinants of health policy and economics, regulatory agencies, political action, cultural diversity, practice competency, nursing informatics and ethics are used as a framework. Permission of department required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Pediatric Nursing",
        "subjectCode": "NUR",
        "courseCode": "41401",
        "instructor": [
            "Mary Erin Hoying"
        ],
        "description": "Explores factors influencing the health and wellness of children and families. Students will apply principles, concepts and research from the health and human sciences to the care of children and families across the health-illness continuum. A structured clinical component focuses on clinical reasoning and evidence based practice. Students will provide family centered care to healthy, at risk and ill children across a variety of clinical settings.",
        "capacity": 0,
        "credits": [
            5,
            5
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Public Health Nursing",
        "subjectCode": "NUR",
        "courseCode": "41501",
        "instructor": [
            "Abidemi Mary Ajuwon"
        ],
        "description": "Utilize health promotion, maintenance, education and disease prevention in coordinating and providing population-focused care to individuals, families and aggregates in the community. A variety of clinical settings are used to offer students a broad, comprehensive perspective of public health nursing, a field that synthesizes content from nursing, social and public health sciences. Collaboration with the community and implementation of population-focused interventions foster critical thinking and independent decision making in the delivery of nursing care.",
        "capacity": 0,
        "credits": [
            5,
            5
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Leadership In Nursing",
        "subjectCode": "NUR",
        "courseCode": "41701",
        "instructor": [
            "Diane L Hountz"
        ],
        "description": "Studies the components of nursing leadership and management functions with an emphasis on critical thinking, problem solving, communication, and team building within the context of experiential problem-based group projects. This course will provide specific practice and evaluation of strategic and financial planning, conflict management, delegation, and complex change. Competencies to be gained, at a novice level, include professional communication, sound ethical and legal judgments within personal and organizational frameworks, leadership skills in the management and evaluation of others, and an understanding of the drivers of healthcare change and finances.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Transition To Professional Nursing Practice",
        "subjectCode": "NUR",
        "courseCode": "42001",
        "instructor": [
            "Christine Michelle Jones"
        ],
        "description": "This course challenges students to use critical thinking and clinical reasoning to identify, prioritize and evaluate nursing interventions for clients with complex healthcare issues. Students interact with members of the healthcare team and clinical faculty to practice effective leadership, delegation and supervision of nursing students in clinical environments.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Advanced Health Assessment",
        "subjectCode": "NUR",
        "courseCode": "50300",
        "instructor": [
            "Christine Ann Balt"
        ],
        "description": "Students develop advanced, evidence-based health assessment skills that build on their current knowledge and abilities. Major concepts of the course include comprehensive and focused history taking and advanced physical assessment. Students relate underlying physiologic mechanisms with normal and abnormal findings from the history and physical assessment. The course provides a basis for designing a culturally sensitive and evidence-based plan of care within the situational context of the individual.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Sociocultural Influences On Health",
        "subjectCode": "NUR",
        "courseCode": "50500",
        "instructor": [
            "Azza H Ahmed"
        ],
        "description": "This course examines the influences of cultural and sub-cultural variables on health and health care delivery. Students analyze and apply appropriate theoretical perspectives and current research to design evidence-based strategies that ground clinical decision making in advanced practice nursing. Students use the National Standards on Culturally and Linguistically Appropriate Services (CLAS) as the basis for providing culturally competent care. As students apply principles of culturally competent communication they are encouraged to develop insight and an attitude of resistance to stereotyping. Students gain an understanding of the context of vulnerable and marginalized populations through the analysis of social, cultural, and economic influences that impact health and illness.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Research And Evidence Based Nursing Practice",
        "subjectCode": "NUR",
        "courseCode": "51000",
        "instructor": [
            "Kathleen A Abrahamson"
        ],
        "description": "This course focuses on both the generation of primary evidence through an in-depth examination of the research process and its critical use in evidence based practice. Students systematically search, appraise and interpret the best available evidence that informs advanced practice nursing and health related disciplines.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Clinical Applications In Pharmacotherapeutics",
        "subjectCode": "NUR",
        "courseCode": "51200",
        "instructor": [
            "Qinglan Ding"
        ],
        "description": "This course applies information from NUR 50200 to the care of clients through the use of case studies. Emphasis is placed on incorporating information from pharmacology, physiology, and physical assessment.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Clinical Applications In Pharmacology Family Nurse Practitioner",
        "subjectCode": "NUR",
        "courseCode": "51601",
        "instructor": [
            "Yadira Santiago Banuelos"
        ],
        "description": "This course applies information from Pharmacotherapeutics in primary care (NUR 50200) to the care of infants, children, adolescents and adults through the use of case studies. Emphasis is on incorporating from pharmacology, physiology and physical assessment.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Psychopharmacology Across The Lifespan",
        "subjectCode": "NUR",
        "courseCode": "52200",
        "instructor": [
            "Susan J Kersey"
        ],
        "description": "Signs and symptoms of all major psychiatric disorders and the medications used to treat them across the life-span are discussed. Classes of psychiatric medications are considered; including indications, therapeutic uses, neurophysiological mechanism of action and side effects.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Chronic And Commonly Recurring Conditions: Adult Health Practice",
        "subjectCode": "NUR",
        "courseCode": "54200",
        "instructor": [
            "Qinglan Ding"
        ],
        "description": "Examination of pathophysiological alterations and clinical management of chronic conditions and illnesses in adolescents and adults. Students will synthesize knowledge of physiological, psychological, and sociocultural factors in the assessment and management of chronic conditions. Focus is on the differential diagnosis, clinical management, and patient and family education within the context of primary care. Chronic illness and health promotion models, as well as biopsychosocial and cultural theories are integrated throughout the course. Individual, family, and group intervention strategies are addressed. The adult nurse practitioner role is analyzed in the context of caring for persons with acute conditions.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Chronic Illness And Commonly Recurring Conditions: Pediatric Health Preceptorship",
        "subjectCode": "NUR",
        "courseCode": "55300",
        "instructor": [
            "Jennifer A Coddington"
        ],
        "description": "Assists students to develop and broaden clinical judgment and skills. Content includes the study of chronic illness and recurring conditions in children and adolescents and the impact of those conditions on family members. The focus is on growth and development, differential diagnosis, clinical decision making and management, and child and family education within the context of primary care. The pediatric nurse practitioner role is analyzed in the context of caring for children with chronic conditions. Professional issues, collaboration, scope of practice, and advocacy are emphasized.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Advanced Practice Psychiatric Mental Health Nursing Across The Lifespan II",
        "subjectCode": "NUR",
        "courseCode": "57600",
        "instructor": [
            "Susan J Kersey"
        ],
        "description": "The practice of Psychiatric Mental Health Nurse Practitioner (PMHNP) is further expanded to include identification and management of the complex patient across the life span. Explore how co-morbid health conditions impact psychiatric disorders and treatment response. Differentiate psychiatric diagnoses, personality disorders, social, family and cultural influences, developmental disorders and how these factors impact treatment. Apply a variety of approaches including inter-and intra-professional resources, and psychopharmacological interventions to the management of complex patients. Legal and ethical implications of care are discussed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Water Supply In Dev Countries",
        "subjectCode": "NUR",
        "courseCode": "59900",
        "instructor": [
            "Ernest R Blatchley",
            "Nancy E Edwards",
            "Elizabeth A Richards"
        ],
        "description": "Credit Hours: 0.00 to 6.00 (West Lafayette, Calumet) 1.00 to 6.00 (Fort Wayne).  Special topics in nursing are critically examined. Hours, credit, and subject matter are determined by the staff. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Primary Care Of The Young Family Preceptorship",
        "subjectCode": "NUR",
        "courseCode": "61500",
        "instructor": [
            "Yadira Santiago Banuelos"
        ],
        "description": "This course assists students to develop and broaden clinical judgment and skills. Content includes the study of primary care of the young family with acute and chronic conditions, and the impact of those conditions on family members. Focus is on assessment, differential diagnosis, clinical decision-making and management, as well as patient and family education within the context of primary care. The Family Nurse Practitioner role is analyzed in the context of caring for the young family with acute and chronic conditions. Professional issues, collaboration and scope of practice, advocacy are emphasized. Prerequisites: NUR 50700 and NUR 50200 and NUR 50300 and NUR 51600 and NUR 51100 and  NUR 51300. Co-requisite: NUR 61100.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Family Nurse Practitioner Preceptorship Clinical Synthesis",
        "subjectCode": "NUR",
        "courseCode": "63100",
        "instructor": [
            "Yadira Santiago Banuelos"
        ],
        "description": "This course assists students to integrate clinical knowledge and skills from prior course work when providing care to patients across the lifespan. The Family Nurse Practitioner role is analyzed in the context of caring for patients of all ages with acute and chronic conditions. Focus is on assessment, differential diagnosis, clinical decision-making and management, as well as patient and family education within the context of primary care. Prerequisites: NUR 50700 and NUR 50200 and NUR 50300 and NUR 51600 and NUR 51100 and  NUR 51300. Co-requisite: NUR 61100 and NUR 61500 and NUR 62200 and NUR 62700.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Human Factors In Healthcare Engineering",
        "subjectCode": "NUR",
        "courseCode": "64000",
        "instructor": [
            "Sara A Mccomb"
        ],
        "description": "This course provides an introduction to human factors and ergonomics with a focus on healthcare applications. Fundamental principles will be introduced including the cognitive, physical, and social considerations that comprise human factors engineering. By course completion, students should be able to formulate studies of and/or evaluate the healthcare domain using these fundamentals principles of human factors engineering. Prerequisites: NUR 51000 or equivalent and Undergraduate Statistics course within the past five years.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Collaboration Seminar",
        "subjectCode": "NUR",
        "courseCode": "69040",
        "instructor": [
            "Azza H Ahmed"
        ],
        "description": "Principles of collaboration to generate scientific knowledge, which is used to improve nursing and healthcare practice, education, policy, and outcomes, are discussed. Evidence generated from transdisciplinary teams is analyzed with attention given to specific professions' contributions and roles. The specific role of the nurse scientist and the value of nursing intelligence within the context of collaborative projects are discussed. Best practices in collaboration as exemplified by select research teams are presented. Admission to the Nursing PhD program or instructor permission. This is one of the first courses taken by PhD students and may be open to graduate students outside the School of Nursing with permission from the instructor.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Implementing Theory In Healthcare Research",
        "subjectCode": "NUR",
        "courseCode": "69050",
        "instructor": [
            "Karen J Foli"
        ],
        "description": "Historical and contemporary social, ethical, educational, scientific, and professional influences on the development of theoretical knowledge in nursing and health research are analyzed. Various methods of theory development are reviewed. Selected biological/physiological, behavioral, and health service theories that form the basis of nursing science are critically evaluated. Skills needed for theory analysis and theory development are emphasized. The role of theoretical knowledge to innovation in nursing science and healthcare is presented. Scientific bridges between theoretical frameworks and research methods are appraised. Selected nursing and healthcare scientists communicate the theoretical aspects of their programs of research with an emphasis on collaboration between disciplines. Admission to the Nursing PhD program or instructor permission. This is one of the first courses taken by PhD students and may be open to graduate students outside the School of Nursing with permission from the instructor.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Health Care Research Methods",
        "subjectCode": "NUR",
        "courseCode": "69100",
        "instructor": [
            "Gregory W Arling"
        ],
        "description": "This course advances knowledge and skill in quantitative research methods for health program evaluation, population health, healthcare quality improvement, and other healthcare research applications. Topics include design of experimental, quasi-experimental, and observational studies; primary data collection through surveys and other techniques; use of clinical, administrative, and other secondary data sources; and data analysis strategies appropriate to each design and type of data. The course addresses basic issues of sampling, measurement, and validity and reliability, as well as practical issues that arise in healthcare research.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    }
]