[
    {
        "title": "Pharmacy Leadership Seminar",
        "subjectCode": "PHPR",
        "courseCode": "42700",
        "instructor": [
            "Steven R Abel"
        ],
        "description": "This course is specifically designed to mentor enthusiastic leaders and enhance their ability to become an effective leader in the practice of pharmacy. The objective of this course is not to build a leader, rather to augment the characteristics the particular leader possesses. Students have the opportunity to partake in a variety of activities including the development of a proposal with implementation plan to address a current school-wide issue. A variety of outside speakers share their leadership experiences with the class. The course has a maximum enrollment and requires instructor approval to enroll. Students interested in enrolling in the course must submit a course application packet. Students are assessed on written reflections, oral presentation, written reports, and a group project.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Complementary And Alternative Medicine",
        "subjectCode": "PHPR",
        "courseCode": "48900",
        "instructor": [
            "Cynthia P Koh-Knox Sharp"
        ],
        "description": "This course is intended to expose students in health care fields to alternative health care practices used by people around the world.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Veterinary Pharmacotherapy",
        "subjectCode": "PHPR",
        "courseCode": "49000",
        "instructor": [
            "Elizabeth Caroline Carman"
        ],
        "description": "An honors course to be used to relate to, and supplement, an existing course. Subject matter and method of approach individually directed by instructor. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2023"
    }
]