[
    {
        "title": "Elementary Psychology",
        "subjectCode": "PSY",
        "courseCode": "12000",
        "instructor": [
            "Colin Thomas William",
            "Jill E Gulker",
            "George J Hollich"
        ],
        "description": "Introduction to the fundamental principles of psychology, covering particularly the topics of personality, intelligence, emotion, abnormal behavior, attention, perception, learning, memory, and thinking. As part of their learning experience, students participate in psychological experiments. CTL:ISH 1020 Introduction To Psychology",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Introduction To Cognitive Psychology",
        "subjectCode": "PSY",
        "courseCode": "20000",
        "instructor": [
            "Melissa J Swisher",
            "Yu-Chin Chiu",
            "Nadia Marie Brashier"
        ],
        "description": "A survey of psychology as the science of mental life, covering theories and research in perception, reading, attention, consciousness, imagery, memory and its improvement, problem solving, creativity, decision-making, and artificial intelligence.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Introduction To Statistics In Psychology",
        "subjectCode": "PSY",
        "courseCode": "20100",
        "instructor": [
            "Daniel J Foti",
            "Corrinne C Lim-Kessler",
            "Melissa J Swisher",
            "Darryl W Schneider"
        ],
        "description": "An introduction to the development and application of statistical, quantitative, and measurement techniques pertinent to the psychological sciences. Fundamental concepts of numerical assignment, sampling theory, distribution functions, experimental design, inferential procedures, and statistical control. Should be taken at Purdue University, West Lafayette.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Introduction To Research Methods In Psychology",
        "subjectCode": "PSY",
        "courseCode": "20300",
        "instructor": [
            "Melissa J Swisher",
            "Thomas S Redick"
        ],
        "description": "The use of scientific method in psychology. Lecture covers principles of collecting and interpreting data, using examples of research from many areas of psychology. In the laboratory portion, the student uses many different techniques from various areas of psychology. Should be taken at Purdue University, West Lafayette.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Introduction To Behavioral Neuroscience",
        "subjectCode": "PSY",
        "courseCode": "22200",
        "instructor": [
            "Corrinne C Lim-Kessler"
        ],
        "description": "An introduction to how the nervous system controls behavior. Topics include evolution and comparative psychobiology, the neuroscience of sensation and perception, the neuroscience of motivation, neuropsychology, and cognitive neuroscience.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Child Psychology",
        "subjectCode": "PSY",
        "courseCode": "23500",
        "instructor": [
            "George J Hollich"
        ],
        "description": "Not open to students with credit in PSY 36000. General principles of children's behavior and development, from conception to adolescence, including sensory and motor development, and basic psychological processes such as learning, motivation, and socialization.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Introduction To Social Psychology",
        "subjectCode": "PSY",
        "courseCode": "24000",
        "instructor": [
            "Jill E Gulker",
            "Nathan Norem Cheek"
        ],
        "description": "Not open to students with credit in SOC 34000. A broad survey in current knowledge about human social behavior. Topics covered include aggression, attraction and love, social influence, attitudes and attitude change, nonverbal communication, leadership, prejudice and discrimination, and application of social psychology to law, medicine, and other fields. CTL:ISH 1024 Social Psychology",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Introduction To Industrial-Organizational Psychology",
        "subjectCode": "PSY",
        "courseCode": "27200",
        "instructor": [
            "Jerod Cody White"
        ],
        "description": "Survey of psychological principles and research methods relevant to organizations and industry. Topics covered include research methodology, individual differences, personnel selection, performance measurement, training, motivation, job satisfaction, emotions, work stress, and leadership.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Understanding And Analyzing Experiments",
        "subjectCode": "PSY",
        "courseCode": "30600",
        "instructor": [
            "Ximena B Arriaga"
        ],
        "description": "This course is designed to strengthen skills for doing experimental research and is intended for students who plan to pursue graduate degrees. It covers methods and statistics in designing and analyzing experimental studies in psychological sciences that are typically required of first-year graduate students. The course also provides training in analyzing experiments using statistical software (SPSS). Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Introduction Cognitive Neuroscience",
        "subjectCode": "PSY",
        "courseCode": "32400",
        "instructor": [
            "Anne B Sereno"
        ],
        "description": "(SLHS 30100) Introduction to the neural bases of complex human mental abilities. Emphasis on integrating research from cognitive science, brain-scanning techniques, and the lesion technique. Topics include perception, attention, memory, language, motor control, planning/decision-making and consciousness.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Stereotyping And Prejudice",
        "subjectCode": "PSY",
        "courseCode": "33500",
        "instructor": [
            "Erin Sparks Ward"
        ],
        "description": "This course examines the topics of stereotyping, prejudice, and discrimination from a social psychological perspective. Relying on empirical findings and relevant theoretical approaches, the course moves beyond lay opinions to explore the social psychological foundations and forms of stereotyping and prejudice, and to examine various strategies for reducing intergroup biases.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Introduction To Psychology Of Personality",
        "subjectCode": "PSY",
        "courseCode": "34200",
        "instructor": [
            "William G Graziano"
        ],
        "description": "This course integrates empirical studies (observational, correlational, experimental) with classical and current personality theories. Topics include the biological foundations of personality, self-esteem, extraversion, sex role orientation, authoritarianism, and personality disorders. Minimum competence is assumed in basic experimental design and correlations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Abnormal Psychology",
        "subjectCode": "PSY",
        "courseCode": "35000",
        "instructor": [
            "Christopher I Eckhardt",
            "Colin Thomas William"
        ],
        "description": "Various forms of mental disorders from the standpoint of their origin, treatment, prevention, social significance, and relation to problems of normal human adjustment. CTL:ISH 1023 Abnormal Psychology",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Introduction To Neuropsychology",
        "subjectCode": "PSY",
        "courseCode": "35200",
        "instructor": [
            "Edward A Fox"
        ],
        "description": "This course is an examination of the effects of various types of brain damage on human behavior, the methods used to assess brain damage, and evaluation of research studies on human brain damage and behavior.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Close Relationships",
        "subjectCode": "PSY",
        "courseCode": "35400",
        "instructor": [
            "Christopher R Agnew"
        ],
        "description": "This course introduces undergraduate college students to major topics in psychological research on intimate relationships. There are many types of close relationships. This primarily focuses on relationships that currently are, will be soon, or at one point were, romantic involvements. A goal is to educate students on current research findings concerning intimate relationships.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Attention And Cognitive Control",
        "subjectCode": "PSY",
        "courseCode": "37600",
        "instructor": [
            "Robert W Proctor"
        ],
        "description": "This upper-level undergraduate course provides an overview of research and theory related to attention and cognitive control. The first half of the course focuses on selective attention to locations, objects, and features, as well as the role of attention in memory and skilled performance. The second half focuses on divided attention and cognitive control in multitasking situations, as well as aspects of adaptive, hierarchical, and inhibitory control. The goal of the course is to provide you with an understanding of major theoretical views, key experimental findings, and common research procedures related to attention and cognitive control.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Judgement And Decision Making",
        "subjectCode": "PSY",
        "courseCode": "39200",
        "instructor": [
            "David L Kemmerer",
            "Sang Eun Woo",
            "Kipling D Williams",
            "Stephen B Broomell",
            "Bridgette L Kelleher"
        ],
        "description": "Various topics that may change from semester to semester are presented by Psychological Sciences department faculty.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Psycholinguistics",
        "subjectCode": "PSY",
        "courseCode": "40300",
        "instructor": [
            "Natalya B Kaganovich"
        ],
        "description": "(PSY 40300) This course aims to introduce students to the current, research-based understanding of how different aspects of language (such as word perception, language acquisition, or speech production) are represented in the mind. In addition, it will introduce some of the research methods employed by language scientists for gaining insight into such a representation. This course also aims to help students learn how to critically evaluate research data used to support various theories about psychological and neural foundations of language knowledge.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Honors Research Seminar I",
        "subjectCode": "PSY",
        "courseCode": "40400",
        "instructor": [
            "Thomas S Redick"
        ],
        "description": "Part one of a research series aimed at providing a structured learning experience to help students develop the basic research skills needed in order to conduct psychological research. Students will be expected to develop a research plan to be completed in concert with PSY 40500. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Alcohol Use And Disorders",
        "subjectCode": "PSY",
        "courseCode": "42100",
        "instructor": [
            "Julia A Chester"
        ],
        "description": "The goal of this course is to provide students with a broad understanding of the biological bases of alcohol abuse and alcoholism. The course will cover neuroanatomical, neurochemical and biological systems that regulate the biological and behavioral response to alcohol. Coverage will also include discussions of the role of environment, age, gender, among other factors that influence the response to alcohol and propensity toward abuse and addiction. The course will also cover the neuroscience of treatment and relapse. Typically offered Spring.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Language Development",
        "subjectCode": "PSY",
        "courseCode": "42600",
        "instructor": [
            "Jennifer Lee Hendrickson"
        ],
        "description": "(SLHS 30900) Specific nature, sequence, and pattern of oral language development from birth through adolescence. Nature of language acquisition and approaches to the study of children's language are presented. Linguistic and psychological explanations of the sequence of development are discussed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Drugs And Behavior",
        "subjectCode": "PSY",
        "courseCode": "42800",
        "instructor": [
            "Susan E Swithers"
        ],
        "description": "Discussion of the variety of drugs that affect the nervous system and behavior. Emphasis will be upon a discussion of the physiological and pharmacological bases for the use and misuse of drugs in our society.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Hormones And Behavior",
        "subjectCode": "PSY",
        "courseCode": "42900",
        "instructor": [
            "Kimberly P Kinzig"
        ],
        "description": "Discussion of the mechanisms and effects of endocrine hormones and brain peptides on sexual differentiation, sexual behavior, learning, response to stress, maternal behavior, and weight regulation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Behavioral And Neural Systems Of Learning And Memory",
        "subjectCode": "PSY",
        "courseCode": "43700",
        "instructor": [
            "Sydney Marie Trask"
        ],
        "description": "The purpose of this course is to integrate insights on learning and memory from behavioral and neuroscience perspectives based on animal and human research. How brain regions underlie different categories of learning will be covered. Discussions on how these types of learning contribute to clinical disorders, such as anxiety and addiction disorders.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Selection And Performance Appraisal In Organizations",
        "subjectCode": "PSY",
        "courseCode": "47300",
        "instructor": [
            "Qianqi Song"
        ],
        "description": "Classic and current issues in employee selection and the appraisal of employee performance will be discussed. Topics addressed will include: Equal Employment Opportunity and unfair discrimination, developing effective selection and placement strategies, evaluating employee performance, and understanding the performance appraisal process.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Professional Issues And Trends In Social Psychology",
        "subjectCode": "PSY",
        "courseCode": "50600",
        "instructor": [
            "Teri Ann Kirby"
        ],
        "description": "This course is designed to help students acculturate to and acquire a broad knowledge of social psychological research. Topics to be covered include but are not limited to: how to apply for academic jobs, how to present your program of research, how to network at conferences, how to develop a website presence, how to approach potential collaborators, and how to structure your research questions in an appropriate manner for grant applications. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Current Readings In Social Psychology",
        "subjectCode": "PSY",
        "courseCode": "50700",
        "instructor": [
            "Nathan Norem Cheek"
        ],
        "description": "This course is designed to expose students to a variety of readings, discussions, and presentations. The seminar examines a diverse assortment of social psychological topics. Students benefit from exposure to current research and methods in the field. Students also benefit from becoming increasingly conversant regarding the latest empirical advances in the field. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Neural Systems",
        "subjectCode": "PSY",
        "courseCode": "51200",
        "instructor": [
            "Estuardo Robles"
        ],
        "description": "(SLHS 50700, BIOL 56200)  Background in cell biology, psychobiology, physiology, or anatomy is recommended. Overview of the structure and function of neural systems including those involved with motor, somatosensory, visual, auditory, learning, memory, and higher cortical processes. Molecular and cellular aspects of neural function are integrated with discussion of relevant neuroanatomy. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Neuroscience Of Consciousness",
        "subjectCode": "PSY",
        "courseCode": "51500",
        "instructor": [
            "Edward A Fox"
        ],
        "description": "How does your brain generate your uniquely subjective experience of the world? Is it possible to identify distinct neurophysiological markers of your awareness of a particular sight, sound, taste, or touch? What is the cortical basis of your sense of being a self with a first-person point of view that is spatiotemporally grounded in a body? How does consciousness relate to attention and working memory? Does consciousness have an adaptive function? Might a person in a coma or a vegetative state still have some form of awareness? Could a computer or a robot ever have what we would consider to be genuine experiences? During the past few decades, these and other questions about the nature of consciousness have been the focus of increasing empirical and theoretical research in neuroscience and other disciplines. The main purpose of the course is to introduce students to this exciting field of inquiry by exposing them to a variety of representative books and articles in the literature. The \"backbone\" of the course will be Stanisla's Dehaenes Consciousness and the brain: Deciphering how the brain codes our thoughts (2014). As we go through the course, we will use each successive chapter in this book as the starting point for a deeper and wider exploration of the given topic(s), bringing into our discussion relevant experimental findings and philosophical perspectives from other investigators. Requirements: Students will take turns guiding discussions and will also write 1-2 page \"response papers\" to the weekly readings. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Job Design",
        "subjectCode": "PSY",
        "courseCode": "55600",
        "instructor": [
            "Vincent G Duffy"
        ],
        "description": "(IE 55600) Task analysis, personnel selection and training, job and organizational design, and criteria development and use. Human factors related to job design in order to increase job satisfaction and productivity.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Human Factors In Engineering",
        "subjectCode": "PSY",
        "courseCode": "57700",
        "instructor": [
            "Robert W Proctor"
        ],
        "description": "(IE 57700) Survey of human factors in engineering, with particular reference to human functions in human-machine systems, and consideration of human abilities and limitations in relation to design of equipment and work environments. Primarily for engineers and other non-psychology majors.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Teaching Psychology",
        "subjectCode": "PSY",
        "courseCode": "59100",
        "instructor": [
            "George J Hollich",
            "Kipling D Williams"
        ],
        "description": "Various topics that may change from semester to semester are presented by faculty in the Department of Psychological Sciences.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Applied Multivariate Analysis",
        "subjectCode": "PSY",
        "courseCode": "60500",
        "instructor": [
            "Ehtibar N Dzhafarov"
        ],
        "description": "A survey of the most frequently employed multivariate research techniques, such as multivariate generalizations of univariate tests and analysis of variance, principal components, canonical analysis, and discriminant analysis. A central theme of the course is the general linear model, both univariate and multivariate. A multipurpose program for this model provides the student with practical experience in conducting multivariate research. Some prior exposure to elementary matrix algebra is recommended. Prerequisite: PSY 60000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Multiple Regression Analysis For The Behavioral Sciences",
        "subjectCode": "PSY",
        "courseCode": "63100",
        "instructor": [
            "Donald R Lynam"
        ],
        "description": "This \"data analytic\" course provides an examination of the conceptual underpinnings and advanced application of multiple regression analyses to psychological data. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Pro Seminar Cognitive",
        "subjectCode": "PSY",
        "courseCode": "63300",
        "instructor": [
            "Jeffrey D Karpicke",
            "Darryl W Schneider"
        ],
        "description": "Critical analysis of current problems in experimental psychology. Emphasis upon reviewing literature, preparing and presenting papers. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            2,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Clinical Assessment I",
        "subjectCode": "PSY",
        "courseCode": "66700",
        "instructor": [
            "Douglas B Samuel"
        ],
        "description": "Presentation of general assessment principles and methods. Supervised practice in general diagnostic and treatment procedures as applied to both children and adults. Emphasis is placed on laboratory practice in the administration and interpretation of intelligence tests; behavioral observation techniques and operant remediation procedures. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Test/Assessment Prac",
        "subjectCode": "PSY",
        "courseCode": "67900",
        "instructor": [
            "James P Noll",
            "Heather A Ciesielski"
        ],
        "description": "This is a practicum in clinical psychology, whereby students see individuals for therapy. These cases are supervised by faculty in clinical psychology. This is a requirement for the graduate program, and students must do both adult and child practicum. Students enrolled in this program must register for this course a minimum of four times. Prerequisite: Master's student standing and Psychology majors only. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Res Mthds II I/O Psy",
        "subjectCode": "PSY",
        "courseCode": "68100",
        "instructor": [
            "Sien Chieh Tay"
        ],
        "description": "Intensive analysis of application of various research and statistical methods to the study of human behavior in organizational settings.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Training",
        "subjectCode": "PSY",
        "courseCode": "68300",
        "instructor": [
            "Tara Shetye Behrend"
        ],
        "description": "Topics vary. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Research Methods In Social Psychology",
        "subjectCode": "PSY",
        "courseCode": "68800",
        "instructor": [
            "William G Graziano"
        ],
        "description": "This course provides a broad and rigorous, graduate-level overview of contemporary research methodology in social psychology and personality. The course follows a discussion seminar format. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Pro-Sem Clinical Psy",
        "subjectCode": "PSY",
        "courseCode": "69200",
        "instructor": [
            "David L Kemmerer",
            "Donald R Lynam",
            "Melissa M Robertson"
        ],
        "description": "Various topics which may change from semester to semester are presented by faculty in the Department of Psychological Sciences.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Seminar In Neuroscience",
        "subjectCode": "PSY",
        "courseCode": "69600",
        "instructor": [
            "Sebastien Helie"
        ],
        "description": "The course is designed to expose graduate students to diverse areas of most up to-date research and hone their skills in understanding conceptual issues and tools used to study neuroscience. The students help host speakers and introduce speakers before their colloquium talk. The students will also formally present their own research to the area faculty and students once each year, at a level appropriate to their years in the program. Lastly, each student will write a \"journal club\" style paper on a recently published empirical study. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    }
]