[
    {
        "title": "Careers In Veterinary Medicine",
        "subjectCode": "VM",
        "courseCode": "10200",
        "instructor": [
            "James L Weisman"
        ],
        "description": "Overview of the field of veterinary medicine presently and as anticipated for the future. Presentations will include descriptions and discussions of the nature of the professional activity, organization of veterinary medicine, career opportunities, issues confronting the profession, and the admission requirements of the profession.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Veterinary Technology Career Exploration",
        "subjectCode": "VM",
        "courseCode": "10800",
        "instructor": [
            "Pamela J Phegley"
        ],
        "description": "This course will introduce students to basic concepts related to the veterinary technology profession. The course will provide an introduction to the various career opportunities within the veterinary healthcare profession as well as a general introduction to the attributes and traits of veterinary medical professionals. Veterinary technology as a career will be explored to promote understanding of the responsibilities of the veterinary technician and technologist in the veterinary medical field. Enrollment restricted to non-veterinary technology majors and first-year veterinary technology students. Second through fourth-year veterinary technology students may not register for this course.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Integrations For Veterinary Nurses",
        "subjectCode": "VM",
        "courseCode": "34210",
        "instructor": [
            "Chad Raymond Brown"
        ],
        "description": "This course will give an introduction to problem-based learning of the nursing process (patient evaluations, interventions, and desire resolutions) using a case-based approach. This course will integrate foundational knowledge from anatomy, physiology, and information in the veterinary nursing courses. This course will draw on fundamentals and concepts learned from all courses to this point including pharmacology, diagnostic imaging, parasitology, small animal nursing, and large animal nursing, so as to enable you to apply knowledge of understanding of clinical cases. Cases will involve different domestic animal species.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Management I",
        "subjectCode": "VM",
        "courseCode": "34500",
        "instructor": [
            "Bethany L Laffoon"
        ],
        "description": "Credit Hours: 1.50.  The course will introduce students to concepts related to working in and managing a veterinary practice. Emphasis will be on client communication and education as well as facilitating a job search, interviewing and cover letter and resume creation.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Spring 2023"
    },
    {
        "title": "International Veterinary Medicine",
        "subjectCode": "VM",
        "courseCode": "40900",
        "instructor": [
            "Sandra F Sanmiguel"
        ],
        "description": "Credit Hours: 0.50.  The course will consist of a series of lectures and discussions addressing international aspects of veterinary medicine. The course will include the following topics: foreign animal diseases, biosecurity, animal welfare and ethics, veterinary medicine around the world, food security, and cultural competence.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Veterinary Technology Senior Project",
        "subjectCode": "VM",
        "courseCode": "44500",
        "instructor": [
            "Jessica Lynn Christensen"
        ],
        "description": "This is an independent study course in which the student engages in learning activities to enhance their knowledge in a particular area of veterinary technology of their choosing, demonstrate effective oral and written communication, and apply analysis, integration, and syntheses to achieve a solution.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Advanced Neurology For Veterinary Medicine",
        "subjectCode": "VM",
        "courseCode": "45700",
        "instructor": [
            "Robin T Bentley"
        ],
        "description": "This course will focus on neuroanatomy and neurophysiology as well as explore a variety of common neurologic diseases and the basic pathophysiology behind those disease processes. Students will also learn proper nursing care techniques associated with patients with these diseases.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2023"
    },
    {
        "title": "International Veterinary Medicine",
        "subjectCode": "VM",
        "courseCode": "80900",
        "instructor": [
            "Sandra F Sanmiguel"
        ],
        "description": "The course will consist of eight lectures addressing international aspects of the following topics: zoonotic diseases, food hygiene, biosecurity, animal welfare, animal husbandry, infectious diseases, cultural competence, veterinary medical education, and role of international organizations in animal health. Participating students will be required to choose an internationally relevant topic of interest to research. The last session of the course will be a poster session in which each student will present and discuss a poster. The posters will be evaluated by a panel of 3-4 faculty members and a grade assessed. Permission of Department required.",
        "capacity": 0,
        "credits": [
            0,
            1
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Current Issues In Veterinary Medicine",
        "subjectCode": "VM",
        "courseCode": "82500",
        "instructor": [
            "Souvigny K Salisbury"
        ],
        "description": "This course provides a regular forum to bring PVM students and faculty together to discuss current issues facing the veterinary profession. Topics will vary depending upon current events and opportunities to feature guest lecturers. Time-shifting may be done to accommodate special events such as PVM Research Day.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Spring 2023"
    }
]