[
    {
        "title": "Women's, Gender, And Sexuality Studies: An Introduction",
        "subjectCode": "WGSS",
        "courseCode": "28000",
        "instructor": [
            "Stephen K Horrocks",
            "Marlo Denice David",
            "Veronica Lynette Coates Ahmed",
            "Judy L Fisher"
        ],
        "description": "An introductory survey of the concepts and research data in the new scholarship on women. Topics covered include biology, sexuality, socialization, family and work, creativity, and politics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Wom Pol And Publ Pol",
        "subjectCode": "WGSS",
        "courseCode": "28100",
        "instructor": [
            "Rosalee A Clawson"
        ],
        "description": "This course examines in depth particular topics from the introductory course in Women's Studies. It addresses gender issues for both men and women. Possible topics include gender and popular culture, women's bodies, body image, and health, masculinities, queering gender and gender transgression.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Introduction To LGBTQ Studies",
        "subjectCode": "WGSS",
        "courseCode": "28200",
        "instructor": [
            "Stephen K Horrocks"
        ],
        "description": "(ANTH 28200)  This course offers students an introduction to the interdisciplinary study of lesbian, gay, bisexual, transgender and queer lives. It provides a basic grounding in theories of sexuality and LGBT histories, identities and movements in the U.S. and globally.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Love, Sex And Sexuality",
        "subjectCode": "WGSS",
        "courseCode": "38200",
        "instructor": [
            "Juanita M Crider"
        ],
        "description": "Explores intimate relationships and marriage practices in Western and non-Western societies from a historical and comparative perspective. Examines the changes in love and marriage in Greco-Roman societies, medieval and modern Europe, China, India and the Muslim world, among others.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Women, Work, And Labor",
        "subjectCode": "WGSS",
        "courseCode": "38300",
        "instructor": [
            "Stephen K Horrocks"
        ],
        "description": "Examines race, class and gender issues as they affect working women in America. Covering women's work from domestic labor to informal economies to factories, topics include women's participation in trade unions, wage inequalities, family leave policies and sexual harassment.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Women And Leadership",
        "subjectCode": "WGSS",
        "courseCode": "39000",
        "instructor": [
            "Cheryl A Cooky",
            "Wendy K Kline",
            "Sharra L Vostral",
            "Yvonne M Pitts",
            "Christopher D Munt",
            "Lorraine G Kisselburgh"
        ],
        "description": "Variable topics under the direction of an instructor in a particular field of specialization.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Feminist Theory",
        "subjectCode": "WGSS",
        "courseCode": "48000",
        "instructor": [
            "Jennifer Lynn Freeman Marshall"
        ],
        "description": "Intensive study of a variety of contemporary and international feminist theories from an interdisciplinary perspective. Provides an overview of major trends, critical approaches, and diverse viewpoints in the field of feminist theory.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Interdisciplinary Studies In Sexuality: Scholarship On Lesbian And Gay Issues",
        "subjectCode": "WGSS",
        "courseCode": "48200",
        "instructor": [
            "Christopher D Munt"
        ],
        "description": "This course offers an interdisciplinary introduction to recent work in lesbian and gay studies in various fields, including literature, history, film, cultural theory, medicine, law, and studies of sexuality.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    },
    {
        "title": "Feminist Ecology",
        "subjectCode": "WGSS",
        "courseCode": "68100",
        "instructor": [
            "Geraldine S Friedman"
        ],
        "description": "Applies feminist theory, knowledge, and methods to the examination of selected contemporary issues. Emphasizes ways in which theory and practice interact in feminist scholarship. Content may vary according to the issues examined. Prerequisite: WGSS 68000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2023"
    }
]