[
    {
        "title": "Crop Production",
        "subjectCode": "AGRY",
        "courseCode": "10500",
        "instructor": [
            "Corey K Gerber"
        ],
        "description": "Fundamental principles of crop production and distribution. Emphasis is placed on applying technological advances in agronomy to active crop-production situations, including basic soils, agricultural meteorology, and crop physiology and breeding.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Environmental Science And Conservation",
        "subjectCode": "AGRY",
        "courseCode": "12500",
        "instructor": [
            "John B Dunning"
        ],
        "description": "(EAPS 12500, FNR 12500, NRES 12500) Introduction to environmental science and conservation includes topics in ecological principles, conservation and natural resource management, human impacts on the environment, toxic waste disposal, climate change, energy, air and water pollution, environmental geology and geologic hazards.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Fundamentals Of Turfgrass Culture",
        "subjectCode": "AGRY",
        "courseCode": "21000",
        "instructor": [
            "Cale A Bigelow"
        ],
        "description": "(HORT 21000) An introductory course in turfgrass management emphasizing turfgrass growth and development, species characteristics, their adaptation and basic cultural requirements for ornamental and functional turfgrass areas. The requirements and cultural inputs needed for proper establishment and maintenance of a high quality, low maintenance lawn will be discussed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Soil Science",
        "subjectCode": "AGRY",
        "courseCode": "25500",
        "instructor": [
            "Shams Rahman R Rahmani"
        ],
        "description": "(NRES 25500) Differences in soils; soils genesis; physical, chemical, and biological properties of soils; relation of soils to problems of land use and pollution; soil management relative to tillage, erosion, drainage, moisture supply, temperature, aeration, fertility, and plant nutrition. Introduction to fertilizer chemistry and use. Not available to students who have taken AGRY 27000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Forest Soils",
        "subjectCode": "AGRY",
        "courseCode": "27000",
        "instructor": [
            "Shams Rahman R Rahmani"
        ],
        "description": "Development, distribution, and classification of soil profile; soil characteristics related to forest practices; nature and cause of soil differences; fertility and plant nutrition. Not available to students who have taken AGRY 25500 or NRES 25500.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "World Crop Adaptation And Distribution",
        "subjectCode": "AGRY",
        "courseCode": "28500",
        "instructor": [
            "Mitchell R Tuinstra"
        ],
        "description": "Examination of how environmental factors, including climate and soils, impact the global distribution of major food crops. Identification of the types of naturally occurring plant communities and comparison of these communities with those of environmentally and economically sound field cropping systems. Exploration of how man's intervention has maintained or modified the productivity of food crops in agricultural communities and how his intervention has affected the environment.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Genetics",
        "subjectCode": "AGRY",
        "courseCode": "32000",
        "instructor": [
            "Mohsen Mohammadi"
        ],
        "description": "The transmission of heritable traits; probability; genotypic-environmental interactions; chromosomal aberrations; polyploidy; gene mutations; genes in populations; the structure and function of nucleic acids; biochemical genetics; molecular genetics; coding.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Weather And Climate",
        "subjectCode": "AGRY",
        "courseCode": "33500",
        "instructor": [
            "Beth Lynelle Hall"
        ],
        "description": "An introductory course in meteorology and climatology with applications to daily life. The study of the fundamental physical principles behind weather and climate and how they apply to the homeowner and the world citizen. Emphasis is on how to interpret weather conditions and forecasts, what controls the wide range of climates in the world, and what the future may hold.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Environmental Hydrology",
        "subjectCode": "AGRY",
        "courseCode": "33700",
        "instructor": [
            "Laura C Bowling"
        ],
        "description": "This course is designed to provide undergraduate students with both the basics of how water moves through the environment and current theories as to how hydrologic response is modified by environmental change at a variety of temporal and spatial scales.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Soil Fertility",
        "subjectCode": "AGRY",
        "courseCode": "36500",
        "instructor": [
            "Jeffrey T Bradford"
        ],
        "description": "Principles of soil chemistry and physics influencing plant nutrition; emphasis on diagnosis and solution of problems on soil reaction and nutrient status; fertilizer chemistry and use; reaction of pesticides and growth regulators with soils.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Crop Production Systems",
        "subjectCode": "AGRY",
        "courseCode": "37500",
        "instructor": [
            "Lee E Schweitzer"
        ],
        "description": "Factors affecting management decisions in crop production systems. Development of small grain and row cropping systems. Interaction of factors affecting efficient production systems, including seed selection, tillage, planting management, pest management, and harvesting and storage considerations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Atmospheric Dynamics I",
        "subjectCode": "AGRY",
        "courseCode": "43200",
        "instructor": [
            "Andrea Elise Orton"
        ],
        "description": "(EAPS 42200) A study of the general system of equations governing mass and momentum changes in the atmosphere; special horizontal wind representations; thermal wind relationships; circulation, vorticity, divergence, and vertical motion.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Forage Management",
        "subjectCode": "AGRY",
        "courseCode": "50500",
        "instructor": [
            "Keith D Johnson"
        ],
        "description": "The study of the role of economically important crop species in the soil-plant-animal complex. Physiology, utilization, and management of forage species will be emphasized.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Plant Physiology And Biotechnology Research Techniques",
        "subjectCode": "AGRY",
        "courseCode": "51800",
        "instructor": [
            "Cankui Zhang"
        ],
        "description": "This course has two components. The physiology section covers some of the popular experiments, such as the measurement of water potential, photosynthesis, stomata density, carbohydrate content, enzyme activity, mineral deficiency, drought stress physiology, plant pigment analysis, etc. The biotechnology section guides students through the entire procedure of genetic engineering, culminating in a project that will serve as an example on how to use molecular tools to answer fundamental physiological questions.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Crop Physiology And Ecology",
        "subjectCode": "AGRY",
        "courseCode": "52500",
        "instructor": [
            "Jeffrey J Volenec"
        ],
        "description": "Study of the physiological basis for growth, yield, and adaptation of crop plants. Topics emphasized include: carbohydrate assimilation and partitioning, nitrogen metabolism, crop growth and development, water relations, stress tolerance, and crop improvement using physiological genetics. Basic background in college level plant biology is recommended.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Environmental Organic Chemistry",
        "subjectCode": "AGRY",
        "courseCode": "54400",
        "instructor": [
            "Linda S Lee"
        ],
        "description": "(EEE 54400) The fundamental properties and processes responsible for the fate of organic chemicals in the environment, with emphasis on soil and water chemistry. Areas to be addressed will include both conceptual and theoretical aspects of processes relevant to environmental fate of contaminants; measurement, estimation, correlation, and application of the parameters most commonly used to assess various chemodynamic properties in soil-water systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Soil And Rhizosphere Microbiology",
        "subjectCode": "AGRY",
        "courseCode": "58000",
        "instructor": [
            "Roland Conrad Wilhelm"
        ],
        "description": "&nbsp;Soils are complex ecosystems that host a diverse array of organisms, which interact with and respond to their environment. This course explores the ecology, evolution, and functions of soil microbes, with a particular focus on their interactions with plants. Through this course, students will gain an understanding of the metabolic processes and life-history strategies of archaea, bacteria, fungi, and viruses in soil, root, and rhizosphere compartments. Students will also survey the microbiomes of diverse soil ecosystems, such as forests, agroecosystems, and grasslands, and learn principles of soil microbiology and biogeochemistry. In addition, students will acquire practical knowledge about the methods used for characterizing microbes in soil and plant systems.&nbsp;&nbsp;",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Soils And Land Use",
        "subjectCode": "AGRY",
        "courseCode": "58500",
        "instructor": [
            "Gary C Steinhardt"
        ],
        "description": "Soils as a resource in development planning; soil properties affecting land use; use of soil survey, aerial photos, topographic maps, and other resource data in land-use allocation; nonengineering aspects of site selection for various land uses, water conservation, waste disposal, and erosion control.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Crop Mgt Drone Flt And Imaging",
        "subjectCode": "AGRY",
        "courseCode": "59800",
        "instructor": [
            "Roland Conrad Wilhelm",
            "Yichao Rui",
            "Lee E Schweitzer"
        ],
        "description": "Research on agronomic problems conducted in laboratory, field, or library; report required; arrange with an agronomy staff member before registering. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Graduate Research",
        "subjectCode": "AGRY",
        "courseCode": "60100",
        "instructor": [
            "Yiwei Jiang"
        ],
        "description": "This course provides framework for graduate studies. It helps the new graduate student understand the roles and responsibilities in graduate education, providing guidance for scientific reading, writing, and research activities. Topics include understanding ethical issues in science, enhancing their ability to communicate with a broad range of people, and establishing initial perspectives on professional development. Permission of department required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Agronomy Graduate Seminar",
        "subjectCode": "AGRY",
        "courseCode": "69600",
        "instructor": [
            "TBA"
        ],
        "description": "Weekly discussion of assigned topics in soil and crop science.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    }
]