[
    {
        "title": "Being Human: Introduction To Anthropology",
        "subjectCode": "ANTH",
        "courseCode": "10000",
        "instructor": [
            "Elizabeth Marie Eklund"
        ],
        "description": "Introduces anthropology's holistic approach to human nature and behavior. This course uses the tools of cultural, biological, archaeological, and linguistic anthropology to follow the human journey of uniformity and diversity through time and across space.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Archaeology And World Prehistory",
        "subjectCode": "ANTH",
        "courseCode": "20100",
        "instructor": [
            "Erik R Otarola-Castillo"
        ],
        "description": "Introduction to the ideas and practices of archaeology that are used in the contemporary study of human prehistory. Emphasis is placed on the social and technological changes that accompanied major turning points in the human past, including the earliest stone tools, the development of farming, through the advent of writing and monumental architecture among ancient states.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Human Origins",
        "subjectCode": "ANTH",
        "courseCode": "20400",
        "instructor": [
            "Melanie M Beasley"
        ],
        "description": "Surveys our evolutionary journey, from fossil primates to modern humans, through a review of evolutionary theory and genetics, the fossil evidence for current theories in human evolution with insight from modern non-human primates, and the influence of environmental stressors on modern human biological variation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Human Cultural Diversity",
        "subjectCode": "ANTH",
        "courseCode": "20500",
        "instructor": [
            "Elizabeth Joan Wirtz"
        ],
        "description": "Offers an engaging introduction to concepts, themes, methods, and ethical concerns that guide research and analysis in cultural anthropology. Students will learn how to identify and interpret the complexities of human culture - what makes cultures different, and in what ways are they more alike than we might assume? Topics include: race and racism; ethnicity and nationalism; gender; sexuality; kinship, family, and marriage; class and inequality; the global economy; politics and power; religion; and health and illness.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Technology And Culture",
        "subjectCode": "ANTH",
        "courseCode": "21000",
        "instructor": [
            "Zoe Nyssa",
            "Elizabeth Marie Eklund"
        ],
        "description": "This course explores the social dimensions of technology from the perspective of ancient, modern, and post-modern society.  Topics include the origins of particular technologies; processes of technical development and dissemination; the politics of everyday artifacts; virtual identities; and technologies of the body. Suggested courses (not pre-requisite): ANTH 10000, 20100 and/or 20500.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Culture, Food And Health",
        "subjectCode": "ANTH",
        "courseCode": "21200",
        "instructor": [
            "Elizabeth Joan Wirtz"
        ],
        "description": "This course is designed to provide an introduction to the field of Nutritional Anthropology in which we will examine issues related to diet, health and illness from holistic anthropological perspectives.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Forensic Anthropology",
        "subjectCode": "ANTH",
        "courseCode": "21500",
        "instructor": [
            "Melanie M Beasley"
        ],
        "description": "Introduction to forensic anthropology, the science that utilizes methods from skeletal biology and archaeology as tools in human identification in a medico-legal context. This course introduces students to methods used to recover and positively identify human remains, and to evaluate trauma and taphonomy in medico-legal situations. Topics include an overview of historical and current developments in the field. Students will develop a comprehensive understanding of the sequential order of applied work from the search for forensic scenes through the recovery of remains, and skeletal analysis in the laboratory.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Gender Across Cultures",
        "subjectCode": "ANTH",
        "courseCode": "23000",
        "instructor": [
            "Risa Denae Cromer"
        ],
        "description": "Explores gender and sexuality from a cross-cultural perspective. Draws on case studies to explore the complexities of women's and men's lives. Examines gender hierarchies, gender in a globalized world, and the cultural construction of sexuality and gender.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Archaeological Hoaxes, Myths And Frauds",
        "subjectCode": "ANTH",
        "courseCode": "25400",
        "instructor": [
            "Ian C Lindsay"
        ],
        "description": "This course examines why the ancient past inspires so many theories about aliens, dark conspiracies, lost civilizations, and apocalyptic predictions. Topics include the popularity of pseudoscientific theories in American culture and the historical contexts in which common pseudoscientific ideas have emerged; why they persist in the face of archaeological evidence; and the role of pseudo-archaeology in the growing antagonism toward scientific expertise. Through an understanding of datasets and methods archaeologists use to evaluate claims about the past, the course goes beyond debunking ancient aliens and Atlantis to develop important critical thinking skills to evaluate evidence and recognize pseudo-scientific arguments in the media.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Archaeology Of Beer",
        "subjectCode": "ANTH",
        "courseCode": "25600",
        "instructor": [
            "Harold Kory Cooper"
        ],
        "description": "Alcoholic beverages are an important aspect of foodways, the cultural practices and values surrounding food and drink. This course provides an overview of the ancient origins of beer and other alcoholic beverages globally, and examines the cultural context and social role of these innovations through a combination of archaeology, material culture studies, historical texts, and ethnography. In addition to examining archaeological case studies of the production and consumption of beer and other alcoholic beverages, topics to be covered include: evolution of brewing and fermenting technology, biology and chemistry of brewing and fermentation, residue and materials analysis, origins of agriculture, emergence of social complexity, sexual division of labor, social identity (gender, class, ethnicity), and recent trends in production and consumption.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Quantitative Methods For Anthropological Research",
        "subjectCode": "ANTH",
        "courseCode": "30600",
        "instructor": [
            "Erik R Otarola-Castillo"
        ],
        "description": "This course provides an introduction to the broad statistical methods used throughout the 4-fields of Anthropology. It covers elementary probability theory, basic concepts of statistical inference and study design. The course will motivate statistical methods through data analysis and visualization. It is designed for students who intend to focus in an anthropological discipline. It would also benefit a variety of students interested in 1) quantitative science literacy and planning for graduate work, 2) joining the workforce and becoming part of the educated citizenry. There are no pre-requisites from the Statistics or Mathematics Departments.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Environment And Culture",
        "subjectCode": "ANTH",
        "courseCode": "32700",
        "instructor": [
            "Elizabeth Marie Eklund"
        ],
        "description": "This course provides a general overview to the field of environmental anthropology, and surveys key methods, and theories that anthropologists use to interpret human-environment interactions. Topics include culture ecology, agroecology, ethnobiology, political ecology, and environmental justice.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Human Variation",
        "subjectCode": "ANTH",
        "courseCode": "33600",
        "instructor": [
            "Michele R Buzon"
        ],
        "description": "Biological differences between human individuals and groups, causes of variations, the role of genetics, concepts of race, and the interrelationship between the social and biological meanings of race will be considered.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Global Perspectives On Health",
        "subjectCode": "ANTH",
        "courseCode": "34000",
        "instructor": [
            "Sherylyn H Briller",
            "Elizabeth Joan Wirtz",
            "Risa Denae Cromer"
        ],
        "description": "This course examines health issues and risks faced by individuals around the world, but especially in resource poor geographical areas. We will explore in-depth the gendered, ethnic, cultural, and class dimensions that underlie the patterning of disease and illness worldwide.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Native American Cultures",
        "subjectCode": "ANTH",
        "courseCode": "37900",
        "instructor": [
            "Harold Kory Cooper"
        ],
        "description": "General survey of Native cultures of the Americas. Topics to be covered include prehistory, language, religion, aesthetics, culture contact and change, contemporary issues, and social, economic and political organization.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Designing For People: Anthropological Approaches",
        "subjectCode": "ANTH",
        "courseCode": "38400",
        "instructor": [
            "Sherylyn H Briller"
        ],
        "description": "This course is about designing for people. You will use anthropological knowledge and skills to better understand human and technology interactions. With students from other fields, you will learn how to apply an anthropological perspective to human centered design and design with the needs of a specific user group in mind.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Colonial Globaln Food Justice",
        "subjectCode": "ANTH",
        "courseCode": "39200",
        "instructor": [
            "Steven G Hallett"
        ],
        "description": "Various topics in anthropology that may change from semester to semester are presented by anthropology faculty members.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Language And Culture",
        "subjectCode": "ANTH",
        "courseCode": "41400",
        "instructor": [
            "Myrdene Anderson"
        ],
        "description": "An exploration into the nature of human communication, particularly the structures, functions, and substance of human language. Focus is on the interpenetration of language, culture and cognition, on the evolution of language and speech, and on their uses in everyday life.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Archaeological Theory",
        "subjectCode": "ANTH",
        "courseCode": "50400",
        "instructor": [
            "Ian C Lindsay"
        ],
        "description": "Focuses on the development of archaeological theory, discussing several theoretical positions and genres of archaeological research. Students gain experience in working with theory in their own research and achieve literacy in archaeological theories.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Culture And Society",
        "subjectCode": "ANTH",
        "courseCode": "50500",
        "instructor": [
            "Kali Rubaii"
        ],
        "description": "Introduces contemporary sociocultural anthropology theory and practices, relating material to anthropology's history and its place in the social sciences. Covers problem formulation, study of cultural change, representation of human cultural diversity, and key case studies.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Semiotics",
        "subjectCode": "ANTH",
        "courseCode": "51900",
        "instructor": [
            "Myrdene Anderson"
        ],
        "description": "(AUSL 58900, COM 50700, ENGL 57000, LC 57000) The study of languages, literatures, and other systems of human communication. Includes a wide range of phenomena which can be brought together by means of a general theory of signs. The course deals with three fundamental areas: 1) verbal communication, 2) nonverbal communication (iconic systems, gestures, body language, etc.), and 3) communication through art forms.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Historical Linguistics",
        "subjectCode": "ANTH",
        "courseCode": "56300",
        "instructor": [
            "John D Sundquist"
        ],
        "description": "( ENGL 56300, LC 56300) A survey of mechanisms and motivations of linguistic change. Topics include: phonological, morphological, semantic and syntactic change, comparative and internal reconstruction, linguistic variation, language contact, and linguistic typology.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Sociolinguistics",
        "subjectCode": "ANTH",
        "courseCode": "56500",
        "instructor": [
            "Felicia D Roberts"
        ],
        "description": "(SLHS 56500, COM 56500, ENGL 56500, LC 56500, LING 56500) An introduction to language in its social context, focusing on uses and users of language. Topics include social class, ethnic group, gender, language attitudes, and bilingualism.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Seminar In Ethnographic Analysis",
        "subjectCode": "ANTH",
        "courseCode": "60500",
        "instructor": [
            "Laura C Zanotti"
        ],
        "description": "Focuses on ethnographic research design, methodology, and ethics, discussing the appropriate selection of any method. Students gain experience with the varieties of ethnographic practice across anthropology and sibling sciences, the generation and analysis of data, and the writing up of ethnographic and of other qualitative research.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Sem-CultANTH:Visual Anthroplgy",
        "subjectCode": "ANTH",
        "courseCode": "62000",
        "instructor": [
            "Dada Docot"
        ],
        "description": "Critical examination of a selected aspect of contemporary cultural anthropology research and theory. Topics will vary from year to year.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Academic Professional Development",
        "subjectCode": "ANTH",
        "courseCode": "63000",
        "instructor": [
            "Michele R Buzon"
        ],
        "description": "This seminar focuses on research design, grant writing, publishing, giving presentations, and the academic job market. As there are other seminars offered in the department that focus on the applied aspects of anthropology, this seminar focuses primarily on academic topics. The substance of the course will come from your own work in the form of proposals, teaching, and job market materials as well as your review of fellow classmates' work.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Discovery And Design: Making Projects Work",
        "subjectCode": "ANTH",
        "courseCode": "64100",
        "instructor": [
            "Zoe Nyssa"
        ],
        "description": "This course is about using anthropology to make projects work. Students will learn anthropological approaches and methods to discover salient aspects of a design problem and use this understanding to devise responses. Anthropological discovery, design and delivery processes are demonstrated. Students should have some background in anthropology if coming from another discipline e.g. prior coursework or relevant experience as determined by instructor.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    }
]