[
    {
        "title": "Introduction To Aviation Technology",
        "subjectCode": "AT",
        "courseCode": "10000",
        "instructor": [
            "Jason E Cutter"
        ],
        "description": "An introduction to the Department of Aviation Technology and its curricula as well as an overview of the aviation industry and associated careers. Aviation safety practices and human factors issues are discussed. An overview of aviation regulations and the regulatory process is included.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Aviation Business",
        "subjectCode": "AT",
        "courseCode": "10200",
        "instructor": [
            "Sen Wang"
        ],
        "description": "A discussion of the financial structure and operation of the aviation industry including aircraft and aerospace design parameters, as well as aviation financial and industrial processes. The course will cover material relevant to the overall structure of the aviation industry including history, current status of aerospace manufacturers, commercial airlines, and general aviation as well as governmental aviation agencies and international aviation. Commercialization of space and current issues in aviation will also be covered.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Aerospace Vehicle Propulsion And Tracking Systems",
        "subjectCode": "AT",
        "courseCode": "10300",
        "instructor": [
            "Jonathon D Ziulkowski"
        ],
        "description": "This course is an introduction to propulsion systems used in aerospace vehicles. The student will learn terminology, component parts, and operational theory of propulsion systems. Course topics covered are reciprocating and turbine engine operation theory as well as rocket propulsion systems. including electrical, fuel, fire, ignition and lubrication. Operational and regulatory fuel requirements are discussed. Emerging technologies and environmental practices will be explored.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Basic Aircraft Science",
        "subjectCode": "AT",
        "courseCode": "10600",
        "instructor": [
            "George Gerard Mitchell"
        ],
        "description": "An introduction to federal regulatory systems and associated publications. Includes aircraft nomenclature, theory of flight, and fundamentals of the aviation industry. Introduces weight and balance procedures. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Aircraft Science For Engineering Technology",
        "subjectCode": "AT",
        "courseCode": "11600",
        "instructor": [
            "George Gerard Mitchell"
        ],
        "description": "Required for AET. This course is an introduction to theory of flight, aircraft nomenclature, aircraft configurations, high speed flight, and helicopter configurations and rotor dynamics. Covers lift/drag and concepts for flight at an engineering technology level beyond that of flight ground school. Federal regulatory systems for aircraft design and persons other than flight personnel and associated technical documents are covered. Introduces center of gravity theory, defines how to locate centers of gravity, and introduces weight and balance procedures for engineering technology, not covered by flight ground school. This course teaches topics in the curriculum required by 14 CFR Part 147 as outlined in the School of Aviation and Transportation Technology's Part 147 Operations Manual approved by the FAA, and provides specific knowledge and skills needed for FAA certification examinations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Unmanned Aerial Systems: Safety And Risk Management",
        "subjectCode": "AT",
        "courseCode": "11901",
        "instructor": [
            "Nathan Tyler Rose"
        ],
        "description": "This course discusses the fundamental concepts of Safety and Risk Management and their application to UAS operations. The course will provide insight into strategies for developing and implementing a formal safety management system (SMS) that effectively supports an organization's UAS operations. In addition, students will gain an understanding of ethical decision making and its relationship to safety. Laboratory exercises provide students practical application of this knowledge to various UAS operational scenarios, which includes utilizing SMS principles in assessing risks and developing appropriate mitigations. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Aerospace Vehicle Systems Design, Analysis And Operations",
        "subjectCode": "AT",
        "courseCode": "20200",
        "instructor": [
            "Jonathon D Ziulkowski"
        ],
        "description": "Introduction to the design and engineering analysis of various systems found on modern aircraft and aerospace vehicles. Operational theory will also be presented for specific aircraft. Systems include electric power distribution, digital data, instrumentation, hydraulic, pneumatic, environmental, flight management, and autoflight.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Aviation Operations Management",
        "subjectCode": "AT",
        "courseCode": "20300",
        "instructor": [
            "Fecri Karanki"
        ],
        "description": "This course provides a forum for investigating contemporary issues facing the aviation and aerospace industries. Major topics include aviation operation, human resources, fiscal, and technology management.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Statics For Aerostructures",
        "subjectCode": "AT",
        "courseCode": "20501",
        "instructor": [
            "Sergey I Dubikovsky"
        ],
        "description": "This course provides an introduction to the static analysis of aerostructures. Force systems, resultants and equilibrium, moments, distributed loads, and centroids as they relate to aeronautical structures are studied. CAD software is introduced.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Aircraft Systems",
        "subjectCode": "AT",
        "courseCode": "20700",
        "instructor": [
            "George Gerard Mitchell"
        ],
        "description": "Principles and design concepts of aircraft operating systems are covered. Emphasis is given to flight control, electrical, environmental, hydraulic, pneumatic, pressurization, oxygen, heating, cooling, fire protection, and ice and rain protection systems. Also included are theory of operation and design of aircraft instruments and associate systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Aircraft Materials",
        "subjectCode": "AT",
        "courseCode": "20802",
        "instructor": [
            "Ashley E Habig"
        ],
        "description": "In this course students study aluminum and composite materials used in aircraft. The course covers elements of design, fabrication, final assembly, and testing. Students also study the practical application of statics for airframe loads.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Unmanned Aerial Systems Design, Build, Test",
        "subjectCode": "AT",
        "courseCode": "21900",
        "instructor": [
            "Nathan Tyler Rose"
        ],
        "description": "This course will further develop skills, and understanding of small aerial systems. Emphasis will be on design, selection, construction, flight test, evaluation, and repair, of stabilized unmanned aircraft. Emphasis will be placed on advancing manual flight control skills utilizing an advanced simulator and student constructed rotorcraft.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Human Factors For Flight Crews",
        "subjectCode": "AT",
        "courseCode": "22300",
        "instructor": [
            "Abner Del Cid Flores"
        ],
        "description": "This course explores the fundamental concepts  of single pilot and multi-crew human factors issues. The first part of the course focuses on the physiological factors that affect single pilot aeronautical decision-making. The second part examines human error, threat and error management, and domains of crew resources management. The third segment utilizes team-building exercises, case study presentations, and a formal assignment to emphasis course learning outcomes.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Instrument Flight Lectures",
        "subjectCode": "AT",
        "courseCode": "24900",
        "instructor": [
            "Debra Henneberry"
        ],
        "description": "A study of the operation of flight instruments and radio navigation aids, federal aviation regulations pertinent to instrument flight, meteorology, instrument charts, instrument flight planning, and air traffic control procedures. Preparation for the FAA Instrument Rating written examination.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Commercial Flight Lectures",
        "subjectCode": "AT",
        "courseCode": "25400",
        "instructor": [
            "Debra Henneberry"
        ],
        "description": "The course is designed to review the principles of flight, aircraft systems, pertinent federal aviation regulations, and airman publications and service in order to prepare the student for the FAA Commercial Pilot written examination.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Basic Aircraft Powerplant Technology",
        "subjectCode": "AT",
        "courseCode": "26200",
        "instructor": [
            "Corben David Meyer"
        ],
        "description": "A study of the design, construction, and operating practices of aircraft reciprocating and small gas turbine engines. Laboratory exercises emphasize airworthiness evaluation, fault-isolation techniques, and standard service/maintenance practices.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Aircraft Electrical Systems",
        "subjectCode": "AT",
        "courseCode": "26502",
        "instructor": [
            "Donald Keith Barnes"
        ],
        "description": "An in-depth study of aircraft electrical components, both individually and as systems in the aircraft. DC electrical circuits, series and parallel circuits, magnetism, and electromagnetism are covered, as are DC power systems, schematics, and aircraft wiring practices. Aircraft charging systems, main power distribution, solid state electronics, batteries, and motors are also discussed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Fixed And Rotary Wing Assemblies",
        "subjectCode": "AT",
        "courseCode": "26700",
        "instructor": [
            "James Mark Thom"
        ],
        "description": "An overview of various fixed and rotary wing components and systems. Flight control systems, landing gear, fuel systems, wheels, brakes, and rotor systems are among the subjects studied.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Composite Technology",
        "subjectCode": "AT",
        "courseCode": "27200",
        "instructor": [
            "Ronald Sterkenburg"
        ],
        "description": "An introduction to basic composite materials, processes, construction, testing, and repair. Students will work with a variety of wet and pre-impregnated fiber and matrix systems including glass, aramid fiber, and carbon-graphite.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Nondestructive Testing For Aircraft",
        "subjectCode": "AT",
        "courseCode": "27800",
        "instructor": [
            "Thomas C Hagovsky"
        ],
        "description": "A study of nondestructive testing methods used to evaluate the structural integrity of airframes, engines, and components. Magnetic particle, liquid penetrant, electromagnetic, ultrasonic, and radiographic inspection are covered.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Career Resource Seminar",
        "subjectCode": "AT",
        "courseCode": "29000",
        "instructor": [
            "Jason E Cutter",
            "Garam Kim",
            "Vicki L Gilbert"
        ],
        "description": "Independent study primarily for sophomore students who wish to pursue study and development work in special areas. Subject material must be arranged with the instructor before enrolling in the course. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Aircraft Systems",
        "subjectCode": "AT",
        "courseCode": "30702",
        "instructor": [
            "Peng Hao Wang"
        ],
        "description": "An in-depth study of aircraft components and operation with an emphasis on transport-category aircraft. Systems covered include fuel, environmental, fluid-power, flight control, fire protection, ice-control, warning, and auxiliary power. Practical projects utilize small ad transport-category aircraft.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Aircraft Materials Processes",
        "subjectCode": "AT",
        "courseCode": "30802",
        "instructor": [
            "Corben David Meyer"
        ],
        "description": "A study of the processes by which aircraft materials are converted into usable components. Laboratory activities include machining, welding, and analysis of material properties.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Unmanned Aerial Systems Applications, Data And Documentation",
        "subjectCode": "AT",
        "courseCode": "31900",
        "instructor": [
            "Joseph P Hupy"
        ],
        "description": "Focused on applying unmanned aerial technology to specific data gathering missions. Sensor types, mounting selection, and control will be demonstrated. Emphasis will be placed on sensor payloads, mission planning, and data acquisition. Post-flight data processing and analysis will be conducted using GIS and Remote Sensing software applications. All specifications and procedures will be documented in an industry-accepted format.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Aviation Operations",
        "subjectCode": "AT",
        "courseCode": "32001",
        "instructor": [
            "Ashley E Habig"
        ],
        "description": "This course covers modern principles for managing complex global aviation maintenance, ground and aerospace manufacturing operations. Particular emphasis is placed on \"system-of-systems\" and organizational resilience concepts in air vehicle lifecycle maintenance, aerospace manufacturing and airport surface/gate operations. Principles of Data Science, systems-thinking, process visualization, emerging technologies and modern workforce challenges and their impact on global sustainable airworthiness, safety, quality and performance reliability are covered in-depth.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Aviation Meteorology",
        "subjectCode": "AT",
        "courseCode": "32501",
        "instructor": [
            "Nathan Tyler Rose"
        ],
        "description": "This course is designed for students who are preparing for careers as professional pilots or dispatchers and require an advanced knowledge of the impact of weather on aviation operations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Transport Flight Operations",
        "subjectCode": "AT",
        "courseCode": "32700",
        "instructor": [
            "Julius C Keller"
        ],
        "description": "This course addresses advanced aviation topics to include high speed aerodynamics, automated cockpit instrumentation, domestic/international flight operations, and global navigation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Avionics Systems",
        "subjectCode": "AT",
        "courseCode": "33502",
        "instructor": [
            "Donald Keith Barnes"
        ],
        "description": "This course covers the theory of operation and applications of common electrical components used in various aircraft circuits.  The theory and mathematical relationships of alternating current, reactance, impedance, and phase shift are examined. Operational theory, installation practices, and troubleshooting concepts of common aircraft communication and navigation systems are investigated.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Airline Management",
        "subjectCode": "AT",
        "courseCode": "33800",
        "instructor": [
            "Yi Gao"
        ],
        "description": "This course is a detailed study of airline management principles and processes. Topics include airline, economics, organization, forecasting, marketing, alliances, pricing, scheduling, finance, fleet planning, labor relations and air freight. Business ethics pertaining to airlines are introduced.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Aerospace Business Statistics",
        "subjectCode": "AT",
        "courseCode": "34001",
        "instructor": [
            "Volodymyr Bilotkach"
        ],
        "description": "This course provides an introduction to business statistics with a specific focus on managerial decision making in the aerospace industry. The course will focus on aircraft leasing and value determination. Topics include descriptive statistics, probability models, estimation, hypothesis testing, and regression analysis. Students use software to perform their own analyses.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Flight Instructor Lectures",
        "subjectCode": "AT",
        "courseCode": "35200",
        "instructor": [
            "Brian G Dillman"
        ],
        "description": "The course teaches techniques of flight and ground instruction, analysis of maneuvers, aircraft performance, and federal aviation regulations applicable to flight instructors. Some practice teaching will be required. Preparation for the FAA written exam is included.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Turbine Flight Operations Lecture",
        "subjectCode": "AT",
        "courseCode": "35400",
        "instructor": [
            "Raymond F Gephart"
        ],
        "description": "A study of corporate aircraft systems and operations and an orientation to operational procedures.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Airport Management",
        "subjectCode": "AT",
        "courseCode": "35900",
        "instructor": [
            "Sarah M Hubbard"
        ],
        "description": "This course is a study of the history and development of contemporary airport facilities. Areas of study will include FAA airport design requirements, master plans, and airport operations. Field trips may be required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Aviation Operations",
        "subjectCode": "AT",
        "courseCode": "36201",
        "instructor": [
            "TBA"
        ],
        "description": "This course introduces students to the principles of managing a complex aviation operation. Students will be assigned active roles in monitoring and reporting on aircraft flight and maintenance practices. Every student will be assigned a role as part of a small group whose responsibility is to gather appropriate information, develop reports, and conduct practical research tasks as assigned. Weekly and monthly group meetings will be conducted similar to those found in the airline industry with students playing an active role in these meetings.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Fundamentals Of Powerplant Systems",
        "subjectCode": "AT",
        "courseCode": "36302",
        "instructor": [
            "Tracy L Yother"
        ],
        "description": "This course covers powerplant systems, including fuel metering devices, ignition systems, and propeller and propeller-related systems. Students learn to use the special tools required for these systems, and the processes for inspection, repair, and overhaul. Airworthiness evaluation and determination is stressed, as are testing and fault diagnosis procedures. The properties and operating characteristics of aircraft fuels are also covered.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Aircraft Maintenance Practices",
        "subjectCode": "AT",
        "courseCode": "37200",
        "instructor": [
            "David W Gouwens"
        ],
        "description": "An in-depth study of practices and procedures used to ensure that an aircraft is maintained in an airworthy state. Aircraft publications and maintenance methodology are emphasized.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Aircraft Gas Turbine Engine Technology I",
        "subjectCode": "AT",
        "courseCode": "37600",
        "instructor": [
            "John M Davis"
        ],
        "description": "Basic aircraft gas turbine engine theory, nomenclature, component design, turbine engine systems, operation, and fault isolation techniques are emphasized. Turbine engine maintenance, overhaul, operation, and inspection procedures are studied in detail.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Aviation Security",
        "subjectCode": "AT",
        "courseCode": "38100",
        "instructor": [
            "Chien-Tsung Lu"
        ],
        "description": "This course introduces the challenges and complexity of aviation security faced by aviation professionals across the industry. It traces the evolution of current security approaches and explores technologies and processes targeting threat mitigation and improved operational efficiency.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Design Support Analysis",
        "subjectCode": "AT",
        "courseCode": "38500",
        "instructor": [
            "James Mark Thom"
        ],
        "description": "This course is designed to teach students interested in engineering design, design support, customer support, or aerospace manufacturing, the elements of product support and the analysis of design as related to the manufacturability, maintainability, and supportability of aerospace products. The students will be expected to complete a life cycle cost analysis and logistics plan for a design.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Large Aircraft Systems",
        "subjectCode": "AT",
        "courseCode": "38800",
        "instructor": [
            "Dimitrios Ziakkas"
        ],
        "description": "This course introduces transport aircraft limitations, systems, and systems operation. Topics include turbojet aircraft powerplants, flight instruments, electrical power, air-conditioning, pressurization, hydraulic, and flight control systems. Emphasis is aircraft and systems manufacturer's design and operational philosophies.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Aviation Finance",
        "subjectCode": "AT",
        "courseCode": "41200",
        "instructor": [
            "Chien-Tsung Lu"
        ],
        "description": "The course will focus on the financial knowledge needed to operate and evaluate aviation businesses. Content will cover the impact of financial decisions on operational outcomes that add/decrease value to an aviation company's bottom line. Case studies will be utilized to demonstrate practical aspects of financial decisions as they relate to organizational performance and profitability.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Airline Indoctrination",
        "subjectCode": "AT",
        "courseCode": "41600",
        "instructor": [
            "Paul B Strickland"
        ],
        "description": "This course provides the background knowledge required to serve as a crewmember operating a transport-category airplane. Topics include aircraft systems, airline operations, and FAR Part 121 regulations.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Unmanned Aerial Systems Capstone",
        "subjectCode": "AT",
        "courseCode": "41901",
        "instructor": [
            "Joseph P Hupy"
        ],
        "description": "The conclusion and demonstration of the cumulative knowledge and skills learned in AT 40900. An application specific autonomous aircraft designed will be constructed and flown within mission specific specifications. Data gathered will be analyzed and documented.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Managerial Economics In Aviation",
        "subjectCode": "AT",
        "courseCode": "42101",
        "instructor": [
            "Volodymyr Bilotkach",
            "Caroline Kathure Marete"
        ],
        "description": "This course explores the process of making managerial decisions based on modern economic principles and concepts, and provides the student with a set of tools that can be used to make those decisions. Marginal analysis, forecasting, and cost analysis concepts are introduced, as are game-theoretic and probabilistic decision-making models. Bargaining strategies and linear programming tools are covered, as well.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Aircraft Electronics",
        "subjectCode": "AT",
        "courseCode": "44502",
        "instructor": [
            "Donald Keith Barnes"
        ],
        "description": "A study of the computer-based electronic systems used to control both flight and engine parameters on modern aircraft. The course examines the various systems with an emphasis on how each component integrates into the electronic structure of the aircraft.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Airport Manager Certification",
        "subjectCode": "AT",
        "courseCode": "45900",
        "instructor": [
            "Adam W Baxmeyer"
        ],
        "description": "This course prepares students for the certified manager exam offered by the American Association of Airport Executives (AAAE). This certificate is the first step toward industry accreditation as an airport manager and director.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Composite Technology",
        "subjectCode": "AT",
        "courseCode": "47200",
        "instructor": [
            "Garam Kim"
        ],
        "description": "Students will perform a variety of fabrication, testing, and repair tasks using specialized composite fibers, matrices, and core materials.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Aviation Law",
        "subjectCode": "AT",
        "courseCode": "47500",
        "instructor": [
            "Manoj S Patankar",
            "Michael Wayne Suckow"
        ],
        "description": "A study of the fundamental legal and aviation law principles as they apply to the various participants in the aviation industry. Special emphasis is placed on contemporary aviation law issues such as pilot, flight instructor, and mechanic liability; product liability; and aviation insurance.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Aircraft Gas Turbine Engine Technology II",
        "subjectCode": "AT",
        "courseCode": "47600",
        "instructor": [
            "John M Davis"
        ],
        "description": "This is a study of turbofan engines and systems. Engine installation, testing, and operational procedures are stressed. Emphasis is placed on performance evaluation, data calculations, and predictions of operational properties. Turbofan design theory, operational efficiencies, and fault isolation are discussed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Aviation Project",
        "subjectCode": "AT",
        "courseCode": "49000",
        "instructor": [
            "Thomas C Hagovsky"
        ],
        "description": "Independent study for junior and senior students who wish to pursue study and developmental work in special areas. Subject matter must be arranged with the instructor before enrolling in the course. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Aircraft Airworthiness Assurance",
        "subjectCode": "AT",
        "courseCode": "49200",
        "instructor": [
            "Timothy D Ropp"
        ],
        "description": "&nbsp; Students apply foundational airworthiness assurance principles from the aviation and aerospace industries, performing maintenance and inspection tasks on the school’s large transport category laboratory aircraft. They research OEM data to develop and test air vehicle work instructions, incorporating modern maintenance and inspection practices like MSG-3, Reliability Centered Maintenance, and global Safety and Quality standards and Industry 4.0 data science frameworks relating to air vehicle maintenance. They also practice essential participative team and leadership competencies, taking on leadership roles with their laboratory peers as technical team members in a live airport ramp environment.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Capstone Project Proposal",
        "subjectCode": "AT",
        "courseCode": "49401",
        "instructor": [
            "Michael Wayne Suckow"
        ],
        "description": "Students will study all aspects of a possible capstone project and will develop a proposal for conducting an applied research project.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Applied Capstone Research Project",
        "subjectCode": "AT",
        "courseCode": "49501",
        "instructor": [
            "Michael Wayne Suckow"
        ],
        "description": "Students will complete the applied capstone project defined in AT 49401.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Applied Research Proposal",
        "subjectCode": "AT",
        "courseCode": "49600",
        "instructor": [
            "Timothy D Ropp"
        ],
        "description": "&nbsp; Students perform a structured analysis of an industry-based problem or design challenge, producing a professionally written project proposal. Students engage all aspects of a product or process engineering design proposal including problem analysis, identifying design requirements, conceptualizing, and communicating a solution. Students incorporate rigorous research and industry methodologies like Quality Functional Deployment, Failure Mode and Effects Analysis, literature reviews, and project cost/ROI estimates to create and defend a written project proposal.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Applied Research Project",
        "subjectCode": "AT",
        "courseCode": "49700",
        "instructor": [
            "Timothy D Ropp"
        ],
        "description": "&nbsp; Students transform their product/process design proposal created in the proposal design course into a requirements-driven, functional product. During design, they employ rigorous R&amp;D criteria and metrics, global quality, safety, and other industry-based standards, tracking and reporting project development using Technology Readiness Level criteria. For deployment and test phases they incorporate human subject certification, protocols, and develop user-test measures using quantitative and qualitative analysis. The course deliverable is a final written report and functional project demonstration/presentation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Aviation Technology Capstone",
        "subjectCode": "AT",
        "courseCode": "49800",
        "instructor": [
            "Tzu-Chun Chou"
        ],
        "description": "The Aviation Technology Capstone course encourages teamwork in small groups on a substantial project. The intent of this course is to provide a capstone experience that integrates the material and previous experience of the student's curriculum. It also provides an opportunity for students to recognize and evaluate the interrelationship of their general education courses with the courses taken for their major.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Research Methods In Aviation",
        "subjectCode": "AT",
        "courseCode": "50500",
        "instructor": [
            "Sarah M Hubbard"
        ],
        "description": "This course explores the practical approach to research as it applies to identifying and exploring pragmatic problems in aviation industry settings. Industry based problems and issues often require a diversity of research skills, both quantitative and qualitative, in order to effectively address dynamic problems in complex and often high-risk work environments. This course offers an overview of mixed research methods which lends itself well to practical problem solving in industry. This course may also be offered in an online format. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Quantitative Research Methodologies In Transportation",
        "subjectCode": "AT",
        "courseCode": "50700",
        "instructor": [
            "Sergey I Dubikovsky"
        ],
        "description": "This course provides an introduction to business statistics with a specific focus on data analyses and managerial decision making in the transportation industry. Topics include descriptive statistics, probability models, estimation, hypothesis testing, and regression analysis. Students use software to perform their own analyses. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Process Improvement And Simulation",
        "subjectCode": "AT",
        "courseCode": "52500",
        "instructor": [
            "John H Mott"
        ],
        "description": "This course explores process modeling and simulation as applied to decision-making for process design and improvement. Emphasis is placed on understanding the application of process simulations to business problems including using fundamental statistical methods in the solution of an industry relevant problem. By planning and executing a computer-based simulation supporting an aviation or aerospace process design and improvement project, students improve analysis and project management skills. In addition to simulation, preparing visualizations of the process is also included for increased understanding of process interactions.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Aviation Leadership",
        "subjectCode": "AT",
        "courseCode": "52600",
        "instructor": [
            "Tracy L Yother"
        ],
        "description": "This course is intended for future aviation and aerospace managers. Using foundational readings, case studies, and critical analysis techniques, the contribution of past and contemporary aviation leaders will be reviewed. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Management And Design Of Training Systems",
        "subjectCode": "AT",
        "courseCode": "52800",
        "instructor": [
            "Jason E Cutter"
        ],
        "description": "This course will examine the practical applications of managing the training process in industry and educational settings, including the development of instructional materials from an adult learner perspective. Curriculum design using various forms of media and delivery strategies will be emphasized. This course may also be delivered in an online format. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Contemporary Issues In Transportation Security",
        "subjectCode": "AT",
        "courseCode": "53200",
        "instructor": [
            "Stewart W Schreckengast"
        ],
        "description": "This course provides extensive multi-modal transportation security experience. Students will receive detailed information on air, maritime, rail, mass transit, trucking and oil pipeline security programs, as well as applicable threat mitigation processes. Completion of an undergraduate course in either aviation law or aviation security is recommended. This course may be applicable to undergraduates with appropriate experience and background in aviation or other transportation systems. There are no citizenship or security clearance requirements for this course.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Airline Revenue Management",
        "subjectCode": "AT",
        "courseCode": "54700",
        "instructor": [
            "Yi Gao"
        ],
        "description": "This course aims to provide students with experience in airline revenue management applications. Primarily focusing on the commercial operation of airlines, this course covers various contemporary topics such as the segmentation, inventory control, forecasting, budgeting and pricing. This course will use simulations to enhance the overall learning-teaching experience.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Aircraft Leasing",
        "subjectCode": "AT",
        "courseCode": "54900",
        "instructor": [
            "Volodymyr Bilotkach"
        ],
        "description": "This course provides students with training and experience managing aircraft leases using financial and risk management methodologies specific to the airline and business aviation industries. Students conduct financial evaluations of leasing versus ownership programs of airlines, as well as analyze debt, equity and capital markets for aircraft financing. The course includes an examination of taxation issues related to aircraft leasing, maintenance reserves, and auditing of aircraft financial performance. The prerequisite for this course is AT 54800.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Managing The Risk Of Organizational Accidents",
        "subjectCode": "AT",
        "courseCode": "57300",
        "instructor": [
            "Chien-Tsung Lu"
        ],
        "description": "Examines strategies various industries use to assess the risk of organizational accidents and to develop safety management programs to prevent, capture, and recover from conditions that lead to disastrous outcomes. Strategies such as High Reliability Organizations, Operational Risk Management, Behavioral Based Safety, Tripod Delta, and Safety Cultures are explored as successful methods for improving organizational safety in high-risk environments and endeavors. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Aviation And Aerospace Sustainability",
        "subjectCode": "AT",
        "courseCode": "64000",
        "instructor": [
            "Mary E Johnson"
        ],
        "description": "This course explores sustainability as applied to aviation and aerospace industries and agencies, both in the private sector and public sector. Emphasis is placed on understanding aviation and aerospace sustainability academic literature and on connecting the global and national policies that lead to the regulations and practices. Aviation sustainability is comprised of multiple areas of impact such as economic, environmental, operational, and social. Students develop an understanding of existing sustainability assessment frameworks such as GRI that have general sustainability assessments along with specialized aviation industry frameworks. Using a multiple attribute analysis approach, students develop metrics and analyze the potential impact of sustainability initiatives in the aviation and aerospace industry. Prerequisites: STAT 30100 or STAT 31100 or STAT 50100 or STAT 51100 or IT 50700 or an instructor-approved statistical foundations course. Proficiency in statistical foundations is required to understand and evaluate environmental, economic and social sustainability data, information and methods presented in this course.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    }
]