[
    {
        "title": "Life Cycle Engineering And Management Of Constructed Facilities",
        "subjectCode": "CEM",
        "courseCode": "20100",
        "instructor": [
            "Theodore J Weidner"
        ],
        "description": "This course introduces concepts relating to the engineering and construction of facilities throughout their life cycle. Topics that will be explored include the nature of the construction industry, construction contracts, legal and management organization of construction companies, basics of the design and construction process, as well as an introduction to the role of estimating and project scheduling. Cost, time, safety and quality concepts of construction management relationships will also be discussed. Prerequisite: First Year Engineering Curriculum must be completed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Foundations Of Architectural Design",
        "subjectCode": "CEM",
        "courseCode": "35100",
        "instructor": [
            "Geoffrey H Graff"
        ],
        "description": "Contemporary humans spend most of our time directly engaging with architecture; it is the context in which we live our lives.  This course introduces the demands ('tasks') and methods ('tools') inherent to the practice of architectural design. In other words, the problems architects address through design and the ways in which they do so. These two sets of topics are presented in tandem through historical and contemporary examples, along with selected case-studies and readings. Success in the course will provide a foundation for richly experiencing, critically assessing, and productively engaging the development of our built environment.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Critical Thinking In Construction Engineering",
        "subjectCode": "CEM",
        "courseCode": "40100",
        "instructor": [
            "Theodore J Weidner"
        ],
        "description": "&nbsp; This course introduces the concepts of critical thinking and why acting in our 'comfort zone' can result in discomfort. Students will explore a number of simulated and actual problems that challenge understanding of the situation and require additional investigation or analysis. Problems will cover the entire building life-cycle from development of a project plan, through design, project risk analysis for bidding, controlling the project, project recovery, and project handover. Guest speakers will present examples of projects where critical thinking was applied to resolve project issues or avoid a significant error.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Construction Engineering Capstone II",
        "subjectCode": "CEM",
        "courseCode": "42502",
        "instructor": [
            "Brandon M Fulk"
        ],
        "description": "The capstone senior design course for construction engineering and management majors. Working in teams in a realistic engineering practice environment, students use an actual construction project to accomplish open-ended project planning and systems design. Course covers construction project strategy, cost estimating and bidding, constructability analysis, project scheduling, contract conditions, project organization, site analysis and development, safety and quality management, and information systems design. Comprehensive written submittals and oral presentations require integration of knowledge gained in previous courses and in construction internships.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Design-Build Project Delivery Method For Engineers",
        "subjectCode": "CEM",
        "courseCode": "45600",
        "instructor": [
            "Geoffrey H Graff"
        ],
        "description": "This course presents traditional project delivery methods and contrasts them with design-build project delivery. The course focuses on the principles, tools, and procedures used in the design-build project delivery method. It provides students with sufficient education to become certified (following additional examination) by the Design Build Institute of America as an Associate Member and dependent on employment experience, a full Member. Traditional project delivery methods, Design-Bid-Build, Construction Manager as Agent, `Fast Track', and other `rip and read' methods are losing popularity to project delivery methods that take a more collaborative approach. Collaboration requires a different way of thinking about a capital construction project and working with others in project delivery. Constructors must move from a transactional, arms-length relationship where the project is viewed as a low-price commodity to a full-suite delivery of services resulting in a high-value product. This requires collaboration with the Owner and other members of the project delivery process, something that has been missing from traditional project delivery methods. Active student participation is required. Student participation will be facilitated through assigned presentations, in-class projects, field trips to local projects, and guest lectures. Students who complete the course and achieve DBIA's minimum requirements (Fundamentals of Project Delivery, Principles of Design-Building Project Delivery, Post Award, and Contracts &amp; Risk Management) will be eligible for recognition by DBIA.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Inland Navigation Engineering",
        "subjectCode": "CEM",
        "courseCode": "45700",
        "instructor": [
            "Victor P Gervais"
        ],
        "description": "This course teaches detailed elements of Inland Navigation Structures, primarily in the United States. Students will become familiar with how waterways are conceived, planned, designed and constructed. Engineering Design Manuals for Locks and Dams will be reviewed. A primary focus will be on a new Corps of Engineers Lock and Dam currently under construction. The students will thoroughly review the Plans and Specifications as well as Construction Photos and Videos taken during construction. Various marine construction equipment and techniques will be presented.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Legal Aspects Of Construction Engineering",
        "subjectCode": "CEM",
        "courseCode": "48500",
        "instructor": [
            "Nathaniel Stephen Harvey"
        ],
        "description": "This course will cover legal principles and landmark cases relevant to civil and construction engineering. Specific subjects covered include contracts, torts, agency, professional liability, labor laws, insurance, expert testimony, arbitration, patents and copyrights, sureties and ethics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Underground Space Dev",
        "subjectCode": "CEM",
        "courseCode": "59700",
        "instructor": [
            "David Thomas Iseley"
        ],
        "description": "This course will allow CEM to develop and test new courses for graduate level delivery. Possible courses include:  Robotics in Construction; Tunneling; Process Plant Construction; Waterway Engineering; Construction Visualization; Remote Monitoring and Inspection; Cost/Benefits of Planning Details; Heavy Construction Innovation; Site Pollutant Reduction &amp; Control; Statistical Methods in Construction; Infrastructure Decay Mechanisms; Time Buffers and Task Durations; BIM Tools and Applications; Sustainable Construction Methods; Construction Operations &amp; Productivity; Construction Accounting; and Construction Leadership.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    }
]