[
    {
        "title": "Introduction To Construction Management",
        "subjectCode": "CM",
        "courseCode": "10000",
        "instructor": [
            "Anthony E Sparkling"
        ],
        "description": "This course is a survey of the construction industry. Topics include the overall construction process, career opportunities in the construction industry, an introduction to construction materials as well as management and technology tools used in the industry. There will be an emphasis on construction specific vocabulary.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Construction Management Fundamentals",
        "subjectCode": "CM",
        "courseCode": "15000",
        "instructor": [
            "Jason Lawrence Merchant"
        ],
        "description": "An introductory course dealing with construction materials and methods, contracts, and layout of basic commercial, residential, heavy/civil, and industrial projects. Students will acquire fundamental skills in quantity estimating, construction plan reading, project layout, and project documentation through hands-on laboratory experiences.",
        "capacity": 0,
        "credits": [
            6,
            6
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Graphics For Civil Engineering And Construction",
        "subjectCode": "CM",
        "courseCode": "16400",
        "instructor": [
            "Clark A Cory"
        ],
        "description": "An introductory course in the area of computer graphics documentation for civil engineering- and construction-related professions. Experiences focus on accepted industry graphic standards and their technical visual applications. The course emphasizes creation and distribution of graphics to enable communication.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Intermediate Pre-Construction Management",
        "subjectCode": "CM",
        "courseCode": "20001",
        "instructor": [
            "Yunfeng Chen"
        ],
        "description": "A project course covering intermediate level commercial, residential, heavy/civil, and industrial construction projects. Students will expand their understanding of construction company management, design, cost, project controls, and safety.",
        "capacity": 0,
        "credits": [
            6,
            6
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Intermediate Construction Management",
        "subjectCode": "CM",
        "courseCode": "25000",
        "instructor": [
            "Zeljko Marko Torbica"
        ],
        "description": "A project course covering intermediate level commercial, residential, heavy/civil, and industrial construction projects. Students will expand their understanding of construction materials and methods, layout, documentation, site planning, site supervision, cost control, and MEP systems.",
        "capacity": 0,
        "credits": [
            9,
            9
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Modeling For BIM",
        "subjectCode": "CM",
        "courseCode": "26000",
        "instructor": [
            "Sarah J George"
        ],
        "description": "This is an introduction to the materials and processes used when generating 3D modeled solutions to construction problems using traditional and emerging construction documentation standards. Construction documents are created based on current Architectural, Engineering and Construction (AEC) standards with a focus on residential settings - introduction sketching into 2D documentation that will progress into 3D modeling.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Pre-Construction Management",
        "subjectCode": "CM",
        "courseCode": "30001",
        "instructor": [
            "James L Jenkins"
        ],
        "description": "A project course covering advanced level commercial, residential, heavy/civil, and industrial construction projects. Students will further develop their understanding of construction company management, design, cost, project controls, and safety.",
        "capacity": 0,
        "credits": [
            6,
            6
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Design And Construction I",
        "subjectCode": "CM",
        "courseCode": "33000",
        "instructor": [
            "Luciana De Cresce El Debs"
        ],
        "description": "A course which introduces students to projects and the design information of the built environment as communication tools representing space and proportion. Through a blend of lectures and studio work, students obtain working knowledge of the traditions, documents and standards utilized in the planning for a built structure. Students will also experience how design decisions and programing are influenced by a multitude of outside influences.",
        "capacity": 0,
        "credits": [
            6,
            6
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Design And Construction II",
        "subjectCode": "CM",
        "courseCode": "33100",
        "instructor": [
            "Bryan J Hubbard"
        ],
        "description": "A course where students exert criticism and evaluation of existing design through a blend of lectures and studio work. Students will be exposed to typical impediments to the design of the built environment as they demonstrate integrative decision making in creating an aesthetic and functional design program that meet the needs of society in a resource efficient and sustainable manner. Students will regularly critique the work of others and have their work critiqued as they seek to shape and implement informed design decisions.",
        "capacity": 0,
        "credits": [
            6,
            6
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Construction Management",
        "subjectCode": "CM",
        "courseCode": "35000",
        "instructor": [
            "Christopher S Allison"
        ],
        "description": "A project course covering advanced level commercial, residential, heavy/civil, and industrial construction projects. Students will further develop their understanding of construction materials and methods, layout, documentation, site planning, site supervision, cost control, and MEP systems.",
        "capacity": 0,
        "credits": [
            9,
            9
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Applications Of Construction Documentation I",
        "subjectCode": "CM",
        "courseCode": "36000",
        "instructor": [
            "Clark A Cory"
        ],
        "description": "Standards applied to the creation and distribution of documentation within the construction enterprise. Construction documents are created as products of a computer model. Residential modeling is followed by an introduction to light commercial documentation. Topics include a study of blueprint reading and 5D building information modeling (BIM) estimation of material extracted from a model.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Heavy Civil Construction Management",
        "subjectCode": "CM",
        "courseCode": "37000",
        "instructor": [
            "Bryan J Hubbard"
        ],
        "description": "&nbsp; This course will focus on the construction of roads, bridges, and other major transportation-related infrastructure. Topics include construction&nbsp;of concrete pavements, asphalt pavements, deep foundations, and underground utilities.&nbsp;Management of traffic, road construction safety, quality&nbsp;and master planning will also be covered. &nbsp;",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Healthcare Construction Management",
        "subjectCode": "CM",
        "courseCode": "37300",
        "instructor": [
            "Bradley L Benhart"
        ],
        "description": "&nbsp; This course will focus on the construction of healthcare&nbsp;facilities and include topics related to&nbsp;infectious materials control, disruption avoidance, rapid technology changes, emergency routes, and advanced mechanical and electrical systems.&nbsp;",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Mechanical And Electrical Construction Management II",
        "subjectCode": "CM",
        "courseCode": "37500",
        "instructor": [
            "Anthony E Sparkling"
        ],
        "description": "This course will focus on an in-depth investigation of the elements of mechanical, electrical, and plumbing (MEP) construction on real-world projects. The student will be involved in investigating the equipment and components for the MEP systems and selecting the optimum project delivery method. Estimating will include topics such as solar arrays, EV charging, electrical vehicle charging station projects, smart grids, and energy conservative strategies and equipment. Cost saving strategies will also be examined for MEP system installations utilizing Building Information Modeling (BIM), pre-fabrication, and value engineering.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Residential Construction Management Design-Build",
        "subjectCode": "CM",
        "courseCode": "37700",
        "instructor": [
            "Mark D Zimpfer"
        ],
        "description": "A study of the design-build project delivery system for residential construction, including home design fundamentals, construction methods, disability code requirements, building code requirements, and aging-in-place design coupled with best practices of universal design.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Construction Work Experience I",
        "subjectCode": "CM",
        "courseCode": "39000",
        "instructor": [
            "Steven Glenn Habben"
        ],
        "description": "This course shall be taken when approximately half of a student's required 800 hours of work experience within the construction industry are completed. Students will be required to share their experiences with faculty and other construction management students. Permission of department required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Construction Capstone I",
        "subjectCode": "CM",
        "courseCode": "40000",
        "instructor": [
            "Bradley L Benhart"
        ],
        "description": "A project course covering specialized construction projects related to a student's area of concentration within the construction management program. Students will synthesize their previous knowledge of pre-construction management into a capstone project.",
        "capacity": 0,
        "credits": [
            6,
            6
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Structural Demolition For Construction Managers",
        "subjectCode": "CM",
        "courseCode": "42200",
        "instructor": [
            "Randy R Rapp"
        ],
        "description": "&nbsp; Introductory topics in demolition and reconstruction management: situations requiring structural demolition and its effect; protocols, equipment, and techniques of structural demolition; and project and business management practices and imperatives of structural demolition contractors.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Construction Capstone II",
        "subjectCode": "CM",
        "courseCode": "45000",
        "instructor": [
            "Mark D Zimpfer"
        ],
        "description": "A project course covering specialized construction projects related to a student's area of concentration within the construction management program. Students will synthesize their previous knowledge of construction management into a capstone project.",
        "capacity": 0,
        "credits": [
            6,
            6
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Building Information Modeling For Commercial Construction",
        "subjectCode": "CM",
        "courseCode": "46000",
        "instructor": [
            "Clark A Cory"
        ],
        "description": "The study of commercial jobsite planning and coordination. Trade coordination, visualization, and communication are emphasized. Activities include collision detection reports, construction animations, and professional presentations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Construction Work Experience II",
        "subjectCode": "CM",
        "courseCode": "49000",
        "instructor": [
            "Steven Glenn Habben"
        ],
        "description": "This course completes a student's required 800 hours of work experience within the construction industry. Students will be required to share their experiences with faculty and other construction management students. Permission of department required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Topics In Environmentally Sustainable Construction, Design And Development",
        "subjectCode": "CM",
        "courseCode": "51000",
        "instructor": [
            "TBA"
        ],
        "description": "This course explores environmental sustainability in all its forms, starting with the historical and theoretical basis and continuing through an understanding of sustainable building construction, design, development, and renewable energy strategies/management tools and how these can be applied in practice.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Risk Management In Construction",
        "subjectCode": "CM",
        "courseCode": "55000",
        "instructor": [
            "Emad Elwakil"
        ],
        "description": "Analysis of the depth and breadth of risk in construction. Defining key terms and concepts used in various risk management arenas - legal statutes, precedent and case studies relevant to construction risk management, insurance, and surety bonding. Subjects include:  contracts, torts, insurance, surety, safety laws, quality, and risk management models. Analysis of case studies to utilize risk management tools and identify issues and possible approaches. Project risk control including management of foreseeable hazards as well as unforeseen conditions.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    }
]