[
    {
        "title": "Modern Dance Technique I",
        "subjectCode": "DANC",
        "courseCode": "10100",
        "instructor": [
            "Holly A Jaycox"
        ],
        "description": "An introduction to the techniques and principles of modern dance.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Ballet I",
        "subjectCode": "DANC",
        "courseCode": "10200",
        "instructor": [
            "Petre G Iliev"
        ],
        "description": "An introduction to the techniques and principles of classical ballet.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Jazz Dance I",
        "subjectCode": "DANC",
        "courseCode": "10300",
        "instructor": [
            "Petre G Iliev"
        ],
        "description": "An introduction to the principles of jazz dance techniques: alignment, isolations, rhythmic patterns, and basic locomotion.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Modern Dance Technique II",
        "subjectCode": "DANC",
        "courseCode": "20100",
        "instructor": [
            "Kathleen M Hickey"
        ],
        "description": "A continuation and refinement of the modern dance techniques and principles addressed in DANC 10100.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Ballet II",
        "subjectCode": "DANC",
        "courseCode": "20200",
        "instructor": [
            "Petre G Iliev"
        ],
        "description": "A continuation of the principles and techniques of classical ballet addressed in DANC 10200.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Jazz Dance II",
        "subjectCode": "DANC",
        "courseCode": "20300",
        "instructor": [
            "Kathleen M Hickey"
        ],
        "description": "A continuation and refinement of the jazz dance concepts and movement vocabulary addressed in DANC 10300.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Contact Improvisation",
        "subjectCode": "DANC",
        "courseCode": "26100",
        "instructor": [
            "Holly A Jaycox"
        ],
        "description": "This course is both a physical practice and philosophical exploration of the techniques and underlying premise of this contemporary partner dance form. CI training involves a practice of movement improvisation while developing the body's ability to attend to the effects of gravity, muscle tone, and anatomical structures on dancing solo and in partnership. While increasing their body awareness, respect, sensitivity and connection, students learn about collaborative community creativity, which can be applied in other settings including design, performance, and social activism. DANC 26000 is a good preparation for this course, but not required. Course may be repeated for credit.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Modern Dance Techniques III",
        "subjectCode": "DANC",
        "courseCode": "30100",
        "instructor": [
            "Renee L Murray"
        ],
        "description": "A continuation and refinement of the modern dance techniques and principles addressed in DANC 20100. Emphasis placed on expressive qualities of movement.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "The Art Of Protest: An Examination Of The Role Of Arts, Artists, Activism, &amp; Social Transformation",
        "subjectCode": "DANC",
        "courseCode": "37900",
        "instructor": [
            "Kathleen M Hickey"
        ],
        "description": "Throughout history, art has been used to advocate for political movements and provoke social action and transformation. This course examines the role of the arts and the artist and their relationship to activism throughout history and beyond. We will investigate how art has been used as a tool to transform cultural perspectives, alter policies, and promote social change. We will explore a range of artists whose methodologies, materials and approach challenge the cultural norms. From printmakers to musicians, to choreographers, to performance artists, students will engage and evaluate the act of art-making as a tactic of resistance and the responses to those acts. We will investigate readings that argue for and against the need for artists to make work that politically challenge their society. Once a foundation of knowledge has been laid, we will turn to the creative process through an investigation of materials and practices - performance, mixed media, and photography. Students will research, watch, discuss, create, and perform their own projects that promote social transformation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    }
]