[
    {
        "title": "Planet Earth",
        "subjectCode": "EAPS",
        "courseCode": "10000",
        "instructor": [
            "Marissa Marie Tremblay"
        ],
        "description": "An introduction to the Geosciences-Earth science, oceanography, atmospheric science and astronomy. The course emphasizes topics (earthquakes, volcanoes, ocean pollution, climate change, severe weather, etc.) that are of general interest and relevance, and the interconnections between various Earth processes. CTL:IPS 1730 Earth Science",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Oceanography",
        "subjectCode": "EAPS",
        "courseCode": "10400",
        "instructor": [
            "Greg M Michalski"
        ],
        "description": "Origin of the oceans and marine life. Seafloor spreading and marine geology; currents, waves, and tides; marine organisms and ecology; beaches and nearshore life. Man's use and abuse of the sea, including contemporary problems and future opportunities. The role of oceans in climate and evolution of the biosphere.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "The Planets",
        "subjectCode": "EAPS",
        "courseCode": "10500",
        "instructor": [
            "Andrew M Freed"
        ],
        "description": "&nbsp; This course is designed for science and non-science majors alike to learn about the origin and characteristics of the bodies in our Solar System, including planets, moons, asteroids, comets, exoplanets beyond, and the search for extraterrestrial life. We'll discuss how solar systems form and die, the origin of the terrestrial versus giant planets and their orbits, the evolution of planetary surfaces due to asteroid impacts and volcanism, the development of atmospheres, the formation of planetary rings, the origin of moons, the hazards of space travel, and why Pluto IS a planet.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Geosciences In The Cinema",
        "subjectCode": "EAPS",
        "courseCode": "10600",
        "instructor": [
            "Andrew M Freed"
        ],
        "description": "&nbsp; This course is designed for science and non-science majors alike to learn about natural hazards based on the depictions of such hazards in movies. Topics include earthquakes, tsunamis, volcanoes, tornadoes, hurricanes, climate change, asteroid impacts, space exploration, and wildfires. The course focuses on the accuracy of the depiction of natural hazards in the movies, the underlying processes that control their formation and the dangers they represent, how they influence society, and how students can prepare for them and keep themselves safe.&nbsp;&nbsp;&nbsp;",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "The Dynamic Earth",
        "subjectCode": "EAPS",
        "courseCode": "10900",
        "instructor": [
            "Greg M Michalski"
        ],
        "description": "This course covers the formation and development of the solid earth, atmosphere, hydrosphere, and bio-sphere. The course studies the whole earth as a system of many interacting parts and focuses on the changes within and between these parts. This course is intended for all majors in earth and atmospheric sciences.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Physical Geology",
        "subjectCode": "EAPS",
        "courseCode": "11100",
        "instructor": [
            "Saad S B Haq"
        ],
        "description": "Geologic processes and the development of land forms. Laboratory covers the study of minerals and rocks, the interpretations of topographic and geologic maps, and field investigations. CTL: Physical Geology.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Earth Through Time",
        "subjectCode": "EAPS",
        "courseCode": "11200",
        "instructor": [
            "Roger Nicholas Bryant"
        ],
        "description": "The history of the planet Earth from its beginnings to the present. This course will explore the causes and effects of processes that have changed the Earth's surface and subsurface through time, the impacts of these changes on the evolution of life, and how scientist interpret Earth history from the geologic record. The laboratory will provide hands-on experience in interpreting various geologic and fossil records. This course may be taken on its own, or as a year-long lab series with EAPS 11100.  EAPS 11100 and EAPS 11200 will fulfill the two course sequence laboratory experience outside the major department.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Environmental Science And Conservation",
        "subjectCode": "EAPS",
        "courseCode": "12500",
        "instructor": [
            "John B Dunning"
        ],
        "description": "(AGRY 12500, FNR 12500, NRES 12500) Introduction to environmental science and conservation includes topics in ecological principles, conservation and natural resource management, human impacts on the environment, toxic waste disposal, climate change, energy, air and water pollution, environmental geology and geologic hazards.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Thunderstorms And Tornadoes",
        "subjectCode": "EAPS",
        "courseCode": "13800",
        "instructor": [
            "Andrea Elise Orton"
        ],
        "description": "Not open to juniors and seniors majoring in atmospheric science. An elementary treatment of the physical structure of the atmosphere and the dynamical conditions that lead to the development of convective clouds, thunderstorms, and severe weather (including tornadoes, hail, wind, rain, lightning, and flash floods). This course will also focus on storm climatology, the socioeconomic impact of severe weather, as well as prediction, detection, warnings, and safety procedures. Analysis of severe weather events will include tornado movies and case studies of ground/aerial surveys of storm damage.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Applied Planetary Science",
        "subjectCode": "EAPS",
        "courseCode": "19100",
        "instructor": [
            "Briony H Horgan"
        ],
        "description": "Introductory special topics in earth and atmospheric sciences. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Water World: Processes And Challenges In Global Hydrology",
        "subjectCode": "EAPS",
        "courseCode": "20000",
        "instructor": [
            "Marty D Frisbee"
        ],
        "description": "Introduction to the Hydrological Sciences designed for undergraduate students. Course uses an Earth-systems approach to emphasize the interconnections and feedback between the hydrosphere, geosphere, biosphere, and atmosphere. Course topics will include: global water-balance, techniques for measuring components of the water-balance, hydrological uncertainties, groundwater, surface-water, vadose zone, forest and watershed hydrology, global change hydrology, human and climate impacts on water resource, and water on the worlds.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Survey Of Atmospheric Science",
        "subjectCode": "EAPS",
        "courseCode": "22100",
        "instructor": [
            "Andrea Elise Orton"
        ],
        "description": "(NRES 23000) An introductory course for both science and non-science students. A general study of the atmosphere, basic meteorological principles, and weather systems. Relationships of the changing atmosphere to climate ozone depletion, and other contemporary issues.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Earth Materials II",
        "subjectCode": "EAPS",
        "courseCode": "24400",
        "instructor": [
            "Michael Patterson Eddy"
        ],
        "description": "The study of common igneous, sedimentary, and metamorphic rocks. The origin and occurrence of rocks, weathering, and alteration processes. Prior course work in earth materials or mineralogy is required.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Earth Systems Science For Elementary Teachers",
        "subjectCode": "EAPS",
        "courseCode": "31201",
        "instructor": [
            "Dean M Ballotti"
        ],
        "description": "An Earth Systems Science perspective draws upon the wealth of Earth systems science research in both content and pedagogy. This approach ahs served as a guiding framework for how students learn, engage in, and develop deep understandings of the interconnections among Earth's many different systems of geosphere, hydrosphere, atmosphere, and biosphere and the important role that human civilization plays in affecting Earth's other systems. This course takes an Earth Systems Science approach - an emerging transdisciplinary endeavor - to build students' understanding of the structure and functioning of the Earth as a complex, adaptive system.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Exploring Earth Through Time",
        "subjectCode": "EAPS",
        "courseCode": "31900",
        "instructor": [
            "Kenneth D Ridgway"
        ],
        "description": "The course will explore the history of the Earth from its beginning 4.5 billion years ago to the present. Our understanding and insight into the history of the Earth has greatly expanded during the last several decades. Emphasis will be placed on the relationships of tectonic processes that shaped the surface of the Earth and the evolution of the Earth's biosphere. The course will also examine how the role of evolution of life has played in the history of the atmosphere and oceans.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Aviation Meteorology",
        "subjectCode": "EAPS",
        "courseCode": "32500",
        "instructor": [
            "Nathan Tyler Rose"
        ],
        "description": "This course is designed for students who have an interest in topics in meteorology applied to aviation operations with emphasis on meteorological hazards for instrument flight. Topics covered include obtaining and evaluating weather data, review of synoptic meteorology, map analysis, the ICAO standard atmosphere, pressure and altimetry, atmospheric thermodynamics, moisture and stability, low-IFR operations, aircraft icing, turbulence, thunderstorms and associated hazards, and interpretation and use of radar and satellite imagery. Prior course work in introductory atmospheric science and pre-calculus is required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Climate, Science And Society",
        "subjectCode": "EAPS",
        "courseCode": "32700",
        "instructor": [
            "Lisa R Welp-Smith"
        ],
        "description": "This course will examine the broad problems of climate change by examining the relationship between science, politics, and society by using climate change as a lens through which to examine larger issues. Students will be encouraged to identify similar themes in their own experiences as emerging scientists, engineers and global leaders. Adequate preparation to write essays and perform basic arithmetic calculations needed. Prior knowledge of climate change science is not necessary.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Structural Geology",
        "subjectCode": "EAPS",
        "courseCode": "35200",
        "instructor": [
            "Saad S B Haq"
        ],
        "description": "This course deals with the nature and evolution of structures in rock deformed naturally by flow and fracture, as deduced from experimental, theoretical and field studies. Specific topics include: structures in three dimensions using descriptive geometry and stereonets, field measurements of rock geometry, tensors, strain and stress, the theory of brittle and plastic rock behavior, theory and field observation of folds and faults, structural analysis of an outcrop, the structure and mechanics of mountain belts. Students will be expected to show competency with using a general set skills, techniques, and tools commonly used by professional geoscientists.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Earth And Planetary Geophysics",
        "subjectCode": "EAPS",
        "courseCode": "35400",
        "instructor": [
            "Michael Manuel Sori"
        ],
        "description": "&nbsp; This course will explore geophysical processes from the scales of individual stresses that deform rocks, to plate motions, to planetary-scale interiors and phenomena. Emphasis will be focused on sources of stress and how this stress is manifested, heat transfer, and fluid processes. Seismic waves, gravity data, planetary shape, and what information they provide about the interior of solid planets will be discussed. The course material will be applied to Earth, other rocky worlds like the Moon and Mars, and icy moons like Europa and Enceladus. This course is an introduction to geophysical processes and serves as a stepping-stone to upper level geophysics courses such as EAPS 35200, EAPS 45000, and EAPS 55700.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Great Issues In Science And Society",
        "subjectCode": "EAPS",
        "courseCode": "36000",
        "instructor": [
            "Gouri Prabhakar"
        ],
        "description": "This course develops basic skills and knowledge critical to analyze issues of energy use, climate change, and sustainability that incorporate both societal and scientific perspectives. The goal of this course is not to arrive at particular consensus solutions to the problems associated with these issues but instead to foster an informed (through information literacy) debate that will ultimately be waged as solutions are sought. Working in teams the students work throughout the semester to complete a capstone teamwork project and a group presentation. Counts for Great Issues course in College of Science.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Great Issues",
        "subjectCode": "EAPS",
        "courseCode": "37500",
        "instructor": [
            "Dean M Ballotti",
            "Douglas R Schmitt"
        ],
        "description": "Prosperity of the 20th century was based on abundant and cheap energy; during the 21st century we will be faced with difficult challenges. Our society will face higher energy prices, decline of petroleum based fuels supplies, increased environmental effects of fossil fuels usage, and the challenge of solving the technological problems of developing alternative fuels. This course will review the structure, economics, and geopolitical issues faced by fossil fuel industries and the mitigation strategies that will be needed to change to low fossil fuel use society based on low polluting renewable energy sources. Counts for Great Issues course in College of Science for Juniors and Seniors.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Planetary Science Capstone",
        "subjectCode": "EAPS",
        "courseCode": "39100",
        "instructor": [
            "David A Minton"
        ],
        "description": "Intermediate special topics in the earth and atmospheric sciences. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Astrobiology",
        "subjectCode": "EAPS",
        "courseCode": "39500",
        "instructor": [
            "Stephanie Leigh Olson"
        ],
        "description": "Course explores current ideas on how life originated on Earth and may have originated elsewhere in the universe. Lectures will cover zones of habitability in stellar systems, planetary surface and atmosphere evolution and the environment of the early Earth. Topics include how life on Earth functions and its earliest evolution, SETI, planetary quarantine, panspermia, mass extinctions and the potential for life elsewhere in our own solar system.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Atmospheric Dynamics I",
        "subjectCode": "EAPS",
        "courseCode": "42200",
        "instructor": [
            "Andrea Elise Orton"
        ],
        "description": "(AGRY 43200) A study of the general system of equations governing mass and momentum changes in the atmosphere; special horizontal wind representations, thermal wind relationships; circulation, vorticity, divergence, and vertical motion. Prior course work in atmospheric thermodynamics and differential equations is required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Physics Of Climate",
        "subjectCode": "EAPS",
        "courseCode": "42501",
        "instructor": [
            "Lei Wang"
        ],
        "description": "To understand climate we describe and synthesize physical processes in the atmosphere and their coupling to the ocean, ice, and land. We quantitatively explore climatology with an equal balance of physical principles and scrutiny of available modern data. Topics include: visualization of atmospheric/land surface/oceanographic climatological data sets; theories of climate dynamics; and climate change. Beginning with radiative balance and simple energy balance models, the course progresses toward understanding the effects of radiative-convective forcing and rotation on the fluid envelopes. Analysis of data in an interactive computer-enabled environment is an important part of the course. By the end of this course, the student should know how the Earth System behaves at large scales and grasp the physical understandings of why. Previous course work in Calculus, Physics, and Chemistry are required as building blocks for this course, and knowledge from these areas will be called upon frequently. Should you be missing this background, please speak with your instructor as soon as possible.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Geographic Information Systems",
        "subjectCode": "EAPS",
        "courseCode": "50801",
        "instructor": [
            "Jie Shan"
        ],
        "description": "This course covers a range of fundamentals in geographic information science and technology. Students will learn the use of current popular geographic information system (GIS) tools to handle various geographic data. Through working on real-world geospatial problems, students shall gain extensive and hands-on experience in geographic data manipulation, visualization, and analysis. Course assignments are focused on both GIS theoretical basics and practical skills for students to achieve expected proficiency. The course will work with geospatial data in geography, topography, environmental science, hydrology, transportation, and geosocial science. It is targeted to students with interest in civil and environmental engineering, agriculture, geography, earth science, natural resources, smart cities or other related subjects.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Climate Time Series Analysis",
        "subjectCode": "EAPS",
        "courseCode": "51000",
        "instructor": [
            "Wen-Wen Tung"
        ],
        "description": "This course in time series analysis combines traditionally taught basics with topics of central importance in current weather and climate research, including long memory, extremes, nonlinear time series, chaos and complexity.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Radar Meteorology",
        "subjectCode": "EAPS",
        "courseCode": "52300",
        "instructor": [
            "Robin L Tanamachi"
        ],
        "description": "Origin and evolution of radar. Modern weather radar systems and their component parts. Propagation of microwave energy in the atmosphere. Rayleigh and Mie scattering theory, with application to scattering by precipitation. Utilization of radar systems in forecasting quantitative analyses and cloud physics research. Recent refinement and future potential.  Prior coursework in synoptic meteorology labs and atmospheric physics is required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Extreme Weather And Climate: Science And Risk",
        "subjectCode": "EAPS",
        "courseCode": "53000",
        "instructor": [
            "Daniel R Chavas"
        ],
        "description": "Trains students in the analysis of risk due to meteorological hazards, including climate change. Focus on integrating the basics of probability theory, including calculation of hazard return periods and exceedance curves, with the fundamental physics of meteorological hazards. Hazards may include hurricanes, tornadoes, and floods.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Atmospheric Physics I",
        "subjectCode": "EAPS",
        "courseCode": "53200",
        "instructor": [
            "Daniel T Dawson"
        ],
        "description": "Cloud and precipitation physics and basic atmospheric radiative transfer. Introduction to computer-aided problem solving.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Atmospheric Physics II",
        "subjectCode": "EAPS",
        "courseCode": "53300",
        "instructor": [
            "Gouri Prabhakar"
        ],
        "description": "A continuation of EAPS 53200, covering the following selected advanced topics in atmospheric physics: gaseous absorption, Mie scattering, the equation of transfer, and radiative transfer in cloudy and hazy atmospheres. The application of radiative transfer in active and passive remote sensing. Advanced topics in atmospheric thermodynamics, such as heterogeneous systems, kinetic theory of gases, and planetary atmospheres. Basic ozone photochemistry applied to stratospheric and tropospheric pollution.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Tropical Meteorology",
        "subjectCode": "EAPS",
        "courseCode": "53400",
        "instructor": [
            "Daniel R Chavas"
        ],
        "description": "Tropical climatology; stability, convection, clouds, and precipitation processes; horizontal and vertical motions; life cycle and energetics of tropical cyclones; large-scale tropical circulations; interactions between small-scale and large-scale circulations; general circulations of the tropics; results of tropical experiments; outlook for future experiments. Prior course work in synoptic meteorology labs and atmospheric physics is required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "GeoData Science Seminar",
        "subjectCode": "EAPS",
        "courseCode": "59100",
        "instructor": [
            "Wen-Wen Tung",
            "Alexandria Vincenza Johnson",
            "Kevin Thomas Gray",
            "Michael Patterson Eddy",
            "Roger Craig Wiens",
            "Ali Bramson"
        ],
        "description": "Specialized study offered on an individual basis or through specially arranged courses. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            18
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Colloquium In Earth, Atmospheric, And Planetary Sciences",
        "subjectCode": "EAPS",
        "courseCode": "69100",
        "instructor": [
            "Alexandria Vincenza Johnson"
        ],
        "description": "This course is intended to expose students to the wide range of topics studied throughout the Department of Earth, Atmospheric, and Planetary Sciences, allows for interactions with outside experts and networking, and provides the opportunity for students to synthesize high level topics that may not be directly related to their scientific endeavors.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    }
]