[
    {
        "title": "Leadership, Policy, And Change In Science, Technology, Engineering, And Mathematics (STEM) Education",
        "subjectCode": "ENE",
        "courseCode": "50400",
        "instructor": [
            "Joyce B Main"
        ],
        "description": "This course provides a foundation for examining historical and current perspectives of STEM education programs and policy at the secondary and postsecondary levels. Focusing on the relationships among education policy, leadership theories, and models of systemic change, this course will enable students to situate and envision their potential role in shaping engineering education within the context of the larger education landscape. Students will synthesize course readings, examine education policy, and reflect on leadership theories and change, as well as explore how they can influence leadership, policy, and/or organizational change in STEM education through a semester project.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Theories Of Development And Engineering Thinking",
        "subjectCode": "ENE",
        "courseCode": "50500",
        "instructor": [
            "Ruth Eileen Haaser Wertz"
        ],
        "description": "This course examines theories of human development, learning and epistemology in the context of Engineering Education. A broad survey of readings guides an in-depth study of fundamental theories of development and knowledge generation as it relates to pedagogy and research. A rich body of theoretical literature will be studied in order to explore its relation to engineering education. Work in the course aims to construct answers to the following three questions: (1) How do theories of human learning, development, and epistemology help us think about engineering? (2) How do they relate to engineering education? (3) How do they inform research method and practice in engineering education? No restrictions. It is helpful, however, for students to have engaged in prior reading-and writing- intensive courses that required them to synthesize large amounts of information. For this reason, it is recommended that students are enrolled currently in a graduate program at Purdue University. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Content, Assessment And Pedagogy: An Integrated Engineering Design Approach",
        "subjectCode": "ENE",
        "courseCode": "50600",
        "instructor": [
            "Senay Purzer"
        ],
        "description": "The course is explicitly identified in the ENE -PhD requirements as a \"foundation course\" required for all students.  This course is intended to be taken early in a graduate student's curriculum and therefore is designed to be a bridge between the student's previous experience with engineering (education, work, and teaching) and new engineering education research-based approaches.  It is intended as an entryway to help students apply an engineering design approach to the design of instruction.  To meet this aim, the course involves an iterative project-based approach in a context (design site) that is chosen by the student for its relevance, interest and potential application.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Exp Alt Career Path For Eng Ed",
        "subjectCode": "ENE",
        "courseCode": "59500",
        "instructor": [
            "Audeen W Fentiman"
        ],
        "description": "Primarily designed for specialized topic areas for which there is no specific course, workshop, or individual study plan, but having enough student interest to justify the formalized teaching of a course. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            6
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Cognitive Devices In Science, Technology, Engineering And Mathematics Learning Environments",
        "subjectCode": "ENE",
        "courseCode": "63000",
        "instructor": [
            "Sean Brophy"
        ],
        "description": "This course explores the nature of technologies we use to assist in thinking, learning and teaching. Specific focus is on cognitive tools associated with engineering activities and how to blend these tools with science and mathematical knowledge. These will range from representational tools, computational tools and cognitive tools for supporting individual and group thinking and learning. Participants in this course will be able to evaluate various learning technologies relative to specific learning goals and outcomes and will design a technological tool to support thinking, learning and/or teaching about concepts in science, engineering, mathematics and technology. Participants will also be able to identify assessment methods that indicate cognitive change in learners as a measure of the effectiveness of a device/tool in context of an activity.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Educational Methods In Engineering",
        "subjectCode": "ENE",
        "courseCode": "68500",
        "instructor": [
            "Syed Ahmad Helmi Bin Syed Hassan"
        ],
        "description": "(CHE 68500)  Students will learn how to teach in an engineering environment where both classroom and laboratory instruction is intertwined. Classroom techniques, such as lectures, cooperative groups, mastery and PSI, TV and video, and guided design will be studied, in addition to class preparation issues, such as ABET accreditation and design content. Students will study motivation, learning theories and cycles, and personality types.  Includes teaching practice and group projects. Student must be admitted into a Ph.D. program in Engineering or other technical discipline (Finished with MS or MS-bypass).  Not open to students who have taken PSY 69500/EDPS 63400. Permission of Instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Mentored Teaching In Engineering",
        "subjectCode": "ENE",
        "courseCode": "68700",
        "instructor": [
            "Khairiyah Mohd Yusof"
        ],
        "description": "Mentored experience in the teaching of engineering, with structured opportunities for individual reflection. All students create a scholarly teaching portfolio. Students who register for three credits conduct a scholarship of teaching and learning project. Prerequisites: Significant concurrent responsibility for teaching an engineering course. Registration in or completion of ENE 50600 (Content, Assessment And Pedagogy) or ENE 68500 (Educational Methods In Engineering); or instructor permission required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Seminar In Engineering Education",
        "subjectCode": "ENE",
        "courseCode": "69000",
        "instructor": [
            "Edward J Berger"
        ],
        "description": "Seminar course covering a broad range of current discovery, learning, and engagement topics in Engineering Education. Seminar presentations by representatives from academia, industry, other external institutions, and members of the Purdue University community. This is a required course for the graduate program in the Department of Engineering Education. Typically offered Fall Spring.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Succeeding As Engr Prof",
        "subjectCode": "ENE",
        "courseCode": "69500",
        "instructor": [
            "Justin L Hess",
            "Alice L Pawley"
        ],
        "description": "Primarily designed for specialized topic areas for which there is no specific course, workshop, or individual study plan, but having enough student interest to justify the formalized teaching of a course. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            6
        ],
        "term": "Spring 2024"
    }
]