[
    {
        "title": "Global Awareness",
        "subjectCode": "GSLA",
        "courseCode": "10100",
        "instructor": [
            "Betty Kathryn Tonsing"
        ],
        "description": "This course surveys a range of global issues to develop an understanding and appreciation of the major geographical and cultural areas of the world and the issues that both unite and divide such areas and their people. The course will examine key political, economic, social, historical and cultural patterns that define our modern world. It encourages students to raise 'big' questions about what processes and institutions helped constitute the modern moment, as well as about the dynamic interactions between our social world and the natural one. This is a gateway course for prospective Global Studies Majors and Minors.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Theories Of Global Studies",
        "subjectCode": "GSLA",
        "courseCode": "30100",
        "instructor": [
            "Betty Kathryn Tonsing"
        ],
        "description": "The course is designed to introduce students to the major schools of thought in Global and International Studies. It provides students with critical tools to explore the interconnectedness of our world from multiple perspectives. The course will expose students to a variety of international scholars who have understood Global Studies to be more than globalization. Instead, it introduces contested issues and contradictory positions concerning the meaning and significance of globalization.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Engaging Religious Diversity",
        "subjectCode": "GSLA",
        "courseCode": "39100",
        "instructor": [
            "Thomas W Ryba"
        ],
        "description": "This variable title course deals with topics that explore a range of experiences and analytical perspectives clustered around the contemporary global experience. The course will vary in subject matter but focus on the challenges and rewards of a globalized world as articulated through topics such as cross-border histories, music, gender, racial formations, film, and economic development. Content will vary with the instructors teaching the course.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    }
]