[
    {
        "title": "Foundations Of Kinesiology",
        "subjectCode": "HK",
        "courseCode": "10000",
        "instructor": [
            "Howard N Zelaznik"
        ],
        "description": "This course will provide an introduction to the physical and behavioral sciences underlying kinesiology, the study of human movement. The course will cover foundational concepts in exercise physiology, biomechanics, motor behavior, sport and exercise psychology, and sociology and history of physical activity. The course will take an interdisciplinary perspective, exploring both key concepts in each of these sub-areas of kinesiology, and how they are integrated to understand problems in human movement, exercise, physical activity, sport, and healthy lifestyles.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Health And Kinesiology",
        "subjectCode": "HK",
        "courseCode": "13500",
        "instructor": [
            "TBA"
        ],
        "description": "Overviews the disciplines of health and kinesiology. Students explore skills and academic interests in theses areas. Describes career opportunities and options for graduate study. Provides strategies for professional and portfolio development. Students complete five hours of community service per semester. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Clinical Field Experience In Health And Fitness",
        "subjectCode": "HK",
        "courseCode": "21300",
        "instructor": [
            "Jason Christopher Chrapek"
        ],
        "description": "This course is a coordinated clinical/professional experience designed to expose students to various positions within the wellness community and how clinical interactions are embedded within fitness centers. In addition to weekly in-person class meetings, students will observe and practice professional and foundational skills at different clinical sites. Professional communication, interdisciplinary interactions, and self-reflection are key skills developed in this practicum.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Foundations For The Health And Fitness Professional",
        "subjectCode": "HK",
        "courseCode": "22200",
        "instructor": [
            "Lucas Trevor Woody"
        ],
        "description": "Designed to introduce the emerging Health and Fitness professional to current trends in health and physical activity, and provide effective hands-on methodology for implementation of physical activity and exercise in different settings. Students will be able to identify the role of a clinician, coach, trainer, etc. Students will obtain skills in client consultation, program design and strategies for implementing programs to the general population. Students will also be introduced to the skills and knowledge required for working with clinical populations. This course is designed to help students prepare for future clinical practice and certification.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Principles Of Motor Development",
        "subjectCode": "HK",
        "courseCode": "25300",
        "instructor": [
            "Laura J Claxton"
        ],
        "description": "This course provides an introduction to motor development from a life-span perspective. Students will learn how infants develop from mainly reflexive beings into children and adults that are capable of interacting with the world in a goal-directed manner. This course specifically examines how changes in physical growth, aging, and maturation of the central nervous system influence motor performance. Finally, the decline of motor skills associated with advanced age is discussed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Foundations Of Motor Skill Learning",
        "subjectCode": "HK",
        "courseCode": "25800",
        "instructor": [
            "Howard N Zelaznik"
        ],
        "description": "Concepts and principles of motor skill learning, with emphasis on the acquisition and retention of gross movement and sport skills.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Biomechanical Foundations Of Motor Skills",
        "subjectCode": "HK",
        "courseCode": "26300",
        "instructor": [
            "Shirley Rietdyk"
        ],
        "description": "Fundamental anatomical and mechanical concepts and procedures for analyzing motor skills, with particular reference to sport, dance, and aquatic activities.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Fieldwork In Athletic Training",
        "subjectCode": "HK",
        "courseCode": "28500",
        "instructor": [
            "Craig Alan Voll"
        ],
        "description": "Students will learn about and explore the athletic training profession through classroom and experiential learning in an intercollegiate setting. Under supervision of the certified athletic trainer, students will observe facility operations and duties of the athletic trainer. Topics of instruction include history of athletic training, governance, and professional foundation and ethics.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Fieldwork In Athletic Training",
        "subjectCode": "HK",
        "courseCode": "28600",
        "instructor": [
            "Mitsue Alice Wilcoxson"
        ],
        "description": "Students will learn about and explore the athletic training profession through classroom and experiential learning in secondary school setting. Under supervision of the certified athletic trainer, students will observe facility operations and duties of the athletic trainer. Topics of instruction include basics of wound care, setup and operation of therapeutic modalities, and basic rehabilitation principles.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Fieldwork In Athletic Training",
        "subjectCode": "HK",
        "courseCode": "28700",
        "instructor": [
            "Craig Alan Voll"
        ],
        "description": "Students will learn about and explore the athletic training profession through classroom and experiential learning in an emerging athletic training setting. Under supervision of the certified athletic trainer, students will observe facility operation and duties of the athletic trainer. Topics of instruction include basics of taping and wrapping, selection and fitting of protective equipment, and principles of risk management.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Applied Clinical Anatomy",
        "subjectCode": "HK",
        "courseCode": "30200",
        "instructor": [
            "Mitsue Alice Wilcoxson"
        ],
        "description": "An introduction to the regional anatomical study of the human body for undergraduate allied health students. Lectures will be supplemented by observation and demonstration of prosected cadaver material, radiographs, osteology, and surface anatomy.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Athletic Health Care",
        "subjectCode": "HK",
        "courseCode": "30800",
        "instructor": [
            "TBA"
        ],
        "description": "Provides students with foundational knowledge and skills for the prevention, recognition, and management of common athletic injuries and illnesses, as well as emergency conditions encountered by sports medicine professionals.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Strength And Conditioning And Exercise Instruction Across The Lifespan",
        "subjectCode": "HK",
        "courseCode": "31800",
        "instructor": [
            "Lucas Trevor Woody"
        ],
        "description": "This course is designed to provide students with an overview of educational concepts, program design and instructional/leadership skills for designing and instructing exercise programs. Students will obtain hands-on experience conducting exercise programs for strength and conditioning, cardiorespiratory fitness, and flexibility throughout the semester. Students will learn to work with a variety of populations throughout the semester. Students will be evaluated on their effectiveness in designing and instruction exercise sessions for both individual and group-led scenarios. This course is designed to help students prepare for future clinical practice and certifications, such as the ACSM Certified Clinical Exercise Physiologist. Must have CPR/AED, First Aid certifications.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Sports Management",
        "subjectCode": "HK",
        "courseCode": "32700",
        "instructor": [
            "Christopher Joseph Henderson"
        ],
        "description": "This course introduces the foundations and principles of sport management, focusing on the leadership, administration, business practices, and operation of sport organizations at all levels. This course offers students the opportunity to gain information and an understanding of the various practices and procedures associated with sport management and the sport industry. Students are presented with an overview of the business of sport, including a variety of different career opportunities in a multitude of sport settings as they explore the value of professional management within sport organizations. Finally, this course uses a semester-long major project that allows students to use the skills and knowledge gained from lectures, readings, and discussions to develop a comprehensive business plan integrating the various modules and topics from the semester into a cohesive administrative plan.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Business Of Professional Sports",
        "subjectCode": "HK",
        "courseCode": "32800",
        "instructor": [
            "Christopher Joseph Henderson"
        ],
        "description": "This course examines the rise and growth of professional sport into a multibillion-dollar industry worldwide that is both an economic giant as well as a pop cultural phenomenon. The course takes a look at the historical development of professional sport while also examining current trends that continue to shape the industry. Students learn the basics of how pro leagues and teams operate by participating in an interactive and engaging fantasy sports simulation that sees them create their own league and manage and operate their own team. In the simulation, students deal with issues real-life pro sports managers have to address every day, including roster construction and management, pricing their product, and marketing and branding their franchise and league overall.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Exercise Physiology I",
        "subjectCode": "HK",
        "courseCode": "36800",
        "instructor": [
            "Bruno Tesini Roseguini"
        ],
        "description": "Physiological concepts and principles underlying human responses and adaptations to exercise stress. Included are selected methods and techniques of assessing physiological function in the laboratory setting.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Sport And Exercise Psychology I",
        "subjectCode": "HK",
        "courseCode": "37200",
        "instructor": [
            "Shih-Chun Kao"
        ],
        "description": "This course focuses on social and psychological factors related to participation in sport, exercise, and physical activity. The class explores both (a) how social and psychological factors influence participation and performance in physical activity, and (b) how sport, exercise, and physical activity participation affects psychological well-being. Topics include personality, socialization, learning and feedback, stress and coping, self-perceptions, motivation, and psychological methods for enhancing personal development and physical performance.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Health Screening And Fitness Evaluation And Design",
        "subjectCode": "HK",
        "courseCode": "42100",
        "instructor": [
            "Cassandra A Ledman"
        ],
        "description": "This course provides the learner with the knowledge and skills to successfully administer and interpret the results of health evaluations and fitness assessments for the purposes of analysis and the development of individualized exercise programs.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Basic Concepts In Exercise Program Design",
        "subjectCode": "HK",
        "courseCode": "42200",
        "instructor": [
            "Adam S Huffield"
        ],
        "description": "Introduces basic program design concepts and rationale to design fitness programs for healthy adults emphasizing cardiovascular training, strength training, flexibility training, and balance.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Sports Marketing",
        "subjectCode": "HK",
        "courseCode": "42700",
        "instructor": [
            "Christopher Joseph Henderson"
        ],
        "description": "This course introduces and examines marketing within various levels of the sport industry, with an emphasis on consumer behavior, branding, and sponsorship. This course first introduces students to the marketing of sport services, sport teams, and sport programs by examining basic marketing strategies as they relate specifically to sport settings. Second, the course examines key consumer behaviors regarding sport fans and sport fan communities. Finally, the course enables students to formulate original and creative sport marketing mixes to provide students with the hands-on practice necessary to become an effective sport marketer.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Sports Facility And Event Management",
        "subjectCode": "HK",
        "courseCode": "42800",
        "instructor": [
            "Christopher Joseph Henderson"
        ],
        "description": "This course is meant to introduce students to the foundations and principles of effective facility and event management. Sport facilities and the types of events they can host are essential components to understanding the field of sport management. In this course, we will explore the concepts of facility design, planning, systems, risk management, marketing, and ownership. In terms of event management, we will explore the concepts of event creation, impact on hosts, marketing/sponsorship, and the potential positive and negative outcomes of sport events.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Motor Coordination And Development",
        "subjectCode": "HK",
        "courseCode": "45300",
        "instructor": [
            "Laura J Claxton"
        ],
        "description": "An advanced undergraduate motor development course that examines the processes and coordination principles related to motor behavior development across the life span. Material and concepts are concentrated around specific skills areas and SPAN a broad range of ages and theoretical approaches.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Exercise Testing And Prescription In Special Populations",
        "subjectCode": "HK",
        "courseCode": "46900",
        "instructor": [
            "Adam S Huffield"
        ],
        "description": "Examines responses to exercise testing and prescription in healthy adults compared to exercise responses and special considerations for individuals with chronic diseases and conditions and issues of concern to pregnant women, children, and older adults, among others.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Sport And Exercise Psychology II",
        "subjectCode": "HK",
        "courseCode": "47200",
        "instructor": [
            "Steve Amireault"
        ],
        "description": "Course presents topics not covered in PE 37200 and emphasizes application of psychological principles in sport and exercise settings. Topics include group dynamics, psychological benefits of exercise; exercise addiction; body image; leadership and communication; and performance enhancement principles and techniques.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Fund Of Sports Performance",
        "subjectCode": "HK",
        "courseCode": "49000",
        "instructor": [
            "Lucas Trevor Woody"
        ],
        "description": "Individualized readings, topics, or projects in health and kinesiology appropriate for undergraduate students. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Athletic Training Interventions",
        "subjectCode": "HK",
        "courseCode": "53500",
        "instructor": [
            "Scott E Lawrance"
        ],
        "description": "This course is designed to provide the student with the foundational theory and techniques related to injury and illness intervention. Included are topics addressing tissue healing, theories of pain and pain control, concepts of kinetic chain stability and mobility, as well as principles related to the use of therapeutic medications. Students will discover how to plan and implement a comprehensive reconditioning program for injuries and conditions sustained by physically active individuals. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Evaluation And Management Of The Spine And Head",
        "subjectCode": "HK",
        "courseCode": "54000",
        "instructor": [
            "Scott E Lawrance"
        ],
        "description": "Course covering an in-depth study of the normal anatomical structures in the spine and head, including joint structure and musculoskeletal/nervous systems. Also discussed are common risk factors and causes of injuries as identified by contemporary epidemiological studies, common injuries to each body part, typical symptoms, and common clinical signs associated with injuries and illnesses with the physically active. A lab covering the assessment and management techniques for injuries commonly seen will be included. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Therapeutic Modalities",
        "subjectCode": "HK",
        "courseCode": "54500",
        "instructor": [
            "Jennifer K Popp"
        ],
        "description": "Course covering the physiological effects, indications, contraindications, and precautions of contemporary therapeutic modalities. Students will design and plan therapeutic interventions. Focus will be on the application of therapeutic modalities according to evidence-based protocols. Included in this course will be the role of equipment safety and maintenance of therapeutic modalities. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Evaluation And Management Of Medical Conditions",
        "subjectCode": "HK",
        "courseCode": "55000",
        "instructor": [
            "Mitsue Alice Wilcoxson"
        ],
        "description": "Course covering an in-depth study of the normal anatomical structures in the thorax and abdomen, including the cardiovascular, digestive, urinary, reproductive, endocrine, and lymphatic systems. Also discussed are common risk factors and causes of injuries as identified by contemporary epidemiological studies, common injuries to each body part, typical symptoms, and common clinical signs associated with injuries and illnesses with the physically active. A lab covering injury assessment techniques of common illnesses and disease most often encountered by allied healthcare professionals will be included. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Health Coaching Practicum",
        "subjectCode": "HK",
        "courseCode": "59000",
        "instructor": [
            "William G Evans",
            "Igor Alexandre Fernandes",
            "Satyajit S Ambike"
        ],
        "description": "Individualized readings, topics, or projects in health and kinesiology appropriate for graduate students. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Adv Topics In Kinesiology",
        "subjectCode": "HK",
        "courseCode": "67000",
        "instructor": [
            "Steve Amireault"
        ],
        "description": "Selected topics in motor control. The subject matter will be data-based and drawn from research literature encompassing behavioral and physiological experimental paradigms. Students will critically evaluate and synthesize research to better understand the integration of individual systems in sensorimotor processing. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    }
]