[
    {
        "title": "Financial Accounting For The Service Industries",
        "subjectCode": "HTM",
        "courseCode": "14100",
        "instructor": [
            "Stephen R Leitch",
            "Soo Cheong Jang"
        ],
        "description": "This course covers fundamental accounting principles and procedures applied to the hospitality and service industries. Topics include the uniform system of accounts, financial statements, special purpose journals, and subsidiary ledgers unique to the hospitality and service industries. This course also introduces financial statement analysis.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Tourism Management",
        "subjectCode": "HTM",
        "courseCode": "17300",
        "instructor": [
            "Liping A Cai"
        ],
        "description": "This is an introduction to tourism management using a system approach that integrates a variety of hospitality and travel organizations and businesses. It focuses on the understanding of tourism from the perspectives of travelers and destinations, while identifying tourism's economic, socio-cultural, and environmental impacts on communities.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Lodging Management",
        "subjectCode": "HTM",
        "courseCode": "18100",
        "instructor": [
            "Annmarie J Nicely"
        ],
        "description": "History, features, operation procedures and management of lodging facilities both in the United States and in other parts of the world. The course involves an experiential learning component.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Sanitation And Health In Foodservice, Lodging, And Tourism",
        "subjectCode": "HTM",
        "courseCode": "19100",
        "instructor": [
            "Bruce A Goad"
        ],
        "description": "This course introduces students to the foodservice component of the Hospitality and Tourism industry and explores food safety and other health-related issues. Application of sanitation principles in restaurants, hospitals, schools, hotels, cruise ships, airlines, and international travel are covered. Students must pass a National Sanitation Certification Examination to receive credit.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Management And Leadership In Hospitality And Tourism",
        "subjectCode": "HTM",
        "courseCode": "21200",
        "instructor": [
            "TBA"
        ],
        "description": "This course addresses the basic principles of management and leadership. Students will be able to apply management principles of planning, organizing, directing, and controlling human and physical resources. Students will also identify key leadership skills including motivating employees, effective decision-making, and business communication. Students will identify individual, team, and organizational behaviors necessary to effectively manage hospitality businesses.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Hospitality And Tourism Marketing",
        "subjectCode": "HTM",
        "courseCode": "23100",
        "instructor": [
            "Chang Ma",
            "Liping A Cai"
        ],
        "description": "This course teaches students a customer-oriented approach to marketing in hospitality and tourism. This course emphasizes the role of marketing in an organization's overall strategic planning. Techniques available to hotels, restaurants, and other tourism businesses are described and evaluated including travel packaging, the travel trade, advertising, sales promotion, positioning and branding.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Managerial Accounting And Financial Management In Hospitality Operations",
        "subjectCode": "HTM",
        "courseCode": "24100",
        "instructor": [
            "Stephen R Leitch",
            "Woojin Lee"
        ],
        "description": "This course teaches decision-making using managerial accounting, financial analyses, and time value of money. Consideration will be given to systems, techniques, information types, and Excel as used by hospitality management. Emphasis on situations oriented to the hospitality industry.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Festivals And Special Events",
        "subjectCode": "HTM",
        "courseCode": "26200",
        "instructor": [
            "Casey Michelle Cox Dexter"
        ],
        "description": "This course offers a comprehensive overview of the theory and procedures associated with the coordination of festivals and special events. Essential topics will include the conceptualization, planning, coordination, sponsorship, marketing, funding, staffing, legal issues, and assessment of festivals and special events. Students will gain hands-on experience by volunteering to work a minimum of six hours to set up, help coordinate, or tear down a large-scale festival or special event.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Foodservice Management",
        "subjectCode": "HTM",
        "courseCode": "29102",
        "instructor": [
            "Karen Sue Byrd"
        ],
        "description": "An introduction to food preparation methods and service techniques in quantity food settings. Students become familiar with ingredients and culinary terminology, and learn to read, write and evaluate menus. Recipe conversion, inventory and costing skills are developed. Production methods, equipment, and product flow are examined. Front-of-the-house service techniques as well as front-and-back-of-the-house interactions will be studied.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Procurement Management For Foodservice",
        "subjectCode": "HTM",
        "courseCode": "31100",
        "instructor": [
            "Karen Sue Byrd"
        ],
        "description": "Identifies and describes food, supplies, and related merchandise used in the foodservice industry. Provides methods and criteria for recognizing quality, evaluating, specifying, purchasing, and inspecting these products. Discusses the use of technology in the purchasing component of the foodservice industry.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Human Resources Management For The Service Industries",
        "subjectCode": "HTM",
        "courseCode": "31200",
        "instructor": [
            "Jun Chen"
        ],
        "description": "The principles and practices of managing human resources for effective operations of hospitality and tourism businesses will be covered including: analysis and design of work, recruiting, selection, training and development, performance management, compensation, employee relations, and strategies for supporting organizational strategies.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Franchising",
        "subjectCode": "HTM",
        "courseCode": "31400",
        "instructor": [
            "TBA"
        ],
        "description": "The study of franchise administration, operations, and marketing, with a special emphasis on hospitality-related franchises. Includes a study of the legal regulation of franchises, the franchisee-franchisor relationship, and unique problems in operating a franchise.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Business Etiquette For Managers",
        "subjectCode": "HTM",
        "courseCode": "31700",
        "instructor": [
            "Anthony P Cawdron"
        ],
        "description": "A review of contemporary standards of human interaction in the workplace. How manners, etiquette and style affect and enhance everyday dealings with others.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Hospitality Facilities Management",
        "subjectCode": "HTM",
        "courseCode": "32200",
        "instructor": [
            "Douglas C Nelson"
        ],
        "description": "Technical and managerial issues relating to the operation and maintenance of the physical plant and equipment in hospitality industry facilities.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Hospitality And Tourism Sales And Service",
        "subjectCode": "HTM",
        "courseCode": "33100",
        "instructor": [
            "Stephen R Leitch"
        ],
        "description": "Application of sales and customer service methods used to generate revenues for hospitality and tourism businesses. Emphasis is placed on a hands-on assignment which requires students to identify a product that they will market and sell, as well as participate in a sales blitz.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Operations Control And Analysis In The Hospitality Industry",
        "subjectCode": "HTM",
        "courseCode": "34100",
        "instructor": [
            "Hwijin Jeon Baldick",
            "Carl A Behnke"
        ],
        "description": "Applications of the control process and quantitative analysis to effectively manage an efficient and profitable hospitality business. The emphasis is on planning budgets, controlling operational activities, and evaluating performance.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Sustainable Tourism And Responsible Travel",
        "subjectCode": "HTM",
        "courseCode": "37000",
        "instructor": [
            "Gordon J Day"
        ],
        "description": "This course will examine issues associated with sustainability in the hospitality and tourism industry. It will examine how principles of sustainable development and the triple bottom line (economic, social and environmental) are applied to hospitality and tourism. The course will address sustainability across a variety of tourism sectors including destination management, lodging, restaurants and meetings. The course will also examine consumer issues associated with sustainability.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Revenue Management In The Lodging Industry",
        "subjectCode": "HTM",
        "courseCode": "38110",
        "instructor": [
            "Alei Fan"
        ],
        "description": "This course will build on knowledge acquired in previous hotel business fundamentals courses. The class will provide a theoretical perspective on service management and how service management concepts can be applied to the hospitality business. The course will focus on strategies being used to maximize profits in hotels. The course will also cover latest trends and technologies impacting revenue management in lodging.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Intro Hotel Asset Mgmt And Inv",
        "subjectCode": "HTM",
        "courseCode": "39900",
        "instructor": [
            "Chun-Hung Hugo Tang"
        ],
        "description": "Various topics that may change from semester to semester are presented by HTM faculty.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Hospitality And Tourism Law",
        "subjectCode": "HTM",
        "courseCode": "41100",
        "instructor": [
            "Douglas C Nelson"
        ],
        "description": "Overview of the fundamental legal framework that governs the conduct of hospitality and tourism managers. Topics include civil rights, contracts, court procedures, ethics, and risk management.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Financial Management For The Hospitality Industry",
        "subjectCode": "HTM",
        "courseCode": "44100",
        "instructor": [
            "Wookjae Heo",
            "Soo Cheong Jang"
        ],
        "description": "This course deals with subjects and issues facing a financial manager in the hospitality and tourism industry. The primary purposes of this course are to understand the role of financial management, to learn analytic concepts and managerial tools for making capital investment decisions and to become familiar with major financial instruments and concepts such as time value of money, risk-return, capital budgeting, cost of capital, and capital structure.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Event And Meeting Management",
        "subjectCode": "HTM",
        "courseCode": "46200",
        "instructor": [
            "Shinyong Jung"
        ],
        "description": "Advanced aspects of meeting and event management principles and practices will be covered in this course. A focus is placed on: strategic planning, project management, finance and risk management, event design, site management, and ethics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Beverage Operation Management",
        "subjectCode": "HTM",
        "courseCode": "49111",
        "instructor": [
            "Courtney J Wade"
        ],
        "description": "This course teaches students the historical background and modern day principles and management practices regarding the production, selection, purchasing, storage and service of beverage alcohol in all aspects of the hospitality industry. Students must pass the ServSafe Responsible Service of Alcohol certification examination to earn course credit.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Management And Service Of Beverage Alcohol",
        "subjectCode": "HTM",
        "courseCode": "49112",
        "instructor": [
            "Courtney J Wade"
        ],
        "description": "This course introduces the principles and practices associated with the production of beverage alcohol in the hospitality industry.  Lectures and structured tastings will guide students in identifying and describing the unique characteristics of fermented beverages commonly found in the hospitality industry. Course fee. Students will be tasting alcohol as part of this course, they need to be at least 21 years of age to do so legally. Department permission required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Hospitality Operation Management And Leadership",
        "subjectCode": "HTM",
        "courseCode": "49201",
        "instructor": [
            "Carl A Behnke"
        ],
        "description": "Students apply managerial skills and techniques in organizing, directing and controlling a full-service restaurant operation as they rotate through a variety of managerial positions. Students will also participate in lectures, assignments, and projects on topics related to leadership, such as interpersonal communications (emphasis on culture, gender and age differences), ethical leadership (emphasis on integrity and credibility), public speaking, teamwork and critical thinking. Permission of department required.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Business Development In Hospitality And Tourism",
        "subjectCode": "HTM",
        "courseCode": "49901",
        "instructor": [
            "Seon Jeong Lee"
        ],
        "description": "This capstone course is one of the final courses in an HTM student's undergraduate career. This course will cover all stages in the business development process of a proposed business. By integrating the student's academic and experiential knowledge, the course's culminating project serves as a repository for the student's undergraduate learning and industry experiences. Emphasis will be on strategic planning, the design of systems, and models and problem analysis, leading to the opening of a successful business. The course concludes in the presentation of a proposed business. The course is designed to help the student transition from college to the workforce.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Research Methods In Hospitality And Tourism",
        "subjectCode": "HTM",
        "courseCode": "50100",
        "instructor": [
            "Shinyong Jung"
        ],
        "description": "Introduction to behavioral and economic research design, and the development of research proposals.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Hospitality Accounting And Finance Systems",
        "subjectCode": "HTM",
        "courseCode": "54100",
        "instructor": [
            "Chun-Hung Hugo Tang"
        ],
        "description": "Specialized accounting and finance systems as related to the hospitality industries. Applications of budgeting and pricing models, performance evaluations and incentives systems, and short-term asset management are discussed, as well as other current subjects.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Research Topics And Methods Seminar",
        "subjectCode": "HTM",
        "courseCode": "60200",
        "instructor": [
            "Jonathan J Bauchet"
        ],
        "description": "Examination of current research in hospitality and tourism. Focuses on industry research needs and appropriate methodologies. Open to graduate students and honors undergraduates. Required for doctoral students. Prerequisite: HTM 50100, STAT 50100, 50200.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Personnel Systems In Restaurants, Hotels, And Institutions",
        "subjectCode": "HTM",
        "courseCode": "64200",
        "instructor": [
            "Annmarie J Nicely"
        ],
        "description": "Examination of the philosophical and operational alternatives related to establishing and directing human resource systems in complex restaurant, hotel, and institutional organizations. Prerequisite: HTM 34100, 41100; 6 credit hours at the upper division undergraduate level in Business, Management, Marketing.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    }
]