[
    {
        "title": "Intro Quechua II",
        "subjectCode": "LC",
        "courseCode": "10200",
        "instructor": [
            "Soledad Na Morales-Serrano"
        ],
        "description": "Topics vary. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Intro To Islamic Civ &amp; Cul",
        "subjectCode": "LC",
        "courseCode": "23000",
        "instructor": [
            "Ahmed Idrissi Alami"
        ],
        "description": "(CMPL 23000) Foundations for comparison of works in different languages, thematic (philosophical, sociological, psychological) and structural (genre, composition, use of linguistic devices); parallel interrelation of theme and structure in works of different literatures. The importance of literary norms and systems of genres. Examination of crosscurrents in different literatures during successive periods of development.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "East Asian Literature In Translation",
        "subjectCode": "LC",
        "courseCode": "23500",
        "instructor": [
            "Daniel Hsieh"
        ],
        "description": "Reading and discussion of selected East Asian poetry, prose, and drama. Focus will be on the traditions of China and Japan, but may include works of other cultures such as Korea. Emphasis may vary yearly, stressing traditional or modern literatures.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To The Linguistic Study Of Foreign Languages",
        "subjectCode": "LC",
        "courseCode": "26100",
        "instructor": [
            "Eunice Opoku",
            "Golsa Khodadadi",
            "Chien-Min Kuo",
            "Vanessa Sheu"
        ],
        "description": "Overview of linguistics and the role of language in society; fundamental concepts of linguistic analysis. The course focuses on linguistic phenomena found in French, German, Russian, and Spanish, with material, examples, and assignments drawn primarily from those languages whenever appropriate.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To World Food Cultures",
        "subjectCode": "LC",
        "courseCode": "28100",
        "instructor": [
            "Sarah N Jaran"
        ],
        "description": "&nbsp; This course introduces students to global food culture and world gastronomy. It covers different aspects of food studies such as food representations in art and literature, national identity, culinary traditions, and world trade and migration in respect to food. This course will give students a broad overview of the relation between food and many other disciplines, allowing them to connect the topics addressed to their own fields of study. Conducted in English. No prerequisites.&nbsp;",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "The Middle Ages On Film",
        "subjectCode": "LC",
        "courseCode": "33300",
        "instructor": [
            "Paula E Leverage"
        ],
        "description": "Introduction to the Middle Ages through films in various languages and genres from the beginning of film history to the present. Reading literary, historical, legal, and film theory texts in conjunction with the films, students critically analyze representations of the Middle Ages and the cultural context from which these emerge.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Phonetics Of Foreign Languages",
        "subjectCode": "LC",
        "courseCode": "37100",
        "instructor": [
            "Alexander L Francis"
        ],
        "description": "Introduction to articulatory phonetics for students of foreign languages. Mechanisms of production of speech sounds. Production and discrimination of sounds of other languages; contrast with English sounds; practice in pronunciation and phonetic transcription. Introduction to the International Phonetic Alphabet (IPA). Credit will not be awarded for more than one of SLHS 30600, LING 31500, and LC 37100.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Theories Of Teaching World Languages",
        "subjectCode": "LC",
        "courseCode": "47500",
        "instructor": [
            "Melinda Dianne White"
        ],
        "description": "This course is designed to assist you in the process of becoming a skilled professional who can teach world language(s). You will develop an understanding of the connection between effective language teaching and successful language learning, be able to think critically about your own teaching and teaching materials, and gain an understanding of various theories, methods, approaches, and techniques in world language teaching. Areas of emphasis include the nature of language learning theories, early approaches to language pedagogy, communicative language teaching methodology, the relationship between theory and practice, aspects of interaction between speakers in the classroom, skills-based theories, sociocultural perspectives, individual differences between learners, and usage-based approaches to second language acquisition.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Bible &amp; Early Intrpret",
        "subjectCode": "LC",
        "courseCode": "49000",
        "instructor": [
            "Alon Kantor",
            "Olga V Lyanda-Geller"
        ],
        "description": "Topics vary. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Historical Linguistics",
        "subjectCode": "LC",
        "courseCode": "56300",
        "instructor": [
            "John D Sundquist"
        ],
        "description": "(ANTH 56300, ENGL 56300) A survey of mechanisms and motivations of linguistic change. Topics include phonological, morphological, semantic and syntactic change, comparative and internal reconstruction, linguistic variation, language contact, and linguistic typology.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Sociolinguistics",
        "subjectCode": "LC",
        "courseCode": "56500",
        "instructor": [
            "Felicia D Roberts"
        ],
        "description": "(ANTH 56500, COM 56500, ENGL 56500) An introduction to language in its social context, focusing on uses and users of language. Topics include social class, ethnic group, gender, language attitudes, and bilingualism.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Semiotics",
        "subjectCode": "LC",
        "courseCode": "57000",
        "instructor": [
            "Myrdene Anderson"
        ],
        "description": "(ANTH 51900, SLHS 58900, COM 50700, ENGL 57000) The study of languages, literatures, and other systems of human communication. Includes a wide range of phenomena that can be brought together by means of a general theory of signs. The course deals with three fundamental areas: 1) verbal communication, 2) nonverbal communication (iconic systems, gestures, body language, etc.), and 3) communication through art forms.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Methods Of Experimental Research In Linguistics",
        "subjectCode": "LC",
        "courseCode": "57300",
        "instructor": [
            "Olga Dmitrieva"
        ],
        "description": "The course is an overview of experimental methods used in linguistic research. The goal of the course is to introduce basic concepts, terminology, and procedures associated with experimental research in general, and to survey the types of experiments typically conducted in several major subfields of linguistics, including the associated experiment designs and approaches to data analysis. The course will focus mainly on designing and conducting the experiment, rather than on data analysis, although the data analysis techniques appropriate to the types of data will be briefly discussed whenever possible. The course will also cover additional topics such as ethics of experimental research (preparing an IRB protocol), doing background research, getting funding, choosing the right conference for presenting the results, writing a conference abstract, creating and delivering a conference presentation/poster, and writing up the results for publication.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Language Acquisition",
        "subjectCode": "LC",
        "courseCode": "59600",
        "instructor": [
            "Alejandro Cuza-Blanco",
            "Elsayed Sabry Abdelaal Issa"
        ],
        "description": "Special topics in Linguistics. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            4
        ],
        "term": "Spring 2024"
    }
]