[
    {
        "title": "Mathematics For Elementary Teachers I",
        "subjectCode": "MA",
        "courseCode": "13700",
        "instructor": [
            "Jennifer Michelle Fitch",
            "Brooke M Max"
        ],
        "description": "Designed for prospective elementary school teachers. Problem solving. Numerical reasoning including self-generated and conventional algorithms. Whole and fractional number systems, elementary number theory. (Not available for credit toward graduation in the College of Science.)",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Mathematics For Elementary Teachers II",
        "subjectCode": "MA",
        "courseCode": "13800",
        "instructor": [
            "Jennifer Michelle Fitch"
        ],
        "description": "Elementary school teachers must understand how multiplication gives rise to exponents and how to represent, interpret, and compute exponents from problem situations. They must also understand how to represent practical situations using algebraic and fractional expressions, and verbally interpret graphs of functions. They have to know basic concepts of probability theory. This course covers conceptual and practical notions of exponents and radicals; algebraic and rational functions, algebraic equations and inequalities, systems of linear equations, polynomial, exponential, and logarithmic functions. Notions of probability.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Mathematics For Elementary Teachers III",
        "subjectCode": "MA",
        "courseCode": "13900",
        "instructor": [
            "Brooke M Max"
        ],
        "description": "Geometric, measurement and spatial reasoning in one, two and three dimensions as the basis for elementary school geometry. Metric and non-metric geometry, transformation geometry. (Not available for credit toward graduation in the College of Science.)",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "College Algebra",
        "subjectCode": "MA",
        "courseCode": "15300",
        "instructor": [
            "TBA"
        ],
        "description": "Exponents and radicals; algebraic and fractional expressions. Equations and inequalities, systems of linear equations. Polynomial, exponential, and logarithmic functions.  Not open to students with credit in MA 15900. Not available for credit toward graduation in the School of Science. CTL:IMA 1601 College Algebra",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Quantitative Reasoning",
        "subjectCode": "MA",
        "courseCode": "15555",
        "instructor": [
            "Timothy J Delworth"
        ],
        "description": "This course will cover important mathematical ideas, including proportion, weighted averages, linear models, exponential models, basic probability and statistics, and some algebra, by using concrete real-world problems. It will not be a prerequisite for any other mathematics course. CTL: Quantitative Reasoning",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Precalculus",
        "subjectCode": "MA",
        "courseCode": "15800",
        "instructor": [
            "Jakayla R Robbins",
            "Jill Danielle Shalabi"
        ],
        "description": "Functions, Trigonometry, and Algebra of calculus topics designed to fully prepare students for all first semester calculus courses. Functions topics include Quadratic, Higher Order Polynomials, Rational, Exponential, Logarithmic, and Trigonometric. Other focuses include graphing of functions and solving application problems. Not Available for credit toward graduation in the College of Science. Students may not receive credit for both MA 15400 and MA 15800. Students may not receive credit for both MA 15900 and MA 15800.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Applied Calculus I",
        "subjectCode": "MA",
        "courseCode": "16010",
        "instructor": [
            "Raymond Leonard Polak",
            "Brian K Cheek",
            "Jerry D Porter",
            "April Isom-Tyler",
            "Allan Edward Bickle",
            "Joseph D Kintzel",
            "Timothy J Delworth",
            "Heather R Krebs",
            "Huimei Delgado"
        ],
        "description": "Topics include trigonometric and exponential functions; limits and differentiation, rules of differentiation, maxima, minima and optimization; curve sketching, integration, anti-derivatives, fundamental theorem of calculus. Properties of definite integrals and numerical methods. Applications to life, managerial and social sciences. CTL:IMA 1604 Calculus - Short I",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Applied Calculus II",
        "subjectCode": "MA",
        "courseCode": "16020",
        "instructor": [
            "Susitha Hapuarachchige Karunaratne",
            "Nathan H Schiefer",
            "April Isom-Tyler",
            "Jakayla R Robbins",
            "David M Norris"
        ],
        "description": "This course covers techniques of integration; infinite series, convergence tests; differentiation and integration of functions of several variables; maxima and minima, optimization; differential equations and initial value problems; matrices, determinants, eigenvalues and eigenvectors. Applications. CTL:IMA 1605 Calculus - Short II",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Plane Analytic Geometry And Calculus I",
        "subjectCode": "MA",
        "courseCode": "16100",
        "instructor": [
            "Daniel Lentine Johnstone"
        ],
        "description": "Introduction to differential and integral calculus of one variable, with applications. Some schools or departments may allow only 4 credit hours toward graduation for this course. Designed for students who have not had at least a one-semester calculus course in high school, with a grade of \"A\" or \"B\". Not open to students with credit in MA 16500. Demonstrated competence in college algebra and trigonometry.",
        "capacity": 0,
        "credits": [
            5,
            5
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Plane Analytic Geometry And Calculus II",
        "subjectCode": "MA",
        "courseCode": "16200",
        "instructor": [
            "Shuyi Weng",
            "Dominic J Naughton"
        ],
        "description": "Continuation of MA 16100. Vectors in two and three dimensions, techniques of integration, infinite series, conic sections, polar coordinates, surfaces in three dimensions. Some schools or departments may allow only 4 credit hours toward graduation for this course.",
        "capacity": 0,
        "credits": [
            5,
            5
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Analytic Geometry And Calculus II",
        "subjectCode": "MA",
        "courseCode": "16600",
        "instructor": [
            "Deepam P Patel",
            "Sai Kee Yeung"
        ],
        "description": "Continuation of MA 16500. Vectors in two and three dimensions. Techniques of integration, infinite series, polar coordinates, surfaces in three dimensions. Not open to students with credit in MA 16200. CTL:IMA 1603 Calculus - Long II",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Problem Solving In Probability",
        "subjectCode": "MA",
        "courseCode": "25000",
        "instructor": [
            "TBA"
        ],
        "description": "(STAT 25000) This course is designed to teach techniques for solving problems in probability theory which are relevant to the actuarial sciences. It is intended to help actuarial students prepare for the Society of Actuaries and Casualty Actuarial Society Exam P/1. Credit of Examination is not available for this course.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Multivariate Calculus",
        "subjectCode": "MA",
        "courseCode": "26100",
        "instructor": [
            "Andrew S Toms",
            "Mahesh Sunkula"
        ],
        "description": "Planes, lines, and curves in three dimensions. Differential calculus of several variables; multiple integrals. Introduction to vector calculus. Not open to students with credit in MA 27100.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Linear Algebra And Differential Equations",
        "subjectCode": "MA",
        "courseCode": "26200",
        "instructor": [
            "Antonio C Sa Barreto",
            "Peijun Li",
            "Heejong Lee",
            "Min Chen",
            "Jianlin Xia"
        ],
        "description": "Linear algebra, elements of differential equations. Not open to students with credit in MA 26500 or 26600.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Linear Algebra",
        "subjectCode": "MA",
        "courseCode": "26500",
        "instructor": [
            "Yiran Wang",
            "Ping Xu",
            "Oleksandr Tsymbaliuk",
            "Yi Wang",
            "Raymond Leonard Polak",
            "Eric Griffin Samperton",
            "Ying Zhang",
            "Deepam P Patel",
            "Sai Kee Yeung",
            "Arun Albert Debray",
            "Jing Wang",
            "Daniel Lentine Johnstone",
            "Krishnendu Khan",
            "Ning Wei",
            "Daniel Tuan-Dan Le",
            "Andrey Glubokov",
            "Siamak Yassemi"
        ],
        "description": "Introduction to linear algebra. Systems of linear equations, matrix algebra, vector spaces, determinants, eigenvalues and eigenvectors, diagonalization of matrices, applications. Not open to students with credit in MA 26200, 27200, 35000 or 35100.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Ordinary Differential Equations",
        "subjectCode": "MA",
        "courseCode": "26600",
        "instructor": [
            "Shuyi Weng",
            "Heejin Lee",
            "Guang Yang",
            "Moongyu Park",
            "Gayane Poghotanyan",
            "Ying Liang",
            "Jiahao Zhang",
            "Alexandria V Volkening"
        ],
        "description": "First order equations, second and n'th order linear equations, series solutions, solution by Laplace transform, systems of linear equations. It is preferable but not required to take MA 26500 either first or concurrently. Not open to students with credit in MA 26200, 27200, 36000, 36100, or 36600.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Modern Mathematics In Science And Society",
        "subjectCode": "MA",
        "courseCode": "27900",
        "instructor": [
            "Brooke M Max"
        ],
        "description": "The course covers  topics in combinatorics and probability applied to real life situations such as the paradoxa of democracy, weighted voting, fair division, apportionment, traveling salesmen, the mathematics of networks, Fibonacci numbers, golden ratio, growth patterns in nature, mathematics of money, symmetry, fractals, censuses and surveys,  random sampling, sample spaces, permutations and uniform probability spaces.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "An Introduction To Proof Through Real Analysis",
        "subjectCode": "MA",
        "courseCode": "30100",
        "instructor": [
            "TBA"
        ],
        "description": "An introduction to abstract reasoning in the context of real analysis. Topics may include axioms for the real numbers, mathematical induction, formal definition of limits, density, decimal representations, convergence of sequences and series, continuity, differentiability, the extreme value, mean value and intermediate value theorems, and cardinality. The emphasis, however, is more on the concept of proof than on any one given topic.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Differential Equations And Partial Differential Equations For Engineering And The Sciences",
        "subjectCode": "MA",
        "courseCode": "30300",
        "instructor": [
            "Michelle Michelle",
            "Di Qi",
            "Kuan-Hua J Chen",
            "Chen Liu",
            "Kaitlyn T Hood",
            "Jaroslaw Wlodarczyk",
            "Changyou Wang"
        ],
        "description": "This is a methods course for juniors in any branch of engineering and science, designed to follow MA 26200 or MA 26600. Materials to be covered are: linear systems of ordinary differential equations, nonlinear systems, Fourier series, separation of variables for partial differential equations, and Sturm-Liouville theory.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Foundations Of Analysis",
        "subjectCode": "MA",
        "courseCode": "34100",
        "instructor": [
            "Steven R Bell",
            "Marius D Dadarlat",
            "Andrew S Toms",
            "David B Mcreynolds",
            "Manuel Luis Rivera"
        ],
        "description": "An introductory course in rigorous analysis, covering real numbers, sequences, series, continuous functions, differentiation, and Riemann integration. MA 30100 is helpful but not required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Signals And Systems For Mathematicians",
        "subjectCode": "MA",
        "courseCode": "34900",
        "instructor": [
            "Kaitlyn T Hood"
        ],
        "description": "This course introduces the mathematical framework for the description, analysis and processing of signals such as music, speech and images. Main topics covered include signal representations in different bases; continuous-time signal sampling; and signal processing by linear and time-invariant systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Elementary Linear Algebra",
        "subjectCode": "MA",
        "courseCode": "35100",
        "instructor": [
            "Jeremy K Miller",
            "Rongjie Lai",
            "Johnny E Brown",
            "Yilong Zhang",
            "Isaac Harris",
            "Ayan Maiti",
            "Anurag Sahay"
        ],
        "description": "Systems of linear equations, finite dimensional vector spaces, matrices, determinants, eigenvalues and eigenvector applications to analytical geometry. Not open to students with credit in MA 26500.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Linear Algebra II",
        "subjectCode": "MA",
        "courseCode": "35301",
        "instructor": [
            "James E Mcclure",
            "William J Heinzer"
        ],
        "description": "Theoretical background for methods and results that appear in MA 35100. Inner products, orthogonality, and applications including least squares.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Topics In Vector Calculus",
        "subjectCode": "MA",
        "courseCode": "36200",
        "instructor": [
            "Zhiqiang Cai"
        ],
        "description": "Multivariate calculus; partial differentiation; implicit function theorems and transformations; line and surface integrals; vector fields; theorems of Gauss, Green, and Stokes. Credit granted for only one of MA 36200 and 51000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Ordinary Differential Equations",
        "subjectCode": "MA",
        "courseCode": "36600",
        "instructor": [
            "Suchuan Dong",
            "Nicholas James Mccleerey"
        ],
        "description": "An introduction to ordinary differential equations with emphasis on problem solving and applications. The one-hour computer lab will give students an opportunity for hands-on experience with both the theory and applications of the subject.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Financial Mathematics",
        "subjectCode": "MA",
        "courseCode": "37300",
        "instructor": [
            "TBA"
        ],
        "description": "A mathematical treatment of some fundamental concepts of financial mathematics and their application to real world business situations and basic risk management. Includes discussions of valuing investments, capital budgeting, valuing contingent cash flows, yield curves, spot rates, forward rates, short sales, Macaulay duration, modified duration, convexity, and immunization. Provides preparation for the SOA/CAS Actuarial Exam FM/2.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Discrete Mathematics",
        "subjectCode": "MA",
        "courseCode": "37500",
        "instructor": [
            "Philip P Mummert"
        ],
        "description": "Induction, permutations, combinations, finite probability, relations, graphs, trees, graph algorithms, recurrence relations, generating functions. Problem solving in all these areas. Credit granted for only one of MA 27600 and 37500.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Logic",
        "subjectCode": "MA",
        "courseCode": "38500",
        "instructor": [
            "Margaret E M Thomas"
        ],
        "description": "Propositional calculus and predicate calculus with applications to mathematical proofs, valid arguments, switching theory, and formal languages.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Probability",
        "subjectCode": "MA",
        "courseCode": "41600",
        "instructor": [
            "Takashi Owada",
            "Christian James Noack",
            "Andrey Glubokov",
            "Lin Wang"
        ],
        "description": "(STAT 41600) An introduction to mathematical probability suitable as a preparation for actuarial science, statistical theory, and mathematical modeling. General probability rules, conditional probability and Bayes theorem, discrete and continuous random variables, moments and moment generating functions, joint and conditional distributions, standard discrete and continuous distributions and their properties, law of large numbers and central limit theorem.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Elements Of Complex Analysis",
        "subjectCode": "MA",
        "courseCode": "42500",
        "instructor": [
            "Steven R Bell"
        ],
        "description": "Complex numbers and complex-valued functions; differentiation of complex functions; power series, uniform convergence; integration, contour integrals; elementary conformal mapping.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Fourier Analysis",
        "subjectCode": "MA",
        "courseCode": "42800",
        "instructor": [
            "Arshak Petrosyan"
        ],
        "description": "Topics include: Fourier series, convolutions, kernels, summation methods, Fourier transforms, and applications to the wave, heat, and Laplace equations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Honors Real Analysis II",
        "subjectCode": "MA",
        "courseCode": "44200",
        "instructor": [
            "Kiril Datchev"
        ],
        "description": "Real analysis in one and n-dimensional Euclidean spaces--continued from MA 44000. Topics include mappings of Euclidean spaces and their derivatives, multivariable chain rule, inverse function theorem and implicit function theorem, sets with content and integration in n dimensions, the integrability theorem, Jacobian and change of variables theorem, related topics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Elements Of Algebra I",
        "subjectCode": "MA",
        "courseCode": "45300",
        "instructor": [
            "Saugata Basu",
            "Baiying Liu"
        ],
        "description": "Fundamental properties of integers, polynomials, groups, rings, and fields, with emphasis on problem solving and applications. Not open to students with credit in MA 45000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Galois Theory Honors",
        "subjectCode": "MA",
        "courseCode": "45401",
        "instructor": [
            "Trevor Dion Wooley"
        ],
        "description": "This course will give a thorough introduction to Galois theory. Galois theory is a fundamental tool in many areas of mathematics, including number theory and algebraic geometry. This course will increase students' mathematical maturity and prepare them for graduate school. Topics include finite extension fields and their symmetries, ruler and compass constructions, complex roots of unity, solvable groups, and the solvability of polynomial equations by arithmetic and radical operations. This course is intended for third- or fourth-year students who have taken MA 45000 (Algebra Honors) or MA 45300 (Elements of Algebra I).",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Actuarial Models-Life Contingencies",
        "subjectCode": "MA",
        "courseCode": "47201",
        "instructor": [
            "Sally Anne Ray"
        ],
        "description": "Mathematical foundation of actuarial science, emphasizing probability models for life contingencies as the basis for analyzing life insurance and life annuities and determining premiums and reserves. This course provides the background for Course MLC of the Society of Actuaries and Course 3L of the Casualty Actuarial Society.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Adv Short-Term Act Math",
        "subjectCode": "MA",
        "courseCode": "49000",
        "instructor": [
            "Thomas J Sinclair",
            "Jianxi Su"
        ],
        "description": "Supervised reading courses as well as special topics courses for undergraduates are given under this number. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            6
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Partial Differential Equations",
        "subjectCode": "MA",
        "courseCode": "49500",
        "instructor": [
            "Kiril Datchev",
            "Allan Edward Bickle"
        ],
        "description": "&nbsp; Advanced topics courses in mathematics for undergraduates are given under this number. Permission of instructor required.&nbsp;",
        "capacity": 0,
        "credits": [
            1,
            5
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Real Analysis",
        "subjectCode": "MA",
        "courseCode": "50400",
        "instructor": [
            "Matthew Dominick Novack"
        ],
        "description": "Completeness of the real number system, basic topological properties, compactness, sequences and series, absolute convergence of series, rearrangement of series, properties of continuous functions, the Riemann-Stieltjes integral, sequences and series of functions, uniform convergence, the Stone-Weierstrass theorem, equicontinuity, and the Arzela-Ascoli theorem.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Vector Calculus",
        "subjectCode": "MA",
        "courseCode": "51000",
        "instructor": [
            "Andrei Gabrielov"
        ],
        "description": "Calculus of functions of several variables and of vector fields in orthogonal coordinate systems. Optimization problems, implicit function theorem, Green's theorem, Stokes' theorem, divergence theorems. Applications to engineering and the physical sciences. Not open to students with credit in MA 36200 or 41000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Linear Algebra With Applications",
        "subjectCode": "MA",
        "courseCode": "51100",
        "instructor": [
            "Ralph Martin Kaufmann"
        ],
        "description": "Real and complex vector spaces; linear transformations; Gram-Schmidt process and projections; least squares; QR and LU factorization; diagonalization, real and complex spectral theorem; Schur triangular form; Jordan canonical form; quadratic forms.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Numerical Analysis",
        "subjectCode": "MA",
        "courseCode": "51400",
        "instructor": [
            "Alex Pothen"
        ],
        "description": "(CS 51400) Iterative methods for solving nonlinear; linear difference equations, applications to solution of polynomial equations; differentiation and integration formulas; numerical solution of ordinary differential equations; roundoff error bounds.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Probability",
        "subjectCode": "MA",
        "courseCode": "51900",
        "instructor": [
            "Nianqiao Ju"
        ],
        "description": "(STAT 51900) Algebra of sets, sample spaces, combinatorial problems, independence, random variables, distribution functions, moment generating functions, special continuous and discrete distributions, distribution of a function of a random variable, limit theorems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Boundary Value Problems Of Differential Equations",
        "subjectCode": "MA",
        "courseCode": "52000",
        "instructor": [
            "Nung Kwan Yip"
        ],
        "description": "Separation of variables; Fourier series; boundary value problems; Fourier transforms; Bessel functions; Legendre polynomials.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Mathematics For Engineers And Physicists I",
        "subjectCode": "MA",
        "courseCode": "52700",
        "instructor": [
            "Gregery T Buzzard"
        ],
        "description": "MA 52700 is not a prerequisite for MA 52800; these courses can be taken independently. Topics in MA 52700 include linear algebra, systems of ordinary differential equations, Laplace transforms, Fourier series and transforms, and partial differential equations. MA 51100 is recommended.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Mathematics For Engineers And Physicists II",
        "subjectCode": "MA",
        "courseCode": "52800",
        "instructor": [
            "Philip P Mummert"
        ],
        "description": "MA 52700 is not a prerequisite for MA 52800; these courses can be taken independently. Topics in MA 52800 include divergence theorem, Stokes theorem, complex variables, contour integration, calculus of residues and applications, conformal mapping, and potential theory. MA 51000 is recommended.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Functions Of A Complex Variable I",
        "subjectCode": "MA",
        "courseCode": "53000",
        "instructor": [
            "Alexandre Eremenko"
        ],
        "description": "Complex numbers and complex-valued functions of one complex variable; differentiation and contour integration; Cauchy's theorem; Taylor and Laurent series; residues; conformal mapping; special topics. More mathematically rigorous than MA 52500.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Elements Of Stochastic Processes",
        "subjectCode": "MA",
        "courseCode": "53200",
        "instructor": [
            "Samy Tindel"
        ],
        "description": "(STAT 53200) A basic course in stochastic models, including discrete and continuous time Markov chains and Brownian motion, as well as an introduction to topics such as Gaussian processes, queues, epidemic models, branching processes, renewal processes, replacement, and reliability problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Probability Theory I",
        "subjectCode": "MA",
        "courseCode": "53800",
        "instructor": [
            "Christopher Janjigian"
        ],
        "description": "(STAT 53800) Mathematically rigorous, measure-theoretic introduction to probability spaces, random variables, independence, weak and strong laws of large numbers, conditional expectations, and martingales.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Ordinary Differential Equations And Dynamical Systems",
        "subjectCode": "MA",
        "courseCode": "54300",
        "instructor": [
            "Yuan Gao"
        ],
        "description": "This course focuses on the theory of ordinary differential equations and methods of proof for developing this theory. Topics include basic results for linear systems, the local theory for nonlinear systems (existence and uniqueness, dependence on parameters, flows and linearization, stable manifold theorem) and the global theory for nonlinear systems (global existence, limit sets and periodic orbits, Poincare maps). Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Real Analysis And Measure Theory",
        "subjectCode": "MA",
        "courseCode": "54400",
        "instructor": [
            "Rodrigo Banuelos"
        ],
        "description": "Metric space topology; continuity, convergence; equicontinuity; compactness; bounded variation, Helly selection theorem; Riemann-Stieltjes integral; Lebesgue measure; abstract measure spaces; LP-spaces; Holder and Minkowski inequalities; Riesz-Fischer theorem.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Functional Analysis",
        "subjectCode": "MA",
        "courseCode": "54600",
        "instructor": [
            "Marius D Dadarlat"
        ],
        "description": "Fundamentals of functional analysis. Banach spaces, Hahn-Banach theorem. Principle of uniform boundedness. Closed graph and open mapping theorems. Applications. Hilbert spaces. Orthonormal sets. Spectral theorem for Hermitian operators and compact operators. Typically offered Fall.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Abstract Algebra",
        "subjectCode": "MA",
        "courseCode": "55300",
        "instructor": [
            "Freydoon Shahidi"
        ],
        "description": "Group theory: Sylow theorems, Jordan Hlder theorem, solvable groups. Ring theory: unique factorization in polynomial rings and principal ideal domains. Field theory: ruler and compass constructions, roots of unity, finite fields, Galois theory, solvability of equations by radicals.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Linear Algebra",
        "subjectCode": "MA",
        "courseCode": "55400",
        "instructor": [
            "William J Heinzer"
        ],
        "description": "Review of basics: vector spaces, dimension, linear maps, matrices determinants, linear equations. Bilinear forms; inner product spaces; spectral theory; eigenvalues. Modules over a principal ideal domain; finitely generated abelian groups; Jordan and rational canonical forms for a linear transformation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Abstract Algebra II",
        "subjectCode": "MA",
        "courseCode": "55800",
        "instructor": [
            "Vaibhav Pandey"
        ],
        "description": "A continuation of MA 55700.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Differential Geometry And Topology",
        "subjectCode": "MA",
        "courseCode": "56200",
        "instructor": [
            "Harold G Donnelly"
        ],
        "description": "Smooth manifolds; tangent vectors; inverse and implicit function theorems; submanifolds; vector fields; integral curves; differential forms; the exterior derivative; DeRham cohomology groups; surfaces in E3., Gaussian curvature; two dimensional Riemannian geometry; Gauss-Bonnet and Poincare theorems on vector fields.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction In Algebraic Topology",
        "subjectCode": "MA",
        "courseCode": "57200",
        "instructor": [
            "Xingshan Cui"
        ],
        "description": "Singular homology theory; Eilenberg-Steenrod axioms; simplicial and cell complexes; elementary homotopy theory; Lefschetz fixed point theorem.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Intro To Additive Combinatoric",
        "subjectCode": "MA",
        "courseCode": "59500",
        "instructor": [
            "Oleksandr Tsymbaliuk",
            "Eric Griffin Samperton",
            "Allan Edward Bickle",
            "Sam Nariman",
            "Thomas J Sinclair",
            "Daniel Tuan-Dan Le",
            "Monica Torres",
            "Kiril Datchev"
        ],
        "description": "Special topics courses including dual-level special topics. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            5
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Probability Seminar",
        "subjectCode": "MA",
        "courseCode": "59800",
        "instructor": [
            "Christopher Janjigian"
        ],
        "description": "Supervised reading courses as well as dual-level special topics courses are given under this number. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            5
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Numerical Methods For Partial Differential Equations I",
        "subjectCode": "MA",
        "courseCode": "61500",
        "instructor": [
            "Xiangxiong Zhang"
        ],
        "description": "(CS 615) Finite element method for elliptic partial differential equations; weak formulation; finite-dimensional approximations; error bounds; algorithmic issues; solving sparse linear systems; finite element method for parabolic partial differential equations; backward difference and Crank-Nicholson time-stepping; introduction to finite difference methods for elliptic, parabolic, and hyperbolic equations; stability, consistency, and convergence; discrete maximum principles. Prerequisite: MA 51400, 52300.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Methods Of Partial Differential Equations II",
        "subjectCode": "MA",
        "courseCode": "64300",
        "instructor": [
            "Changyou Wang"
        ],
        "description": "Continuation of MA 642. Topics to be covered are Lp theory for solutions of elliptic equations, including Moser's estimates, Aleksandrov maximum principle, and the Calderon-Zygmund theory. Introduction to evolution problems for parabolic and hyperbolic equations, including Galerkin approximation and semigroup methods. Applications to nonlinear problems. Prerequisite: MA 64200.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Algebraic Geometry",
        "subjectCode": "MA",
        "courseCode": "66500",
        "instructor": [
            "Donu V B Arapura"
        ],
        "description": "Topics of current interest will be chosen by the instructor. Prerequisite: MA 65000 or 66300.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    }
]