[
    {
        "title": "Introduction To Organizational Behavior",
        "subjectCode": "OBHR",
        "courseCode": "33000",
        "instructor": [
            "Tobias Dennerlein",
            "Jordan Douglas Nielsen",
            "Joel Munoz",
            "Jonathan G Ying"
        ],
        "description": "This course investigates the impact that individuals, groups, and organizational structure have on behavior within organizations for the purpose of applying such knowledge toward improving an organization's effectiveness. Attention is given to such topics as motivation, leadership, group processes, organizational structure, technological innovation, and conflict management. Emphasis is placed on developing management skills and application of organizational behavior theories.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Organizational Development And Consulting",
        "subjectCode": "OBHR",
        "courseCode": "65200",
        "instructor": [
            "Michael A Campion"
        ],
        "description": "Organizational development (OD) refers to the application of behavioral sciences knowledge and techniques to improve organizational effectiveness (e.g., productivity, quality, service, employee satisfaction, etc.). The course will describe techniques for diagnosing organizations and interventions for improving organizations. Specific interventions will be examined in detail including structural interventions (e.g., organizational design, job design), interpersonal process interventions (e.g., process consultation, team building), and human resource interventions (e.g., performance management, career development). The course will attempt to both build knowledge and provide practice in the various techniques. The course will not duplicate material in other current course offerings by this professor, and it will not require prior courses in human resources.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Individual Behavior In Organizations",
        "subjectCode": "OBHR",
        "courseCode": "68300",
        "instructor": [
            "Kelly S Wilson"
        ],
        "description": "This seminar provides an analysis of theory and research on individual and group behavior in organizations. Readings and discussion focus on motivation, attitudes and job satisfaction, employee participation and turnover, stress, leadership, group processes, and other issues.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    }
]