[
    {
        "title": "American Government And Politics",
        "subjectCode": "POL",
        "courseCode": "10100",
        "instructor": [
            "Martin Jay Sweet"
        ],
        "description": "A study of the nature of democratic government, the U.S. Constitution, federalism, civil rights, political dynamics, the presidency, Congress, and the judiciary. CTL:ISH 1002 American Government",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Public Policy And Public Administration",
        "subjectCode": "POL",
        "courseCode": "12000",
        "instructor": [
            "Michael Roderick Brownstein"
        ],
        "description": "An introduction to the fields of public policy and public administration. Processes of policy formation and administration are examined. Different approaches to evaluating and improving public policies are discussed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To International Relations",
        "subjectCode": "POL",
        "courseCode": "13000",
        "instructor": [
            "Kyle E Haynes"
        ],
        "description": "An analysis of the fundamentals of international law, organization, and politics, particularly as relevant to contemporary international relations. CTL:ISH 1003 Introduction To World Politics",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Governments Of The World",
        "subjectCode": "POL",
        "courseCode": "14100",
        "instructor": [
            "John W T Megson"
        ],
        "description": "An introduction to the politics and government in selected foreign countries. The course presents the tools and background needed to understand contemporary events in the world beyond the United States. Readings and discussions pay special attention to democratization and development.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Women, Politics, And Public Policy",
        "subjectCode": "POL",
        "courseCode": "22200",
        "instructor": [
            "Rosalee A Clawson"
        ],
        "description": "An introduction to women's participation in politics, with an emphasis on America. Structural and attitudinal conditions limiting women's political roles and contemporary efforts to change women's status in society through politics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Environmental Policy",
        "subjectCode": "POL",
        "courseCode": "22300",
        "instructor": [
            "TBA"
        ],
        "description": "(FNR 22310)  Study of decision making as modern societies attempt to cope with environmental and natural resources problems. Focuses on the American political system, with some attention to the international dimension. Current policies and issues will be examined.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Data Science And Public Policy",
        "subjectCode": "POL",
        "courseCode": "22800",
        "instructor": [
            "Bryce Jensen Dietrich"
        ],
        "description": "This course is an introduction to the politics and policies of data science and \"big data\". Students will (1) gain an understanding of how public policy is made, including the role of data in policymaking; (2) learn about whether and what policies govern the use of data in various applications (such as autonomous vehicles, ownership of health care data, etc.); and (3) explore the ethical, legal, and social implications of data science and big data.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To United States Foreign Policy",
        "subjectCode": "POL",
        "courseCode": "23100",
        "instructor": [
            "Alexander Thomas Wilhelm"
        ],
        "description": "Designed to introduce students to the major themes and issues in contemporary U.S. foreign policy. Lectures, discussion, and readings will examine such areas as U.S. relationships with the major powers, the Third World, and international organizations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "The Politics Of Terrorism",
        "subjectCode": "POL",
        "courseCode": "23400",
        "instructor": [
            "Melissa C Will"
        ],
        "description": "This class examines the phenomenon of terrorism and counterterrorism. Why do terrorists do what they do? What can governments do to stop them? We will begin with issues of definition, and theoretical and empirical approaches to the study of terrorism. We will then delve into the history and evolution of the tactic (taking time to study some of the more notorious organizations). At this point in time it is critical that we look at both domestic--particularly in the United States--and transnational forms of terrorism. The study of terrorism is rife with puzzles that we will explore. Why resort to violence in the first place? How and why do groups evolve over time? How and why do some groups end, and others continue for years? Why are some individuals/groups not classified as terrorists? What are the consequences of terrorism? We will also look closely at counterterrorism policy. What are the most effective ways to respond to terrorism? What doesn't work? How do policies differ between states? To what extent is there global cooperation on counterterrorism? We will conclude the class by taking a critical look at US counterterrorism policy and the massive counterterrorism apparatus that has developed in the aftermath of the attacks of September 11, 2001. Should counterterrorism dominate US national security priorities to the degree it does?",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "International Relations Among Rich And Poor Nations",
        "subjectCode": "POL",
        "courseCode": "23500",
        "instructor": [
            "William Adam Dory"
        ],
        "description": "Introduction to the major themes in the contemporary international relations among rich and poor nations. Examines such areas as North-South relations, interdependence, international organizations, and global development.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Modern Weapons And International Relations",
        "subjectCode": "POL",
        "courseCode": "23700",
        "instructor": [
            "Keith L Shimko"
        ],
        "description": "This course introduces the student to the roles that modern weapons systems play in contemporary international relations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Political Analysis",
        "subjectCode": "POL",
        "courseCode": "30000",
        "instructor": [
            "Eric N Waltenburg"
        ],
        "description": "An introduction to the study of politics, its basic concepts and major areas of concern; also review of important research techniques, including methods of data collection and analysis.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Global Green Politics",
        "subjectCode": "POL",
        "courseCode": "32700",
        "instructor": [
            "TBA"
        ],
        "description": "Analysis and assessment of the nature of global environmentalism, its connections with other new social movements, and its impact on domestic and international politics worldwide, with particular attention to green political parties and nongovernmental organizations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Congress: Structure And Functioning",
        "subjectCode": "POL",
        "courseCode": "41100",
        "instructor": [
            "John W T Megson"
        ],
        "description": "A study of how Congress actually operates. Formal and informal power structures within both chambers and roles of the individual members of Congress are analyzed. Attention is directed to latent, as well as manifest, functions of legislative, investigative, and other major activities of Congress. The problem of bringing expertise to bear on the legislative process is considered throughout.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "US Politics And The Media",
        "subjectCode": "POL",
        "courseCode": "41500",
        "instructor": [
            "Jennifer E Hoewe"
        ],
        "description": "This course examines the roles and influences of the mass media on American politics generally and with particular emphasis on election campaigns and the evolving political culture of the United States.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "International Environmental Policy",
        "subjectCode": "POL",
        "courseCode": "42300",
        "instructor": [
            "Reed Michael Kurtz"
        ],
        "description": "Environmental policy development in the international arena, with attention to international law, international organizations, and transboundary environmental problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "The Politics Of Regulation",
        "subjectCode": "POL",
        "courseCode": "42800",
        "instructor": [
            "Logan R Strother"
        ],
        "description": "Politics and policies of federal and state regulatory agencies. Explanations of regulatory agency behavior, arguments for and against government regulation, and alternatives to government regulation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Research Collaboratory",
        "subjectCode": "POL",
        "courseCode": "42900",
        "instructor": [
            "Jason T Harris",
            "Eric N Waltenburg"
        ],
        "description": "Contemporary political problems in the United States affecting the interpretation of democracy, human rights and welfare, social pressures, and intergovernmental relations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Counter Terrorism",
        "subjectCode": "POL",
        "courseCode": "43000",
        "instructor": [
            "Anthony David Hustedt"
        ],
        "description": "An in-depth analysis of selected problems in international relations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "International Law",
        "subjectCode": "POL",
        "courseCode": "43500",
        "instructor": [
            "William Adam Dory"
        ],
        "description": "A study of international legal theories, principles, and practices, with an emphasis on the role and utility of law in contemporary international relations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "International Human Rights",
        "subjectCode": "POL",
        "courseCode": "43801",
        "instructor": [
            "Ann Marie Clark"
        ],
        "description": "This course exposes students to the politics of international human rights through reading, lectures, film, discussion, and student research. Topics include the concept of human rights, international law related to the protection of human rights, empirical research on political and economic causes of human rights violations in individual countries, and research on prevention efforts and remedies for past violations. This political science course is also part of Purdue's Human Rights Minor program.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Judicial Politics",
        "subjectCode": "POL",
        "courseCode": "46000",
        "instructor": [
            "Eric N Waltenburg"
        ],
        "description": "A survey of judicial processes as they operate in America. Both trial courts and appellate courts will be examined in light of the procedures with which they operate. The external social, economic, and political pressures surrounding courts and the impact courts have on society will be considered.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Constitutional Law I",
        "subjectCode": "POL",
        "courseCode": "46100",
        "instructor": [
            "Linda Lee Kampe"
        ],
        "description": "A survey of selected areas of constitutional law, considering the political and social influences as well as the doctrinal forces that have produced these policies and interpretations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Constitutional Law II",
        "subjectCode": "POL",
        "courseCode": "46200",
        "instructor": [
            "Martin Jay Sweet"
        ],
        "description": "An examination of the development of individual rights and civil liberties through constitutional law and interpretation of the Bill of Rights and Civil War Amendments. Both doctrinal and political pressures will be discussed to illustrate the evolution of these rights.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Digital Tech &amp; Pol",
        "subjectCode": "POL",
        "courseCode": "49100",
        "instructor": [
            "Tyler John Girard",
            "Rosalee A Clawson",
            "Miriam Marina Barnum"
        ],
        "description": "This is a variable-title seminar focusing on contemporary issues in political science at the senior level. It is part of the \"capstone\" experience for political science majors.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Intro Jewish Studies",
        "subjectCode": "POL",
        "courseCode": "49300",
        "instructor": [
            "Linda Lee Kampe",
            "Olga V Lyanda-Geller"
        ],
        "description": "An undergraduate seminar devoted to an interdisciplinary examination of social, economic, political, and intellectual movements, using the faculty resources of the participating departments. Subject matter will vary. Each offering of the seminar will be approved by a committee of department heads from the sponsoring departments. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Nuclear Strategy And Proliferation",
        "subjectCode": "POL",
        "courseCode": "53200",
        "instructor": [
            "Keith L Shimko"
        ],
        "description": "\"Nuclear Strategy and Proliferation\" is designed to teach students about 1) the conceptual elements and operational requirements of nuclear deterrence and 2) the historical dynamics of nuclear proliferation and nonproliferation. The goal of the class is to enable students to 1) evaluate the deterrent effects of different nuclear weapons and various configurations of nuclear arsenals and 2) analyze the technological, political and legal incentives and obstacles for acquiring nuclear weapons.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Research Design And Methods",
        "subjectCode": "POL",
        "courseCode": "60500",
        "instructor": [
            "Mollie Jane Cohen"
        ],
        "description": "Selection of research problems involving political phenomena; formulation of concepts and hypotheses; research design; data collection techniques; data processing, analysis, and interpretation, with attention to uses of high-speed facilities. Students will design a research project and, as appropriate, carry out the project in the laboratory or in the field. Prerequisite: POL 50100.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Qualitative Methods In Political Science",
        "subjectCode": "POL",
        "courseCode": "60800",
        "instructor": [
            "Ann Marie Clark"
        ],
        "description": "This course is an introduction to the use of qualitative methods in political science. In addition to a detailed consideration of several leading qualitative approaches to political research, the course will also consider the distinctive issues of research design for qualitative research as well as the relationship of qualitative and quantitative methods. Prerequisite: POL 50100 Political Science Methodology or equivalent or consent of instructor.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Applied Research Design",
        "subjectCode": "POL",
        "courseCode": "60900",
        "instructor": [
            "James A Mccann"
        ],
        "description": "The main goal of this seminar is to guide graduate students when preparing their Ph.D. dissertation proposals. The seminar aims to do two things. The first is to provide an overview of the crucial research design tools and research planning considerations that can help students plan and carry out better dissertation projects. The second is to offer a structured forum where students can present and receive feedback on their dissertation proposals. With permission from the Director of Graduate Studies, this course may be repeated and used to support the development of a grant proposal or research publication. Pre-requisite: POL 60000 with a grade B or better.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Res Seminar American Politics",
        "subjectCode": "POL",
        "courseCode": "61100",
        "instructor": [
            "Joan Carreras Timoneda"
        ],
        "description": "Topics vary. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Proseminar In Public Policy And Processes",
        "subjectCode": "POL",
        "courseCode": "62000",
        "instructor": [
            "Kaylyn Jackson Schiff"
        ],
        "description": "An introduction to public policy and processes as a field of graduate study with an emphasis on the literature.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Research Seminar In Public Policy And Public Administration",
        "subjectCode": "POL",
        "courseCode": "62200",
        "instructor": [
            "Joan Carreras Timoneda"
        ],
        "description": "Investigation in depth of a substantive aspect of public policy such as energy policy or social policy, or of a theoretical topic, for example, policy formulation, enactment, implementation, impact, or evaluation. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "ResSemr Environmental Policy",
        "subjectCode": "POL",
        "courseCode": "62300",
        "instructor": [
            "TBA"
        ],
        "description": "Investigation in depth of a substantive aspect of environmental policy or a theoretical approach to environmental policy, with emphasis on student research. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Research Seminar In International Relations",
        "subjectCode": "POL",
        "courseCode": "63100",
        "instructor": [
            "Kyle E Haynes"
        ],
        "description": "Topics vary. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Proseminar In Comparative Political Systems",
        "subjectCode": "POL",
        "courseCode": "64000",
        "instructor": [
            "Andrew Benjamin Baker"
        ],
        "description": "An introduction to comparative political systems, processes, and behavior as a field of graduate study with an emphasis on literature.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Comp Pol Res Seminar",
        "subjectCode": "POL",
        "courseCode": "64100",
        "instructor": [
            "Joan Carreras Timoneda"
        ],
        "description": "Topics vary. Prerequisite: POL 64000.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Professional Development Practicum",
        "subjectCode": "POL",
        "courseCode": "68500",
        "instructor": [
            "Logan R Strother"
        ],
        "description": "This course examines the ethics, norms, and expectations of the profession of political science and public policy for those engaged in doctoral level study. The course explores topics of professional development to support progress in the degree and building a successful career. Permission of department required.",
        "capacity": 0,
        "credits": [
            0,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Career And Placement Practicum",
        "subjectCode": "POL",
        "courseCode": "68600",
        "instructor": [
            "Logan R Strother"
        ],
        "description": "Provide practical guidance and workshops to help students plan job searches, prepare application materials, and develop skills in public presentations such as video interviews, in-person interviews, job talks, teaching talks, and other public talks. Permission of department required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Interdisciplinary Seminar",
        "subjectCode": "POL",
        "courseCode": "69300",
        "instructor": [
            "David R Johnson"
        ],
        "description": "Topics vary - Interdisciplinary Seminar. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    }
]