[
    {
        "title": "Introduction To Public Health",
        "subjectCode": "PUBH",
        "courseCode": "10001",
        "instructor": [
            "Randolph Duane Hubach"
        ],
        "description": "This course serves as an introduction to the field of public health. Topics include identification of the principal determinants of health and how they affect individuals and populations, the role of government and public health professionals in health and healthcare, and critical and emerging issues in public health in the US and around the world.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Basic Public Health Studies",
        "subjectCode": "PUBH",
        "courseCode": "20500",
        "instructor": [
            "Kelley C Bailey"
        ],
        "description": "Examination of basic scientific concepts as applied to the problems and issues in selected areas of human health behavior with particular attention to their influence on population and individual health. Restricted to students enrolled in major degree programs for which this course is a requirement.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Community, Culture And Social Justice From A Public Health Perspective",
        "subjectCode": "PUBH",
        "courseCode": "23000",
        "instructor": [
            "Stewart C Chang Alexander"
        ],
        "description": "The course provides an introduction to the concepts of community, culture, and social justice. The interaction between community, cultural, ethical, social, economic, environmental, political and social justice dynamics that shape health will be explored.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Internship &amp; Career Preparation",
        "subjectCode": "PUBH",
        "courseCode": "29500",
        "instructor": [
            "Beth Ann Walker"
        ],
        "description": "This course provides students with professional competencies in identification and development of professional resources that aid in a greater understanding and preparation for careers in public health. Upon completion of the course, students will be prepared to seek an internship and apply concepts learned to their professional development experiences.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Health Education In Elementary Schools",
        "subjectCode": "PUBH",
        "courseCode": "30500",
        "instructor": [
            "Kelley C Bailey"
        ],
        "description": "The problems of physical health, mental health, and safety of the school-aged child are considered, with emphasis on ways in which the elementary teacher meets his or her responsibilities and opportunities for promoting pupil health.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Health Behavior And Health Promotion",
        "subjectCode": "PUBH",
        "courseCode": "32000",
        "instructor": [
            "Lorraine Victoria Stigar"
        ],
        "description": "Introduces health behavior theory and practice in the context of health promotion and education. Examines individual, interpersonal, and community approaches to explaining and predicting health behavior and emphasizes their application to interventions in health promotion and education.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Public Health Research Methods",
        "subjectCode": "PUBH",
        "courseCode": "36500",
        "instructor": [
            "Kathryn Jean Laroche"
        ],
        "description": "The course is designed to help you (1) develop an understanding of the nature of research and the scientific method in public health, (2) acquire an appreciation for the different types of research conducted within public health, and (3) provide an overview of the ethical, conceptual, and logistical considerations involved in designing, conducting, and critically evaluating public health research in basic and applied settings.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Public Health Policy",
        "subjectCode": "PUBH",
        "courseCode": "38000",
        "instructor": [
            "Omobukola Otoise Usidame"
        ],
        "description": "This course will provide the opportunity to examine and analyze the financing, organization and delivery of health care in the U.S. and how these core elements are shaped and influenced by health care policy and decision-making.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Human Diseases And Disorders",
        "subjectCode": "PUBH",
        "courseCode": "40000",
        "instructor": [
            "Beth Ann Walker"
        ],
        "description": "The major communicable and noncommunicable diseases and disorders that afflict modern man, with particular emphasis upon the etiology, epidemiology, and ecology of these diseases and disorders.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Principles Of Epidemiology",
        "subjectCode": "PUBH",
        "courseCode": "40500",
        "instructor": [
            "Jorge A Banda"
        ],
        "description": "The study of the distribution of diseases in human populations and factors that influence these distributions.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "PUBH In Dominican Republic",
        "subjectCode": "PUBH",
        "courseCode": "49000",
        "instructor": [
            "Andrea DeMaria",
            "Jacqueline C Linnes"
        ],
        "description": "Various public health topics that may change from semester to semester. Department permission required.",
        "capacity": 0,
        "credits": [
            0,
            6
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Health Equity",
        "subjectCode": "PUBH",
        "courseCode": "50100",
        "instructor": [
            "Carlos Cardell Mahaffey"
        ],
        "description": "This course introduces the participants to graduate level research in health disparities and the various theoretical and analytical skills needed to be a good health disparities researcher. It will take the course participants through the axiological, ontological and epistemological questions that we are confronted within social scientific research. This course will walk the participants through the various research paradigms and the critical debates associated with it so that they can reflect and possibly make an informed choice about their own research priorities. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Randomized Control Trials In Public Health",
        "subjectCode": "PUBH",
        "courseCode": "52600",
        "instructor": [
            "Christina E Munson"
        ],
        "description": "Randomized&nbsp;control&nbsp;trials provide solid evidence on whether interventions and programs \"work\" to improve health outcomes. In this course, students will learn how to design a randomized study, handle practical issues that arise in data collection, analyze data using appropriate methods and good statistical practice, identify limitations to statistical evidence, and interpret and communicate findings in an audience-appropriate way. This is a hands-on course in which students will work with data and build skills using SAS statistical software in preparation for careers as biostatisticians, data scientists, and researchers.&nbsp;Pre-requisite: A graduate level introductory statistics course that includes simple linear regression.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Qualitative Methods For PH",
        "subjectCode": "PUBH",
        "courseCode": "59000",
        "instructor": [
            "Yumary Ruiz"
        ],
        "description": "Various public health topics that may change from semester to semester.",
        "capacity": 0,
        "credits": [
            0,
            9
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Professional Development In Public Health Seminar",
        "subjectCode": "PUBH",
        "courseCode": "60000",
        "instructor": [
            "Shauna S Stapleton"
        ],
        "description": "&nbsp; A professional development course designed to the meet the needs of MPH students in the Department of Public Health.&nbsp;",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Public Health Administration",
        "subjectCode": "PUBH",
        "courseCode": "60400",
        "instructor": [
            "Cody James Mullen"
        ],
        "description": "An introduction to the principals of management as applied to public health organizations, particularly local health departments. Topics include the organization of the U.S. public health system, legal and ethical obligations of public health administrators, the public health workforce and human resource issues, public health budgeting and finance, and leadership in the public health agency. The course is designed to introduce master's level students in public health to the management skills necessary to successfully implement a public health program.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Design And Analysis Of Public Health Interventions",
        "subjectCode": "PUBH",
        "courseCode": "60600",
        "instructor": [
            "Andrea DeMaria"
        ],
        "description": "(CSR 62300) Professional competencies in design, implementation, evaluation and diffusion of health interventions in community settings. Program planning paradigms, determinants of health behavior, and behavior change strategies serve as a basis for analyzing health interventions. Prerequisite: HS 56500.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Culminating Experience",
        "subjectCode": "PUBH",
        "courseCode": "60800",
        "instructor": [
            "Cody James Mullen"
        ],
        "description": "The MPH degree plans of study require a culminating project to be completed in the final semester of study. The student provides evidence of competency mastery by partnering with a public health related agency, identifying a community problem, proposing an evidence-based solution, and developing an evaluation plan. The final product is in the form of a grant proposal. Guidance for proposal development is achieved through completion of a grant-writing workshop and feedback from a faculty advisor. Permission of department required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Graduate Seminar In Public Health",
        "subjectCode": "PUBH",
        "courseCode": "69400",
        "instructor": [
            "TBA"
        ],
        "description": "&nbsp; Seminar course covering a broad range of current research topics in public health and related fields of study. Seminar presentations by representatives from academia, industry, government, other external institutions and organizations, and members of the Purdue University community. Intensive analysis of application of various research and statistical methodologies to the study of public health.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Spring 2024"
    }
]