[
    {
        "title": "Introduction To Communicative Disorders",
        "subjectCode": "SLHS",
        "courseCode": "11500",
        "instructor": [
            "Christi M Masters"
        ],
        "description": "Nature, systems, and causes of communicative disorders and the principal methods used for remediation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Elements Of Linguistics",
        "subjectCode": "SLHS",
        "courseCode": "22700",
        "instructor": [
            "Ronnie B Wilbur",
            "Windi C Krok"
        ],
        "description": "(ENGL 22700) Credit will not be awarded for both SLHS 22700 and LC 26100. A summary of what is known about human language, its structure, its universality, and its diversity; language in its social setting; language in relation to other aspects of human inquiry and knowledge.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Hearing Science",
        "subjectCode": "SLHS",
        "courseCode": "30200",
        "instructor": [
            "Ananthanarayan Krishnan"
        ],
        "description": "An introduction to the scientific foundations of auditory sensation and perception. The course covers those aspects of acoustics most pertinent to understanding auditory processing of simple and complex sounds (e.g. speech and music), the anatomy and physiology of the peripheral and central auditory systems, and a range of auditory perceptual phenomena and their physiological correlates.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Phonetics",
        "subjectCode": "SLHS",
        "courseCode": "30600",
        "instructor": [
            "Alexander L Francis"
        ],
        "description": "Credit will not be given for both SLHS 30600 and LING 31500. An introduction to articulatory phonetics, speech sounds in languages of the world, and principles and symbols of the International Phonetic Alphabet. Extensive practice in phonetic transcription.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Language Development",
        "subjectCode": "SLHS",
        "courseCode": "30900",
        "instructor": [
            "Windi C Krok"
        ],
        "description": "(PSY 42600) Specific nature, sequence, and pattern of oral language development from birth through adolescence. Numerous examples illustrating the nature of language acquisition and approaches to the study of children's language are presented. Linguistic and psychological explanations of the sequence of development are discussed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Hearing Loss Treatment And Management",
        "subjectCode": "SLHS",
        "courseCode": "40200",
        "instructor": [
            "Maureen Joyce Shader"
        ],
        "description": "&nbsp; This course provides a broad introduction to audiological treatment and management of hearing loss and its associated challenges. Course topics include an overview of current technology options, including hearing aids, cochlear implants, assistive listening devices, and tinnitus treatment devices. This course emphasizes appropriate counseling techniques, communication strategies, and patient-centered treatment considerations.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Psycholinguistics",
        "subjectCode": "SLHS",
        "courseCode": "40300",
        "instructor": [
            "Natalya B Kaganovich"
        ],
        "description": "(SLHS 40300) This course aims to introduce students to the current, research-based understanding of how different aspects of language (such as word perception, language acquisition, or speech production) are represented in the mind. In addition, it will introduce some of the research methods employed by language scientists for gaining insight into such a representation. This course also aims to help students learn how to critically evaluate research data used to support various theories about psychological and neural foundations of language knowledge.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Voice, Upper Airway, And Swallowing Disorders",
        "subjectCode": "SLHS",
        "courseCode": "40800",
        "instructor": [
            "Lydia R Kruse"
        ],
        "description": "&nbsp; This course is focused disorders of the larynx and the affect they have on speaking, breathing, and swallowing.&nbsp;This course assumes a basic knowledge of the anatomical and physiological bases of the speech mechanism (SLHS 30300) with an emphasis on the respiratory, laryngeal, and aerodigestive subsystems. Information presented in this course will build on that knowledge and will focus on the&nbsp;etiologies and characteristics&nbsp;of&nbsp;voice, upper airway, and swallowing impairments&nbsp;and the role of speech-language pathologist in assessing and treating these conditions.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To The Neural Bases Of Speech And Hearing",
        "subjectCode": "SLHS",
        "courseCode": "40900",
        "instructor": [
            "Kwang Seob Kim"
        ],
        "description": "&nbsp; An introduction to the neuroanatomy and neurophysiology of the sensory and motor systems involved in speech and hearing. Topics covered include general neuroscience principles, methods for studying the nervous system, and neural mechanisms underlying speech and hearing. The course also introduces disordered systems and contemporary speech and auditory neuroscience research topics.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Understanding Autism",
        "subjectCode": "SLHS",
        "courseCode": "41800",
        "instructor": [
            "Brandon M Keehn"
        ],
        "description": "(HDFS 41800, PSY 41800) This course will explore the etiology, neuroscience, diagnosis, and treatment of autism spectrum disorder (ASD). Approached from a multi-disciplinary perspective this course brings together gene, brain, and behavioral sciences with the aim of developing a better understanding of autism. The course will begin with an overview of ASD as a complex behavioral phenotype. This will include discussion of the history ASD and the expansion of the diagnostic criteria associated with the disorder. This introduction will be followed by several classes in which we will examine some of the key domains of impairment in ASD: reciprocal social interaction, language and communication, and restricted and repetitive behaviors. We will also consider the deficits associate with, but not defining of ASD, and examine co-morbid conditions frequently present in individuals with ASD. We will then address the topics of brain architecture, neurochemistry, and genetics and gene expression, all of which we will attempt to relate back to the behavioral features of autism. We will end the course with a review of treatment practices and their efficacy and an examination of impact of ASD on the family and society.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Developmental Speech And Language Disorders",
        "subjectCode": "SLHS",
        "courseCode": "42000",
        "instructor": [
            "Francoise Brosseau-Lapre"
        ],
        "description": "Students cannot receive credit for both AUS 42000 and AUS 42200. Introduction to disorders of speech and language in children. Characteristics of these disorders, methods of evaluation, and intervention procedures are discussed.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Research In Communication Sciences And Disorders",
        "subjectCode": "SLHS",
        "courseCode": "44400",
        "instructor": [
            "Arianna Nicole Lacroix"
        ],
        "description": "An introduction to fundamental concepts of research in the basic and clinical disorder aspects of speech, language, and hearing processes. Among topics to be covered are research design/strategies, model and theory development, research ethics and data collection and interpretation. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Clinical Practice In Communication Disorders",
        "subjectCode": "SLHS",
        "courseCode": "44900",
        "instructor": [
            "Anne M Gritt"
        ],
        "description": "A course designed to provide instruction in basic diagnostic procedures and therapeutic approaches to speech, language, and hearing disorders.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Aug &amp; Alt Communication",
        "subjectCode": "SLHS",
        "courseCode": "51900",
        "instructor": [
            "Michelle L Gutmann"
        ],
        "description": "Study of special topics, drawn from areas not covered in permanent courses. Topics may vary from semester to semester.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Language Disorders In Adults",
        "subjectCode": "SLHS",
        "courseCode": "53100",
        "instructor": [
            "Jiyeon Lee"
        ],
        "description": "Study of the causes, assessment, and treatment of acquired language disorders in adults, including aphasia, right hemisphere syndromes, and dementia.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Voice Disorders",
        "subjectCode": "SLHS",
        "courseCode": "53200",
        "instructor": [
            "Allison J Schaser"
        ],
        "description": "Principles of differential diagnosis and clinical management for children and adults presenting voice disorders, based on a working knowledge of normal laryngeal structure and function.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Motor Disorders Of Speech",
        "subjectCode": "SLHS",
        "courseCode": "53800",
        "instructor": [
            "Joanne M Gutek"
        ],
        "description": "A study of the neuropathologies that affect the speech production system. Emphasizes the differential diagnosis and management of acquired motor speech disorders.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Clinical Seminar In Speech-Language Pathology",
        "subjectCode": "SLHS",
        "courseCode": "54600",
        "instructor": [
            "Chenell Loudermill"
        ],
        "description": "This is a clinical seminar course designed to support students' ability to meet knowledge and skills standards related to the scope of practice of speech-language pathologists. This course provides supplemental learning opportunities and support for students as they complete their hands-on clinical practice each semester by taking a more in-depth look at conditions within the nine areas of practice as well as cultural and linguistically diverse families, ethical standards in clinical practice, professional issues and trends within communication sciences and disorders, and interprofessional education and practice. The course is offered each semester and objectives vary to advance the knowledge and skills required to meet the program and ASHA/CAA guidelines for completion of the program as well as certification standards as indicated by the CFCC.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Implantable Devices",
        "subjectCode": "SLHS",
        "courseCode": "55300",
        "instructor": [
            "Maureen Joyce Shader"
        ],
        "description": "Provides fundamental principles to assist audiologists and speech-language pathologists in the understanding of candidacy, principles of signal processing, and audiologic rehabilitation for children and adults who use cochlear implants.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Medical Audiology",
        "subjectCode": "SLHS",
        "courseCode": "56100",
        "instructor": [
            "Whitney Elise Lyle"
        ],
        "description": "Study of the etiology, pathogenesis, symptomology, epidemiology, diagnosis and treatment of diseases, and injuries to the auditory system.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Hearing Aids I",
        "subjectCode": "SLHS",
        "courseCode": "56400",
        "instructor": [
            "Joshua M Alexander"
        ],
        "description": "An examination of amplification systems as applied in audiological rehabilitation; acoustic, electroacoustic, electronic, and clinical considerations. Laboratory exercises in measurement, modifications, maintenance, selection, and dispensing of hearing aid systems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Auditory Evoked Responses I",
        "subjectCode": "SLHS",
        "courseCode": "56700",
        "instructor": [
            "Ananthanarayan Krishnan"
        ],
        "description": "Evaluation of peripheral and brainstem auditory system function using evoked potentials.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Hearing Conservation",
        "subjectCode": "SLHS",
        "courseCode": "57000",
        "instructor": [
            "Anne E Sommer"
        ],
        "description": "A study of noise as a health hazard and as a nuisance; an examination of the ways in which hearing problems related to noise may be reduced. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Clinical Practice In Audiology",
        "subjectCode": "SLHS",
        "courseCode": "57900",
        "instructor": [
            "Jennifer M Simpson"
        ],
        "description": "Supervised clinical practicum in evaluation of hearing and communication status and in remediation of communication problems. Clinical practices include, but are not limited to, auditory site of lesion, sensory aid selection, fitting and evaluation and communication training for children and adults. Clinical practicum is available in the M. D. Steer Audiology Center and off-campus facilities. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            12
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Evaluating Research In Evidence-Based Practice",
        "subjectCode": "SLHS",
        "courseCode": "58800",
        "instructor": [
            "Windi C Krok"
        ],
        "description": "&nbsp;The focus of this course is on developing the skills necessary to critically consume literature and apply it to clinical practice as speech-language pathologists and audiologists. Students complete a comprehensive evidence-based practice project, which includes developing a clinical question, conducting a literature review, and critiquing acquired research articles. They gain guidance from a skilled mentor in their research area and receive course instruction on best practices in appraising research necessary for evidence-based practice.&nbsp;&nbsp;",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Res &amp; Prof Issues",
        "subjectCode": "SLHS",
        "courseCode": "61900",
        "instructor": [
            "Maureen Joyce Shader",
            "Allison J Schaser",
            "Chenell Loudermill"
        ],
        "description": "Study of advanced topics, varying from semester to semester. Course content will be drawn from areas for which there are no permanent courses.",
        "capacity": 0,
        "credits": [
            0,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Audiology Practice Management",
        "subjectCode": "SLHS",
        "courseCode": "65900",
        "instructor": [
            "Shannon M Van Hyfte"
        ],
        "description": "An examination of business and professional issues related to audiology. Practice management topics include conducting a feasibility analysis, writing a business plan, employee management, marketing, reimbursement, and practice growth. Professional issues include licensing, certification, liability issues, and career planning. Prerequisite: SLHS 57900 and Doctor of Audiology majors only.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Medical Audiology",
        "subjectCode": "SLHS",
        "courseCode": "66100",
        "instructor": [
            "Nicole Olivia Mielnicki"
        ],
        "description": "The clinical practice of audiology encompasses the audiological assessment and habilitation/rehabilitation of hearing loss arising from a wide variety of medical and environmental etiologies. It is essential that audiologists have a firm understanding of the most common causes and medical treatments of hearing impairment for all age groups. Additionally, the future clinician will be better served by recognizing how rapidly information changes in this arena and becoming comfortable with reliable educational resources that are available for life-long learning in this area. Audiologists also practice in a medical setting and thus must be comfortable with the medical approaches and terminology used by otolaryngologists, otologists, neuro-otologists, pediatricians, radiologists, anesthesiologists and other physicians. Additionally, audiologists may be the first contact with a hearing-impaired patient and their role in the referral process will be emphasized.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Integrative Audiology Grand Rounds",
        "subjectCode": "SLHS",
        "courseCode": "67000",
        "instructor": [
            "Jennifer M Simpson"
        ],
        "description": "&nbsp; This course provides advanced audiology students an opportunity to share and think deeply about the complex cases they are experiencing on off-campus placements. Students share cases online with their peer students who will provide thoughtful responses and reflections based on their own experiences. This course also provides a summative assessment of the students' knowledge in the final two years of their education. Due to the highly complex nature of the cases, students must use past clinical experiences and knowledge learned in multiple courses in order to successfully present cases and to respond in thoughtful ways that contribute to the online learning environment. Permission of department required; must also be currently enrolled in SLHS 57900 or SLHS 67900 completing an audiology externship.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    }
]