[
    {
        "title": "Statistics And Society",
        "subjectCode": "STAT",
        "courseCode": "11300",
        "instructor": [
            "Cheryl Lynn Crabill"
        ],
        "description": "Introduction to statistical ideas and their impact on public policy and the sciences. Sample surveys, design of experiments, measurement, analysis of data, simulating probabilities, concepts of inference. Application to current issues and controversies. Not available for credit toward graduation in the School of Science.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Data Science",
        "subjectCode": "STAT",
        "courseCode": "24200",
        "instructor": [
            "TBA"
        ],
        "description": "(CS 24200) This course provides a broad introduction to the field of data science. The course focuses on using computational methods and statistical techniques to analyze massive amounts of data and to extract knowledge. It provides an overview of foundational computational and statistical tools for data acquisition and cleaning, data management and big data systems. The course surveys the complete data science process from data to knowledge and gives students hands-on experience with tools and methods. Basic knowledge of Python required. Computer Science majors cannot count this course as a degree requirement but can take it for credit as a free elective if taken before CS 37300, 34800, 47100, 47300, 44800.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Problems Solving In Probability",
        "subjectCode": "STAT",
        "courseCode": "25000",
        "instructor": [
            "TBA"
        ],
        "description": "(MA 25000) This course is designed to teach techniques for solving problems in probability theory which are relevant to the actuarial sciences. It is intended to help actuarial students prepare for the Society of Actuaries and Casualty Actuarial Society Exam P/1.  Credit by Examination is not available for this course. MA/STAT 41600 is strongly recommended.",
        "capacity": 0,
        "credits": [
            2,
            2
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Elementary Statistical Methods",
        "subjectCode": "STAT",
        "courseCode": "30100",
        "instructor": [
            "Bruce P Solomon",
            "Joshua David Rendall",
            "Lynda Aouar",
            "Christina E Munson",
            "April Isom-Tyler",
            "William Cochrane Mercier",
            "Jiwon Jung",
            "Hanbyul Lee",
            "James G Maley"
        ],
        "description": "Introduction to statistical methods with applications to diverse fields. Emphasis on understanding and interpreting standard techniques. Data analysis for one and several variables, design of samples and experiments, basic probability, sampling distributions, confidence intervals and significance tests for means and proportions, correlation and regression. Software is used throughout. For statistics majors and minors, credit should be allowed in no more than one of STAT 30100, 30301, 35000, 35500, 50100, and in no more than one of STAT 50300 and STAT 51100. Prerequisite: college algebra.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Probability And Statistics For Business",
        "subjectCode": "STAT",
        "courseCode": "30301",
        "instructor": [
            "TBA"
        ],
        "description": "An introduction to basic probability theory. Discussion of descriptive statistics, sampling technique/distributions, Central Limit Theorem, confidence intervals and hypothesis tests for means and proportions. Students will utilize software as needed. For statistics majors and minors, credit should be allowed in no more than one of STAT 30100, 30301, 35000, 35500, 50100, and in no more than one of STAT 50300 and STAT 51100.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introductory Probability",
        "subjectCode": "STAT",
        "courseCode": "31100",
        "instructor": [
            "Leonore A Findsen"
        ],
        "description": "Formulation of probability problems, discrete and continuous random variables, expectation, standard distributions, applications to statistical problems, and problems in the physical sciences. Credit cannot be given for more than one of STAT 22500, 31100, or 41600. Prerequisite: two semesters of college calculus.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Statistics",
        "subjectCode": "STAT",
        "courseCode": "35000",
        "instructor": [
            "Anand Dixit"
        ],
        "description": "A data-oriented introduction to the fundamental concepts and methods of applied statistics. Exploratory analysis of data. Sample design and experimental design. Probability distributions and simulation. Sampling distributions. The reasoning of statistical inference. Confidence intervals and tests for one and two samples. Inference for contingency tables, regression, and correlation. Introduction to regression with several explanatory variables. Essential use is made of statistical software throughout. Intended primarily for students majoring in the mathematical sciences. For statistics majors and minors, credit should be allowed in no more than one of STAT 30100, 30301, 35000, 35500, 50100, and in no more than one of STAT 50300 and STAT 51100. Prerequisite: two semesters of college calculus.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Statistics For Data Science",
        "subjectCode": "STAT",
        "courseCode": "35500",
        "instructor": [
            "Timothy J Keaton"
        ],
        "description": "An introduction to methodologies for data analysis and simulation. Populations and sampling. Distributions and summaries of distributions. Algorithms for sampling and resampling. Foundational statistical concepts including confidence intervals, hypothesis testing, correlation. Introduction to classification and regression. Essential use is made of statistical software throughout. For statistics majors and minors, credit should be allowed in no more than one of STAT 30100, 30301, 35000, 35500, 50100, and in no more than one of STAT 50300 and STAT 51100.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Probability",
        "subjectCode": "STAT",
        "courseCode": "41600",
        "instructor": [
            "Christian James Noack",
            "Lin Wang",
            "Andrey Glubokov",
            "Takashi Owada"
        ],
        "description": "(MA 41600) An introduction to mathematical probability suitable as preparation for actuarial science, statistical theory, and mathematical modeling. General probability rules, conditional probability and Bayes theorem, discrete and continuous random variables, moments and moment generating functions, joint and conditional distributions, standard discrete and continuous distributions and their properties, law of large numbers and central limit theorem. Credit cannot be given for more than one of STAT 22500, 31100, or 41600. Prerequisite: multivariate calculus.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Statistical Theory",
        "subjectCode": "STAT",
        "courseCode": "41700",
        "instructor": [
            "Anindya Bhadra",
            "Andrew Noel Yarger",
            "Fei Xue"
        ],
        "description": "An introduction to the mathematical theory of statistical inference, emphasizing inference for standard parametric families of distributions. Properties of estimators. Bayes and maximum likelihood estimation. Sufficient statistics. Properties of test of hypotheses. Most powerful and likelihood-ratio tests. Distribution theory for common statistics based on normal distributions.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Time Series",
        "subjectCode": "STAT",
        "courseCode": "42000",
        "instructor": [
            "S M Khurshid Alam"
        ],
        "description": "An introduction to time series analysis suitable for actuarial science, engineering, and sciences. Model building and forecasting with ARMA and ARIMA models. Resampling methods for confidence intervals. Multivariate, state-space, and nonlinear models. Volatility models (ARCH and GARCH). Smoothing in time series.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Actuarial Models-Life Contingencies",
        "subjectCode": "STAT",
        "courseCode": "47201",
        "instructor": [
            "Sally Anne Ray"
        ],
        "description": "Mathematical foundation of actuarial science, emphasizing probability models for life contingencies as the basis for analyzing life insurance and life annuities and determining premiums and reserves. This course provides the background for Course MLC of the Society of Actuaries and Course 3L of the Casualty Actuarial Society.",
        "capacity": 0,
        "credits": [
            4,
            4
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Arbitrage-Free Pricing Of Financial Derivatives",
        "subjectCode": "STAT",
        "courseCode": "47301",
        "instructor": [
            "Daniel E Rubin"
        ],
        "description": "This course exposes students to a number of financial economics concepts related to arbitrage-free option pricing in the binomial market model and the Black-Scholes model. Specific models include (1) Options and parity relationship between options; (2) Option Pricing under the Binomial model; (3) Option Pricing under the Black-Scholes model; (4) Option hedging and the market maker 's overnight profit; (5) Black Scholes theory with Brownian motion and Ito calculus; (6) Risk-neutral option pricing and Monte Carlo valuation; (7) Stochastic interest rates and Stochastic Volatility. This course provides the background for Couse MFE of the Society of Actuaries and Course 3F of the Casualty Actuarial Society.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Statistics For Risk Modeling",
        "subjectCode": "STAT",
        "courseCode": "47401",
        "instructor": [
            "Haibo Liu"
        ],
        "description": "&nbsp; This course introduces various statistics learning methods for analyzing insurance data. The main objective is to prepare actuarial science students for the Exam SRM: Statistics for Risk Modeling of the Society of Actuaries.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Long Term Actuarial Mathematics",
        "subjectCode": "STAT",
        "courseCode": "47501",
        "instructor": [
            "Mengyi Xu"
        ],
        "description": "This course covers advanced life contingencies topics such as multiple decrement models, joint life models, pension models, and profit emergence and testing for insurance products. It builds on the basic life contingent models learned in STAT 47200.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Short Term Fundamental Actuarial Models",
        "subjectCode": "STAT",
        "courseCode": "47902",
        "instructor": [
            "Daniel E Rubin"
        ],
        "description": "This course aligns with one of the Society of Actuaries examinations. The course will cover the learning objectives for a portion of the Society of Actuaries Examination STAM. Permission of department required. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Actuarial Science Capstone",
        "subjectCode": "STAT",
        "courseCode": "49000",
        "instructor": [
            "Daniel E Rubin",
            "Jianxi Su",
            "S M Khurshid Alam"
        ],
        "description": "Supervised reading course or special topics course at the senior level for undergraduates are given under this number. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            5
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Experimental Statistics I",
        "subjectCode": "STAT",
        "courseCode": "50100",
        "instructor": [
            "Leonore A Findsen"
        ],
        "description": "Concepts and methods of applied statistics. Exploratory analysis of data. Sample design and experimental design. Normal distributions. Sampling distributions. Confidence intervals and tests of hypotheses for one and two samples. Inference for contingency tables, regression and correlation, and one-way analysis of variance. Use of the SAS statistical software. Intended primarily for students who have not had calculus. Not open to students in mathematical sciences or engineering. For statistics majors and minors, credit should be allowed in no more than one of STAT 30100, STAT 30301, STAT 35000, STAT 35500, STAT 50100, and in no more than one of STAT 50300 and STAT 51100. Prerequisite: College Algebra.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Experimental Statistics II",
        "subjectCode": "STAT",
        "courseCode": "50200",
        "instructor": [
            "Yuan Qu"
        ],
        "description": "Regression with several explanatory variables. Regression diagnostics. Analysis of variance for factorial designs. Multiple comparisons. Analysis of covariance. Repeated measures designs. Extensive use of the SAS statistical software. Intended primarily for students who have not had calculus. Not open to students in mathematical sciences or engineering.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Statistical Methods For Biology",
        "subjectCode": "STAT",
        "courseCode": "50300",
        "instructor": [
            "Yan Xing",
            "Lynda Aouar"
        ],
        "description": "Introductory statistical methods, with emphasis on applications in biology. Topics include descriptive statistics, binomial and normal distributions, confidence interval estimation, hypothesis testing, analysis of variance, introduction to nonparametric testing, linear regression and correlation, goodness-of-fit tests, and contingency tables. Open only to majors related to the life sciences. For statistics majors and minors, credit should be allowed in no more than one of STAT 30100, STAT 30301, STAT 35000, STAT 35500, STAT 50100, and in no more than one of STAT 50300 and STAT 51100.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Statistical Programming And Data Management",
        "subjectCode": "STAT",
        "courseCode": "50600",
        "instructor": [
            "Timothy J Keaton"
        ],
        "description": "Use of the SAS software system for managing statistical data. The SAS environment. Data description. Data access and management. SAS macro language and application development. Prerequisite: STAT 51200 and coursework in computer programming.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Statistical Methods",
        "subjectCode": "STAT",
        "courseCode": "51100",
        "instructor": [
            "Yuan Qu",
            "William S Cleveland",
            "Jun Xie",
            "Lingsong Zhang",
            "Tonglin Zhang"
        ],
        "description": "Descriptive statistics; elementary probability; sampling distributions; inference, testing hypotheses, and estimation; normal, binomial, Poisson, hypergeometric distributions; one-way analysis of variance; contingency tables; regression. For statistics majors and minors, credit should be allowed in no more than one of STAT 30100, STAT 30301, STAT 35000, STAT 35500, STAT 50100, and in no more than one of STAT 50300 and STAT 51100. Prerequisite: Two semesters of college calculus.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Applied Regression Analysis",
        "subjectCode": "STAT",
        "courseCode": "51200",
        "instructor": [
            "Tiantian Qin"
        ],
        "description": "Inference in simple and multiple linear regression, residual analysis, transformations, polynomial regression, model building with real data, nonlinear regression. One-way and two-way analysis of variance, multiple comparisons, fixed and random factors, analysis of covariance. Use of existing statistical computer programs. Prerequisite: Coursework in Statistical Methods with a calculus prerequisite.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Statistical Quality Control",
        "subjectCode": "STAT",
        "courseCode": "51300",
        "instructor": [
            "Dennis Kj Lin"
        ],
        "description": "A strong background in control charts including adaptations, acceptance sampling for attributes and variables data, standard acceptance plans, sequential analysis, statistics of combinations, moments and probability distributions, applications.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Design Of Experiments",
        "subjectCode": "STAT",
        "courseCode": "51400",
        "instructor": [
            "Bowei Xi"
        ],
        "description": "Fundamentals, completely randomized design; randomized complete blocks; latin square; multi-classification; factorial; nested factorial; incomplete block and fractional replications for 2n, 3n, 2m x 3n; confounding; lattice designs; general mixed factorials; split plot; analysis of variance in regression models; optimum design. Use of existing statistical programs.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Statistical Consulting Problem",
        "subjectCode": "STAT",
        "courseCode": "51500",
        "instructor": [
            "Bruce A Craig"
        ],
        "description": "A written report of a consultation problem involving a designed experiment or sampling plan in which the student participates with members of the Department of Statistics staff. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Basic Probability And Applications",
        "subjectCode": "STAT",
        "courseCode": "51600",
        "instructor": [
            "Michael Levine"
        ],
        "description": "A first course in probability, intended to serve as a background for statistics and other applications. Sample spaces and axioms of probability, discrete and continuous random variables, conditional probability and Bayes' theorem, joint and conditional probability distributions, expectations, moments and moment generating functions, law of large numbers, and central limit theorem. (The probability material in course one of the Society of Actuaries and the Casualty Actuarial Society is covered by this course.)",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Statistical Inference",
        "subjectCode": "STAT",
        "courseCode": "51700",
        "instructor": [
            "Chuanhai Liu"
        ],
        "description": "A basic course in statistical theory covering standard statistical methods and their application. Estimation including unbiased, maximum likelihood and moment estimation; testing hypotheses for standard distributions and contingency tables; confidence intervals and regions; introduction to nonparametric tests and linear regression.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Probability",
        "subjectCode": "STAT",
        "courseCode": "51900",
        "instructor": [
            "Nianqiao Ju"
        ],
        "description": "(MA 51900) Algebra of sets, sample spaces, combinatorial problems, independence, random variables, distribution functions, moment generating functions, special continuous and discrete distributions, distribution of a function of a random variable, limit theorems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Time Series And Applications",
        "subjectCode": "STAT",
        "courseCode": "52000",
        "instructor": [
            "Chong Gu"
        ],
        "description": "A first course in stationary time series with applications in engineering, economics, and physical sciences. Stationarity, autocovariance function and spectrum; integral representation of a stationary time series and interpretation; linear filtering, transfer functions; estimation of spectrum; multivariate time series. Use of computer programs for covariance and spectral estimation.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Sampling And Survey Techniques",
        "subjectCode": "STAT",
        "courseCode": "52200",
        "instructor": [
            "Sharon L Christ"
        ],
        "description": "Survey designs; simple random, stratified, and systematic samples; systems of sampling; methods of estimation; costs. Offered in alternate years.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Advanced Statistical Methodology",
        "subjectCode": "STAT",
        "courseCode": "52600",
        "instructor": [
            "Qifan Song"
        ],
        "description": "As a sequel to STAT 52500, this course introduces some statistical modeling tools that are developed for situations where least squares regression and standard ANOVA techniques may not naturally apply. One coverage centers around two lines of models that are closely related, the generalized linear models (GLM) for regression (and ANOVA) with non-Gaussian responses, and survival models for the analysis of lifetime data. Among issues to be discussed are the estimation of the models, the testing of hypotheses, and the checking of model adequacy. Data examples will be used throughout the course to illustrate the methodologies and the related software tools in R.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Computing For Statistics",
        "subjectCode": "STAT",
        "courseCode": "52700",
        "instructor": [
            "Chuanhai Liu"
        ],
        "description": "&nbsp; This course provides a thorough introduction to the R programming language, and its use for statistical computing and data science. The course will first look at the fundamentals of R, including different data-structures, control-flow, and the basic vocabulary. An emphasis will be placed on learning idiomatic and efficient R, covering ideas such as recycling, vectorization and functional programming. The course will then look at principles and tools for tasks like organizing data ('tidy data'), manipulating data ('data carpentry'), querying data (through topics like regular expressions) as well as visualizing data (including interactive visualizations). The material and the homework will encourage development of modular reusable code and reproducible research through ideas such as object-oriented programming and dynamic documents in R Markdown. The last part of the course will study statistical procedures such as least-squares regression, LASSO, Monte Carlo sampling and Markov chain Monte Carlo. Besides exams and homework, the course will involve a final project that students can collaborate together on.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Introduction To Mathematical Statistics",
        "subjectCode": "STAT",
        "courseCode": "52800",
        "instructor": [
            "Yu Michael Zhu"
        ],
        "description": "Distribution of mean and s2 in normal samples, sampling distributions derived from the normal distribution, Chi square, t and F. Distribution of statistics based on ordered samples. Asymptotic sampling distributions. Introduction to multivariate normal distribution and linear models. Sufficient statistics, maximum likelihood, least squares, linear estimation, other methods of point estimation, and discussion of their properties, Cramer-Rao inequality and Rao-Blackwell theorem. Tests of statistical hypotheses, simple and composite hypotheses, likelihood ratio tests, power of tests.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Applied Decision Theory And Bayesian Statistics",
        "subjectCode": "STAT",
        "courseCode": "52900",
        "instructor": [
            "Anirban Dasgupta"
        ],
        "description": "Bayesian and decision-theoretic formulation of problems; construction of utility functions and quantifications of prior information; methods of Bayesian decision and inference, with applications; empirical Bayes; combination of evidence; Bayesian design and sequential analysis; comparisons of statistical paradigms.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Elements Of Stochastic Processes",
        "subjectCode": "STAT",
        "courseCode": "53200",
        "instructor": [
            "Samy Tindel"
        ],
        "description": "(MA 53200) A basic course in stochastic models, including discrete and continuous time Markov chains and Brownian motion, as well as an introduction to topics such as Gaussian processes, queues, epidemic models, branching processes, renewal processes, replacement, and reliability problems.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Probability Theory I",
        "subjectCode": "STAT",
        "courseCode": "53800",
        "instructor": [
            "Christopher Janjigian"
        ],
        "description": "(MA 53800) Mathematically rigorous, measure-theoretic introduction to probability spaces, random variables, expectation, independence, weak and strong laws of large numbers, conditional expectations, and martingales.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Computational Statistics",
        "subjectCode": "STAT",
        "courseCode": "54600",
        "instructor": [
            "Antik Chakraborty"
        ],
        "description": "The course focuses on two fundamental aspects in computational statistics: (1) what to compute and (2) how to compute. The first is covered with a brief review of advanced topics in statistical inference, including Fisher's fiducial inference, Bayesian and frequenstist methods, and the Dempster-Shafer (DS) Theory. The second is discussed in detail by examining exact, approximation, and interactive simulation methods for statistical inference with a variety of commonly used statistical models. The emphasis is on the EM-type and quasi-Newton algorithms, numerical differentiation and integration, and Markov chain Monte Carlo methods.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Theory Of Linear Models And Analysis Of Experimental Designs",
        "subjectCode": "STAT",
        "courseCode": "55300",
        "instructor": [
            "Faming Liang"
        ],
        "description": "Least squares analysis of linear models. Gauss Markov Theorem. Estimability and testability of parameters. Confidence regions and prediction regions. Introduction to design of experiments. Analysis of variance. Factorial and block designs. Analysis of random, fixed, and mixed models. Components of variance. Distribution of linear and quadratic forms in normal vectors. A firm background in matrix algebra and some previous exposure to linear models or analysis of variance is desirable.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Statistical Consulting And Collaboration",
        "subjectCode": "STAT",
        "courseCode": "58200",
        "instructor": [
            "Bruce A Craig"
        ],
        "description": "This course is designed to emphasize and develop the skills needed by a statistical consultant/collaborator. Topics include: problem solving, consulting session management, written and oral communication, research ethics, design of experiments, collection of data, and application of statistical methods to real problems. Class activities include actively participating in consulting sessions held by the Statistical Consulting Service, small group projects, short papers, and oral presentations.  Permission of instructor required.",
        "capacity": 0,
        "credits": [
            3,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Statistical Consulting Seminar",
        "subjectCode": "STAT",
        "courseCode": "59700",
        "instructor": [
            "Bruce A Craig"
        ],
        "description": "Active participation in weekly consulting meetings, directed reading in the statistical literature, application of statistical methods to real problems, report writing. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Machine Learning I",
        "subjectCode": "STAT",
        "courseCode": "59800",
        "instructor": [
            "Kiseop Lee",
            "Qi Guo",
            "William S Cleveland"
        ],
        "description": "Credit Hours: 0.00 to 6.00 (West Lafayette, IUPUI) 1.00 to 3.00 (Northwest).  Directed study and reports for students who wish to undertake individual reading and study on approved topics. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            0,
            0
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Probability Seminar",
        "subjectCode": "STAT",
        "courseCode": "69100",
        "instructor": [
            "Christopher Janjigian"
        ],
        "description": "Topics vary. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Research Colloquium",
        "subjectCode": "STAT",
        "courseCode": "69200",
        "instructor": [
            "Lin Wang"
        ],
        "description": "A colloquium or seminar course with discussion. Colloquium speakers present current technical results from statistics. A discussion follows in which the speaker and instructor take questions and explain issues in detail. Students give reports on lectures. Permission of department required.",
        "capacity": 0,
        "credits": [
            1,
            1
        ],
        "term": "Spring 2024"
    },
    {
        "title": "Mdl Based Clsterng &amp; Classfctn",
        "subjectCode": "STAT",
        "courseCode": "69500",
        "instructor": [
            "Michael Levine",
            "Raghu Pasupathy"
        ],
        "description": "Topics vary. Permission of instructor required.",
        "capacity": 0,
        "credits": [
            1,
            3
        ],
        "term": "Spring 2024"
    }
]